package com.example.nazanin.hospitalapp.Illness;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentTransaction;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

import com.example.nazanin.hospitalapp.MainActivity;
import com.example.nazanin.hospitalapp.R;


public class IllnessNorology extends Fragment {


    private ListView listNorolo;
    private String[] list={"ام اس","تشنج","سکته مغزی","گیلن باره" ,"میاستنی گراو" };


    public static IllnessEye newInstance() {
        IllnessEye fragment = new IllnessEye();

        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_illness_norology, container, false);
        listNorolo = v.findViewById(R.id.listNorolo);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(getContext(),R.layout.list_textview,list);
        listNorolo.setAdapter(adapter);
        listNorolo.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                switch (position){
                    case 0:
                        FragmentTransaction transaction = getFragmentManager().beginTransaction();
                        InfoIllness fragment = new InfoIllness();
                        fragment.SetTitle("ام اس");
                        fragment.SetBody("هدف کلی:\n" +
                                "آگاهی و شناخت بیماری و چگونگی مراقبت از این افراد و آموزش مراقبت از خود\n" +
                                "اهداف رفتاری\n" +
                                "شناختی :  \n" +
                                "•\tشناخت ماهیت بیماری، علایم و روش های تشخیصی و درمان\n" +
                                "روانی –حرکتی : \n" +
                                "•\tاجرای صحیح مراقبت های پرستاری در رابطه با بیماری\n" +
                                "•\tآموزش صحیح به بیماران جهت خودمراقبتی در منزل و پیگیری مجدد\n" +
                                "عاطفی : \n" +
                                "•\tدرک اهمیت اصول صحیح مراقبت های پرستاری\n" +
                                "•\tدرک اهمیت آموزش صحیح به بیمار \n" +
                                "\n" +
                                "مولتيپل اسکلروزيس(ام اس) چيست ؟ \n" +
                                "\n" +
                                "\n" +
                                "مولتيپل اسکلروزيس يا بيماري ماه رويان حمله سيستم ايمني بدن به خود بدن با علت ناشناخته است . \n" +
                                "اين بيماري اعصاب مرکزي ( مغز و نخاع) را در قسمت هاي مختلف درگير مي کند . \n" +
                                "در اين بيماري ميلين ( ماده پوشاننده سلولهاي عصبي) که در انتقال پيام هاي عصبي در طول رشته هاي عصبي نقش دارد آسيب مي بيند . اگر آسيب ميلين جزئي باشد پيامهاي عصبي با اختلالات کمتري منتقل مي شوند و اگر آسيب ميلين زياد باشد بافت اسکار مانند ( زخمي شکل) جايگزين ميلين مي شود و از اين رو انتقال پيامهاي عصبي ممکن است بطور کامل قطع شود .\n" +
                                "اين بيماري بيشتر در افراد جوان   30 – 25 سال مي باشد ولي گاهي زودتر يا ديرتر از اين سنين نيز رخ مي دهد . در زنان شايع تر بوده ، به ازاي هر مرد ، سه زن مبتلا هستند . \n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "*  علت بيماري ام اس چيست ؟ \n" +
                                "علت دقيق اين بيماري معلوم نيست ولي بعضي از عوامل در بروز آن تاثير دارند . مانند : \n" +
                                "•\tعوامل عفوني ( ويروسها) \n" +
                                "•\tعوامل ژنتيک \n" +
                                "•\tآب و هوا ( در آب و هواي معتدل بيشتر از آب و هواي مناطق گرم استوايي است)\n" +
                                "•\tنژاد ( در سفيد پوستان بيشتر است)\n" +
                                "•\tاسترسها و فشارهاي عصبي و نگراني و خود خوري \n" +
                                "•\tعدم دريافت ويتامين D کافي از خورشيد\n" +
                                "•\tاستعمال دخانيات ، آلودگي هوا ، تغذيه نيز موثر مي باشد . \n" +
                                "علائم بيماري ام اس چيست ؟\n" +
                                "•\tعلائم بيماري بسته به منطقه تخريب ميلين در مغز و نخاع در افراد مختلف و حتي در يک فرد در زمان هاي مختلف متفاوت است . \n" +
                                "( بيماري هزار چهره) علائم شامل : \n" +
                                "•\tضعف و خستگي ، بي حسي و کرختي به خصوص در اندام تحتاني ، تاري ديد و دو بيني اشکال در تعادل ، تغيير خلق مانند افسردگي ، اشکال در صحبت کردن ، لرزيدن يا رعشه ، درد يا گرفتگي عضلاني ، اشکال در حافظه و مشکلات جنسي . علائم به طور ناگهاني شروع و چند روز يا چندهفته ادامه مي يابد و دوباره ناپديد مي شود و شايع ترين شکل ام اس به صورت عود علائم و بهبود علائم مي باشد و اکثر مواقع ما بين دو حمله بيماري پيشرفت نمي کند و حالت و شرايط بيمار ثابت مي ماند. \n" +
                                "\n" +
                                "تشخيص بيماري :\n" +
                                "•\tتشخيص نهايي بيماري با ام آر آي مغز و گاهي نمونه گيري از مايع مغزي نخاعي داده مي شود . پس از آن بيمار تحت درمان قرار مي گيرد . \n" +
                                "•\tابتلا به ام اس به معني ناتواني نيست : ممکن است شما قادر به انجام بعضي از کارهاي روزانه خود نباشيد و احساس خستگي و ضعف عضلاني داشته باشيد ، اين مسئله گاهي باعث تشويش و نگراني و حتي افسردگي مي شود . \n" +
                                "•\tبنابراين مراقب سلامتي رواني خود بوده و با پيگيري برنامه هاي درماني و داروها نتايج مثبت آن را در زندگي خود مشاهده کنيد . \n" +
                                "درمان : \n" +
                                "•\tاين بيماري فعلا درمان قطعي و کامل ندارد ، درمان هاي موجود در بهبود وضعيت زندگي بيماران موثر مي باشند . \n" +
                                "•\tامروزه سه نوع درمان براي ام اس وجود دارد : \n" +
                                " درمان حملات \n" +
                                "•\tدر زمان شروع حملات توسط متخصص مغز و اعصاب در بيمارستان بستري شده و معمولا از مثيل پردنيزولون تزريقي استفاده مي شود . \n" +
                                "•\tدر زمان بستري و مصرف اين دارو رژيم کم نمک و پرپتاسيم ( مثل موز ، پرتقال ، کيوي ، گوجه فرنگي ، بادام و خرما و انگور) استفاده کنيد همچنين مواد غذايي با کلسيم بالا ( لبنيات کم چرب ) استفاده کنيد . \n" +
                                "درمان اساسي بيماري : \n" +
                                "•\tداروهاي تعديل کننده سيستم ايمني استفاده شده که تعداد دفعات عود بيماري و طول مدت عود را کاهش مي دهد داروهاي آن شامل : \n" +
                                "•\tآونکس و سينووکس ، ربيف ، اکستاويا و ... ) با دستور پزشک معالج استفاده مي شود . \n" +
                                "•\tتقريباً تمام بيماران به هنگام مصرف اين داروها از تب خفيف و ضعف عمومي و سردرد ، درد عضلاني و گاهي تهوع را تجربه مي کنند که می توان با مصرف تب بر استامينوفن بدون کدئين و ايبوپروفن    4 ساعت قبل و بعد از تزريق دارو از اين عوارض کاست . \n" +
                                "       درمان علامتي بيماري : \n" +
                                "•\tدرمان علائم بيماري مي باشد مثل يبوست ، افسردگي ، خستگي و ... که با درمان هاي دارويي و غير دارويي ( ورزش ، طب سنتي ، فيزيوتراپي و ماساژ ، گفتار درماني ) مي باشد . \n" +
                                "•\t ورزش کنيد : \n" +
                                "•\tورزش علاوه بر بهبود وضعيت جسمي شما ، روحيه اي شاداب تر به شما مي بخشد ، شما را فعال و پر انرژي مي کند و از اضطراب شما مي کاهد . \n" +
                                "•\tقبل از شروع ورزش ، با پزشک مشورت و براي ورزش خود برنامه ريزي کنيد. \n" +
                                "•\tقبل از ورزش بدنتان را گرم کنيد و زمان آن را کم کم افزايش دهيد . \n" +
                                "•\tدر فضاي امن و بي خطر که امکان لغزندگي ندارد ورزش کنيد . \n" +
                                "•\tاز ورزشهاي نشاط آور و لذت بخش استفاده کنيد . پياده روي ، يوگا و شنا مفيد هستند . \n" +
                                "•\tهر وقت احساس ناراحتي کرديد ورزش را متوقف کنيد . \n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "تغذيه صحيح داشته باشيد  : \n" +
                                "•\tاز مواد غذايي حاوي ميوه ها و سبزيجات تازه برگ سبز تيره در رژيم غذايي خود استفاده کنيد . از جوانه ها بخصوص جوانه يونجه . \n" +
                                "•\tانواع ماهي حاوي اسيد هاي چرب امـگا 3 ( انواع ماهي ، روغن سويا ، جوانه گندم و گردو ، 3 عدد گردو روزانه مصرف کنيد، تخم کتان ، 8 ليوان آب در روز بنوشيد  و امگا 6 ( انواع ماهي ، روغن سويا و آفتابگردان)را در برنامه غذايي خود قرار دهيد. \n" +
                                "•\tآب ، مانند آب ميوه تازه را به ميزان کافي مصرف کنيد. \n" +
                                "•\tمصرف مواد غذايي حاوي مواد نگهدارنده مثل کنسروها ، مواد غذايي حساسيت زا مثل تخم مرغ ، گوجه فرنگي و بادمجان را کاهش دهيد . الکل ، کولا و چاي مصرف نکنيد . \n" +
                                "•\tاز مصرف غذاهاي پرچربي مثل گوشتهاي چرب ، لبنيات پرچرب ، انواع سسهاي چرب و غذاهاي بسيار شيرين پرهيز کنيد . \n" +
                                "•\tغذاهاي شور و پرنمک را به خصوص در صورتي که با داروي کورتون درمان مي شويد . از رژيم غذايي حذف کنيد.\n" +
                                "•\tدر کل رژيم غذايي کم چرب و پرهيز از غذاي سنگين و غذاهاي داغ در کاهش عوارض ناشي از ام اس موثر مي باشد .\n" +
                                "توجه داشته باشيد که : \n" +
                                "•\tام اس باعث اختلال در باروري و حاملگي نمي شود ، در صورت حاملگي حتماً به پزشک اطلاع دهيد و درمان خود را تحت نظر پزشک ادامه دهيد . \n" +
                                "•\tاز محيط هاي پر استرس و اضطراب آور دوري کنيد . \n" +
                                "•\tالکل و سيگار را ترک کنيد ، اين عادت خطر ناک موجب پيشرفت بيمار ام اس مي شود . \n" +
                                "•\tهر وقت احساس خستگي کرديد ، استراحت کنيد . \n" +
                                "•\tگاهي لازم است از وسايل کمکي مثل عصا ، واکر ، ويلچر براي حفظ تعادل و وسايل توانبخشي براي کمک به حس بينايي و شنوايي خود استفاده کنيد . \n" +
                                "•\tبراي جلوگيري از احساس گرماي زياد ، از لباسهاي خنک و رنگهاي روشن استفاده کنيد و در معرض نور شديد خورشيد قرار نگيريد . \n" +
                                "تا حدالامکان از فشارهاي عصبي و اضطراب و استرس و خستگي شديدو گرسنگي مفرط و قرار گرفتن در معرض گرماي شديد و دوش آب گرم و سونا پرهيز کنيد .\n");
                        transaction.replace(R.id.frame_layout, fragment);
                        transaction.addToBackStack(null);
                        transaction.commit();
                        break;

                    case 1:
                        FragmentTransaction transaction1 = getFragmentManager().beginTransaction();
                        InfoIllness fragment1 = new InfoIllness();
                        fragment1.SetTitle("تشنج");
                        fragment1.SetBody("تشنج\u200C (كه\u200C حمله\u200C تشنجي\u200C يا حمله\u200C غش\u200C هم\u200C نام\u200C دارد) شامل\u200C انقباضات\u200C غيرارادي\u200C تعداد زيادي\u200C از عضلات\u200C بدن\u200C است\u200C. اين\u200C وضعيت\u200C  ناشی از تغییر ناگهانی و موقتی در عملکرد مغز است که بعلت تخلیه الکتریکی گروهی از سلولهای عصبی مغز ایجاد میشود. تخلیه الکتریکی همزمان، حمله ای و گذرای سلولهای عصبی،تغییراتی را در فعالیت ذهنی و رفتار فرد ایجاد می کند که از دوره زمانی بدون توجه تا بدون واکنش به تحریکات و انقباض پرشی عضلات متغیر است. تشنج یک بیماری نیست بلکه نشانه ای از نقایص زمینه ای، آسیب یا بیماری است.");
                        transaction1.replace(R.id.frame_layout, fragment1);
                        transaction1.addToBackStack(null);
                        transaction1.commit();
                        break;

                    case 2:
                        FragmentTransaction transaction2 = getFragmentManager().beginTransaction();
                        InfoIllness fragment2 = new InfoIllness();
                        fragment2.SetTitle("سکته مغزي ");
                        fragment2.SetBody("هدف کلی:\n" +
                                "آگاهی و شناخت بیماری و چگونگی مراقبت از این افراد و آموزش مراقبت از خود\n" +
                                "اهداف رفتاری\n" +
                                "شناختی :  \n" +
                                "•\tشناخت ماهیت بیماری، علایم و روش های تشخیصی و درمان\n" +
                                "روانی –حرکتی : \n" +
                                "•\tاجرای صحیح مراقبت های پرستاری در رابطه با بیماری\n" +
                                "•\tآموزش صحیح به بیماران جهت خودمراقبتی در منزل و پیگیری مجدد\n" +
                                "عاطفی : \n" +
                                "•\tدرک اهمیت اصول صحیح مراقبت های پرستاری\n" +
                                "•\tدرک اهمیت آموزش صحیح به بیمار \n" +
                                "\n" +
                                "سکته مغزي \n" +
                                "سکته مغزي يک آسيب ناگهاني به سيستم عصبي است\n" +
                                " که طي آن ، جريان خوني که تامين کننده مواد غذايي\n" +
                                " و اکسيژن قسمتي از مغز مي باشد قطع مي شود . در نتيجه\n" +
                                " عملکرد عصبي ناحيه آسيب ديده دچار اشکال مي شود .\n" +
                                " شدت اختلال عملکرد ، براساس ناحيه ي درگير و وسعت ان متفاوت مي باشد که اين وضعيت را اصطلاحاً سکته مغزي مي گويند . \n" +
                                "انواع سکته مغزي \n" +
                                "\uF0D8\tسکته هاي غير خونريزي دهنده ( ايسکميک):\n" +
                                "87 % موارد سکته را تشکيل مي دهند . \n" +
                                " \tدر سکته هاي ايسکميک ، کاهش جريان خون به مغز مي تواند \n" +
                                "به چند علت زير باشد : \n" +
                                "1- تنگي عروق به دليل جمع شدن مواد چربي در ديواره سرخرگ\n" +
                                "2- ايجاد لخته در يکي از عروق مغز \n" +
                                "3- ايجاد لخته در مناطق دوردست مانند قلب و حرکت لخته به سمت عروق مغز و بستن جريان خون عروق مغز ( آمبولي)\n" +
                                " \tعوامل خطر سکته هاي ايسکميک :\n" +
                                "* فشارخون بالا       * بيماريهاي قلبي عروقي      * کلسترول بالا          * چاقي            * ديابت      *تنگي عروق گردني (کاروتيد)            * قرص هاي ضد بارداري خوراکي       * مصرف دخانيات و الکل \n" +
                                "\uF0D8\tسکته هاي خونريزي دهنده ( هموراژيک)\n" +
                                "اگر عروق مغز پاره شوند و خون به داخل مغز نشت پيدا کند سکته هموراژيک اتفاق مي افتد . \n" +
                                " \tسکته خونريزي دهنده 13% موارد سکته را به خود اختصاص مي دهد . \n" +
                                " \tاين نوع سکته ، بيشتر در افراد جوان اتفاق مي افتد . \n" +
                                "\uF0D8\tعوامل خطر سکته هاي خونريزي دهنده : \n" +
                                "* فشارخون بالا     * ضربه    * مصرف داروهاي ضد لخته مانند وارفارين        * مصرف کوکائين \n" +
                                "* ضعف يا بيرون زدگي ديواره سرخرگ( آنوريسم مغزي)\n" +
                                "\uF0D8\tعلائم و نشانه سکته مغزي :\n" +
                                "در بيشتر افراد علائم سکته مغزي به سرعت در عرض چندثانيه يا چند دقيقه بعد از انسداد رگ خود را نشان مي دهند . \n" +
                                "علائم در سکته مغزي بستگي به قسمتي از مغز دارد که دچار گرفتگي شده است . اين علائم شامل : \n" +
                                "o\tضعف و سستي و کرختي صورت ، دست و پا در يک نيمه از بدن ( همي پارزي)\n" +
                                "o\tفلج صورت ، دست و پا در يک نيمه از بدن ( همي پلژي)\n" +
                                "o\tاختلال در صحبت کردن به صورتهاي مختلف و يا اختلال در درک صحبت ديگران و دادن پاسخ هاي نامربوط\n" +
                                "o\tاختلال در دفع به صورت احتباس ادرار يا مدفوع و يا بي اختياري ادراري يا مدفوع \n" +
                                "o\tاختلال در بلع يا وارد شدن غذا و مايعات به ريه و بروز سرفه و خفگي \n" +
                                "o\tاختلال و يا کاهش حس يک طرف از بدن \n" +
                                "o\tدرجاتي از کاهش سطح هوشياري تا کما ( برحسب شدت و وسعت آسيب)\n" +
                                "o\tسردردهاي شديد ناگهاني ، سرگيجه ، اختلال در حافظه \n" +
                                "o\tاختلال در ميدان بينائي \n" +
                                "o\tاختلال در تعادل و کنترل اندام ها\n" +
                                "عوارض طولاني مدت سکته مغزي : \n" +
                                "o\tتشنج ( مي تواند در ابتداي بيماري و يا چند هفته تا چند ماه بعد اتفاق بيافتد)\n" +
                                "o\tبروز سفتي در عضلات اندام ها \n" +
                                "o\tبروز کوتاهي در عضلات و مفاصلي که مدت ها دچار سفتي بوده و درمان نشده اند .\n" +
                                "o\tدردهاي موضعي يا عضلاني به ويژه در شانه و دست \n" +
                                "o\tافتادگي شانه و آسيب به اعصاب دست در اثر کشيدگي نا بجاي دست \n" +
                                "o\tعفونت ادراري\n" +
                                "o\tيبوست \n" +
                                "o\tعفونت ريه به علت تنفس سطحي بيمار و وارد شدن مقدار مختصري مواد غذايي به ريه ها\n" +
                                "o\tدر برخي موارد لخته هاي خون ايجاد شده در پا ممکن به دليل بي حرارتي است به سمت ريه حرکت کرده و موجب آمبولي ريه گردد . \n" +
                                "o\tزخم بستر \n" +
                                "o\tپوکي استخوان \n" +
                                "o\tاختلالات رواني و عاطفي به صورت افسردگي ، اضطراب ، خنده ها و گريه هاي بي اختيار\n" +
                                "o\tبروز درد يا حس هاي ناخوشايند در سمت ضعيف شده \n" +
                                "تشخيص\n" +
                                " \tعلائم باليني و شرح بيمار \n" +
                                " \tسي تي اسکن بدون ماده حاجب براي تشخيص نوع سکته \n" +
                                " \tنوار قلب \n" +
                                " \tآنژيوگرافي مغزي \n" +
                                "درمان\n" +
                                " \tبراي درمان سکته هاي غير خونريزي دهنده ، از داروهاي حل کننده ي لخته خون استفاده مي کنند . \n" +
                                " \tدر بيماراني که دچار سکته خفيف مغزي شده اند ، درمان دارويي با داروهاي ضد لخته مانند وارفارين انجام مي شود . \n" +
                                " \tدر صورتي که وارفارين منع مصرف داشته باشد ، از داروهاي مهار کننده پلاکت ها مانند آسپرين ، ديژريدامول و تيکلوپيدين استفاده مي شود ( داروهاي فوق فقط طبق دستور پزشک بايد مصرف شوند . \n" +
                                " \tدر بيماراني که تنگي عروق گردني دارند ، از طريق جراحي لخته خون را از شريان کاروتيد خارج مي کنند . \n" +
                                "در چه شرايطي سير بهبودي بهتر است ؟\n" +
                                " \tسکته هاي خفيف             * سن پايين تر \n" +
                                " \tسکته هاي آمبوليک ناشي از انتقال لخته از مناطق دور ( قلب)\n" +
                                " \tدرمان سريع تر به ويژه در موارد استفاده از عوامل حل کننده لخته ( در صورتي که بيمار در کمتر از 3 ساعت به بيمارستان منتقل شود )\n" +
                                " \tبيماراني که شرايط جسماني سالم تري پيش از بروز بيماري داشته اند . \n" +
                                " \tسکته هاي نوع آمبوليک معمولاً ميزان بهبود بيشتر و سريعتري نسبت به نوع اختلال خون رساني دارند . \n" +
                                "در صورت بروز چه علائمي به پزشک مراجعه شود ؟\n" +
                                "\uF076\tبروز ناگهاني ضعيف يا فلج يک طرفه \n" +
                                "\uF076\t اختلال در صحبت کردن به صورت ناگهاني \n" +
                                "\uF076\tاحساس بي حسي يا حس ناخوشايند مانند گزگز يا خواب رفتگي يک طرف بدن و صورت \n" +
                                "\uF076\tسردرد بسيار شديد بدون سابقه قبلي \n" +
                                "\uF076\tاختلال ناگهاني راه رفتن \n" +
                                "کمک هاي اوليه هنگام سکته مغزي\n" +
                                " \tدر صورتي که لقمه ي غذا يا ترشحي داخل دهان بيمار مي باشد ، آن را خارج نماييد . \n" +
                                " \tدر صورتي که بيمار دندان مصنوعي دارد ، آن را خارج نماييد .\n" +
                                " \tاگر بيمار نفس مي کشد او را در وضعيت به پهلو قرار دهيد و بلافاصله بدون اينکه بيمار را حرکت دهيد با اورژانس 115 تماس بگيريد و آمبولانس درخواست کنيد .\n" +
                                " \tتا زمان رسيدن نيروهاي امدادي ، در صورت امکان علائم حياتي بيمار ( تنفس ، نبض ، فشارخون) را کنترل کنيد . \n" +
                                " \tچيزي براي خوردن و نوشيدن به بيمار ندهيد . \n" +
                                " \tاگر بيمار هوشيار است به او کمک کنيد تا دراز بکشد به طوري که سر و شانه هايش مختصري بالاتر از تنه ، روي چيزي تکيه کند . \n" +
                                " \tسر او را به سمت مبتلا خم کنيد و يک حوله روي شانه او قرار دهيد تا هر گونه ترشحي را جذب کند . \n" +
                                " \tهر لباسي را که ممکن است تنفس بيمار را مختل کند ، شل کنيد . \n" +
                                " \tبه بيمار اطمينان خاطر دهيد که در کنار او هستيد و مراقب او مي باشيد تا نيروهاي امدادي براي انتقال بيمار به بيمارستان با آمبولانس آماده شوند .\n" +
                                "پيشگيري از سکته مغزي\n" +
                                "\uF0A7\tورزش منظم \n" +
                                "\uF0A7\tاستفاده از رژيم غذايي کم چربي و مصرف \n" +
                                "ميوه ها و سبزي ها در رژيم غذايي روزانه \n" +
                                "\uF0A7\tعدم استعمال دخانيات \n" +
                                "\uF0A7\tکنترل طبي هر گونه اختلال مزمن مثل ديابت \n" +
                                "\uF0A7\tکنترل مرتب فشار خون و در صورت بالا بودن مراجعه به پزشک \n" +
                                "\uF0A7\tدر بيماران داراي سابقه سکته قلبي و بيماران مبتلا به فشارخون و ديابت مصرف روزانه آسپرين زير نظرپزشک \n");
                        transaction2.replace(R.id.frame_layout, fragment2);
                        transaction2.addToBackStack(null);
                        transaction2.commit();
                        break;

                    case 3:
                        FragmentTransaction transaction3 = getFragmentManager().beginTransaction();
                        InfoIllness fragment3 = new InfoIllness();
                        fragment3.SetTitle("گیلن باره");
                        fragment3.SetBody("هدف کلی:\n" +
                                "آگاهی و شناخت بیماری و چگونگی مراقبت از این افراد و آموزش مراقبت از خود\n" +
                                "اهداف رفتاری\n" +
                                "شناختی :  \n" +
                                "•\tشناخت ماهیت بیماری، علایم و روش های تشخیصی و درمان\n" +
                                "روانی –حرکتی : \n" +
                                "•\tاجرای صحیح مراقبت های پرستاری در رابطه با بیماری\n" +
                                "•\tآموزش صحیح به بیماران جهت خودمراقبتی در منزل و پیگیری مجدد\n" +
                                "عاطفی : \n" +
                                "•\tدرک اهمیت اصول صحیح مراقبت های پرستاری\n" +
                                "•\tدرک اهمیت آموزش صحیح به بیمار \n" +
                                "\n" +
                                "سندرم گیلن باره \n" +
                                "راه های مراقبت از بیمار مبتلا به سندرم گیلن باره \n" +
                                "سندرم گیلن باره نام یک بیماری نادر است که سیستم ایمنی بدن و اعصاب شخص را درگیر می کند. در این بیماری ، سیستم ایمنی که کارش دفاع از بدن در برابر بیماری هاست ، به اعصاب بیرونی مغز و نخاع حمله می کند و به آنها آسیب می زند.\n" +
                                " هنوز علت قطعی سندرم گیلن باره هنوز مشخص نیست ، اما مواردی مانند واکسیناسیون ، عمل جراحی و یا بروز عفونت می توانند در آغاز این بیماری نقش داشته باشند.\n" +
                                "در این سندروم ، غلاف میلین که عصب را می پوشاند و سرعت انتقال پاسخ های عصبی را افزایش می دهد ، از بین می رود. علایم این بیماری می تواند شدید و ناتوان کننده و پیشرونده باشد.\n" +
                                "گیلن باره ممکن است در هر سنی دیده شود ، اما شایع ترین سن بروز آن بین 30 تا 50 سالگی است.\n" +
                                "دلایل ایجاد بیماری \n" +
                                "•\tبعد از انجام واکسیناسیون \n" +
                                "•\tبعد از عمل جراحی\n" +
                                "•\tعفونت باکتری\n" +
                                "•\tعفونت ویروسی ناشی از عفونت ریه ، سینوسی و یا عفونت سیستم گوارشی (اسهال)\n" +
                                "•\tبعد از بارداری\n" +
                                "تظاهرات بالینی\n" +
                                "•\tبیماری به طور حاد شروع و معمولا\" علایم طی چند روز تا 2 هفته کامل می شود و گاهی تا حدود 1 ماه با پیشرفت علایم همراه است.\n" +
                                "•\tشدت ضعف عضلانی در بیماران متفاوت است. اختلال حرکتی در این بیماری بیشتر از اختلال حسی است. منظور از اختلال حسی ، سوزن سوزن شدن ، گز گز و مورمور شدن ، سستی و لرزش عضلات  پشت ساق پا است که می تواند در یک یا دو طرف بدن رخ می دهد. مورمور شدن حتی به اندام های بالا تنه مثل شانه ، بازوها و نیز به سایر قسمت های بدن هم پیشرفت کرده و در نتیجه منجر به فلج کامل می شود.\n" +
                                "•\tدر عضلات صورت ؛ فلج چشم و در دهان و حلق ؛ اختلال در صحبت کردن و بلعیدن ایجاد می کند.\n" +
                                "•\tدرگیری اعصاب جمجمه ای که منجر به اختلال در صحبت کردن و جویدن و بلعیدن می شود.\n" +
                                "•\tاختلال در عملکرد اعصاب خودکار که با افزایش یا کاهش عملکرد دستگاه قلب و عروق همراه است. از علایم آن افزایش ضربان قلب و یا کاهش ضربان قلب و فشارخون متغییر می باشد.\n" +
                                "نکته : این بیماری روی عملکرد شناختی و سطح هوشیاری بیمار تأثیر نمی گذارد. اغلب بیماران پس از گذشت یک ماه و یا یکسال بهبودی کامل می یابند ولی حدوود پنج درصد از بیماران ناتوان باقی می مانند.\n" +
                                "راههای تشخیص بیماری\n" +
                                "•\tشرح بیمار و معاینه توسط پزشک\n" +
                                "•\tنوار عصب و عضله \n" +
                                "•\tآزمایش مایع نخاعی\n" +
                                "•\tآزمایش خون\n" +
                                "درمان \n" +
                                "•\tاقدامات حمایتی\n" +
                                "•\tایمنی درمانی (تزریق ایمونوگلوبین = ای وی آی جی)\n" +
                                "•\tماشین تنفسی (در بیمارانی که به دلیل ضعف ماهیچه های تنفسی قادر به نفس کشیدن خود به خودی نیستند بیمار به این دستگاه وصل می شود.)\n" +
                                "•\tتعویض پلاسمای خون (پلاسمای خون حدود 50% حجم خون را تشکیل می دهد که شامل 90% آب و 10% املاح ، قند ، چربی و پروتئین های انعقادی ، آنتی بادی و عناصر سلولی است. دستگاه پلاسمافرز خون بیمار را گرفته و پس از جدا کردن پلاسما که دارای آنتی بادی های آسیب دیده است ، بقیه اجزای خون به بیمار تزریق می شود و به جای آن پلاسمای سالم یا آلبومین تزریق می شود.)\n" +
                                "کاربرد پلاسما فریزیس در گیلن باره \n" +
                                "درمان اصلی، تعویض پلاسما می باشد خصوصا\" در مواقعی که بیماری پیش رونده شده و کاهش ظرفیت تنفسی به وجود آمده است. البته زمانی که کمتر از دو هفته از شروع بیماری گذشته باشد به درمان تعویض پلاسما پاسخ بهتری می دهد و در صورتیکه از شروع بیماری سه هفته یا بیشتر گذشته باشد پلاسما فرزیس ارزش زیادی ندارد.\n" +
                                "روش درمان \n" +
                                "•\tروش اول : در شروع پلاسما فریز روزانه حداقل 4 روز 5 سی سی به ازای هر کیلوگرم وزن بدن و ادامه آن 4 جلسه دیگر با فاصله 3 روز در میان ، در صورتیکه پس از هشت جلسه پلاسما فریز برای بیمار بهبودی حاصل نشد، پلاسما فرز مفید نیست ولی در مواردی که حال بیمار پس از قطع پلاسما فریز بدتر شد مجددا باید به فاصله یک هفته شروع شود.\n" +
                                "•\tروش دوم : 200 تا 250 سی سی برای هر کیلوگرم وزن بیمار طی 6 – 4 جلسه با فاصله یک روز در میان پلاسما تعویض می شود.\n" +
                                "مراقبت از بیمار در منزل \n" +
                                "•\tفیزیوتراپی اندام های مبتلا و تشویق بیمار به حرکت اندام ها جهت انعطاف پذیری عضلات و اندام ها\n" +
                                "•\tرساندن مایعات کافی به بیمار \n" +
                                "•\tتغییر وضعیت بدن بیمار\n" +
                                "•\tبرای جلوگیری از ایجاد لخته خون در پاها جوراب الاستیک بلند (که از انگشتان پا تا بالای ران کشیده می شود)، هر 2 ساعت بسته می شود و سپس نیم ساعت خارج می شود. در این مدت که باند خارج شده ، بایستی پاها را از نظر سردی ، گرمی ، زخم و رنگ بررسی کرد.\n" +
                                "•\tاستفاده از داروهای ضد انعقاد براساس دستور پزشک\n" +
                                "•\tپرهیز از مصرف الکل و کشیدن سیگار\n" +
                                "جلوگیری از احتباس ادراری \n" +
                                "•\tحداقل روزانه حدود ده لیوان اب به بیمار داده شود.\n" +
                                "•\tریختن آب گرم روی مثانه و ماساژ شکم\n" +
                                "•\tشنیدن صدای آب کمک به دفع ادرار می کند.\n" +
                                "•\tدر صورت ادامه تجمع ادرار در مثانه، سوندگذاری برای بیمار\n" +
                                "جلوگیری از یبوست\n" +
                                "•\tخوردن غذاهای فیبردار مثل میوه ها و سبزیجات \n" +
                                "•\tهر زمان که احساس دفع دارد ، دستشویی برود.\n" +
                                "•\tاز لگن و صندلی مخصوص دفع استفاده کند (توالت فرنگی)\n" +
                                "•\tبیمار را هنگام دفع در وضعیت نشسته قرار دهید.\n" +
                                "•\tداشتن احساس آرامش حین دفع\n" +
                                "زخم فشاری\n" +
                                "•\tجایه جایی بیمار از پهلوی راست به چپ و بالعکس هر 2 ساعت یکبار انجام شود.\n" +
                                "•\tزیر ران ها ، باسن ها ، پاشنه ها ، آرنج ها و در قوس کمر، بالشتک باید گذاشته شود.\n" +
                                "•\tقرار ندادن پاشنه ی پا روی زمین \n" +
                                "رژیم پر پروتئین و پرکالری \n" +
                                "غذای پر پروتئین و پر کالری شامل تخم مرغ آب پز ، ماست و گردو ، پوره سیب زمینی + مرغ و ماهی ، برنج + کنجد ، موز و عسل + شیر ، کره + بادام زمینی+ کنجد ، پودر مغزها + نان و پنیر یا کره و مربا می باشد.\n" +
                                "•\tنوشیدن مایعات با نی \n" +
                                "•\tبیمارانی که در بلعیدن مشکل دارند (لوله ای از طریق بینی وارد معده شده و از طریق آن غذاهای پوره شده مثل پوره سیب زمینی ، سوپ ، فرنی و با حجم کم و دفعات زیاد به بیمار داده می شود.)\n" +
                                "•\tتشویق بیمار به تمرکز و دقت روی عمل بلعیدن\n" +
                                "•\tهنگام غذا خوردن بیمار را در وضعیت نشسته قرار دهید به طوری که سر صاف و چانه به سمت جلو خم شود.\n" +
                                "•\tپرهیز از مصرف نوشابه های گازدار ، حبوبات و غذاهای نفاخ \n" +
                                "•\tپرهیز از جویدن آدامس\n" +
                                "جلوگیری از اختلال در راه هوایی \n" +
                                "•\tاز تنفس دود سیگار ، عطر و گرده گلها اجتناب کند.\n" +
                                "•\tبا لبهای فشرده تا 3 شماره از بینی تنفس بکشد.\n" +
                                "•\t آهسته و در مقابل لبهای غنچه شده با انقباض عضلات شکم بازدم را انجام دهید.\n" +
                                "•\tدر حین بازدم از طریق لبهای فشرده تا عدد 7 بشمارید (وضعیتی شبیه به خاموش کردن یک شمع روشن)\n" +
                                "•\tدر حالت نشسته روی صندلی دست ها را روی شکم به هم محکم کنید و تا شماره 3 از طریق بینی نفس بکشید.\n" +
                                "•\tبه جلو خم شده و به آرامی تا شماره 7 از طریق لبهای فشرده بازدم کنید.\n" +
                                "•\tهنگام راه رفتن دم را با 2 قدم انجام دهید. بازدم را از میان لبهای فشرده با 4 تا 5 قدم انجام دهید.\n");
                        transaction3.replace(R.id.frame_layout, fragment3);
                        transaction3.addToBackStack(null);
                        transaction3.commit();
                        break;

                    case 4:
                        FragmentTransaction transaction4 = getFragmentManager().beginTransaction();
                        InfoIllness fragment4 = new InfoIllness();
                        fragment4.SetTitle("میاستنی گراو");
                        fragment4.SetBody("هدف کلی:\n" +
                                "آگاهی و شناخت بیماری و چگونگی مراقبت از این افراد و آموزش مراقبت از خود\n" +
                                "اهداف رفتاری\n" +
                                "شناختی :  \n" +
                                "•\tشناخت ماهیت بیماری، علایم و روش های تشخیصی و درمان\n" +
                                "روانی –حرکتی : \n" +
                                "•\tاجرای صحیح مراقبت های پرستاری در رابطه با بیماری\n" +
                                "•\tآموزش صحیح به بیماران جهت خودمراقبتی در منزل و پیگیری مجدد\n" +
                                "عاطفی : \n" +
                                "•\tدرک اهمیت اصول صحیح مراقبت های پرستاری\n" +
                                "•\tدرک اهمیت آموزش صحیح به بیمار \n" +
                                "\n" +
                                "میاستنی گراو :\n" +
                                "یک بیماری خود ایمنی است که در آن آنتی بادی علیه گیرنده استیل کولین عمل می کند و باعث کاهش تعداد رسپتورهای استیل کولین اعصاب در محل اتصال عصبی عضلانی شده و انتقال عصبی – عضلانی در عضلات ارادی را مختل می کند در زنان (25 – 18 ساله) شایع تر است و مردان بالای 50 سال را نیز مبتلا می کند. شامل دوره های تشدید و تخفیف می باشد. دوره تشدید می تواند در نتیجه عفونت ، استرس ، قاعدگی ، هورمونها ، در معرض قرار گرفتن طولانی در نور خورشید و هوای سرد ایجاد شود.\n" +
                                "تظاهرات بالینی :\n" +
                                "ضعف مفرط و پیشرونده عضلانی و خستگی پذیری آسان که با فعالیت تشدید شده و با استراحت رفع می شود.ضعف عضلانی در عضلات دست ها و بازوها ، نسبت به پاها بیشتر است و در انتهای روز به حداکثر می رسد. ضعف عضلانی دیافراگم و عضلات بین دنده ای ممکن است باعث دیسترس تنفسی شود. رفلکس تاندونی و حسی طبیعی است.\n" +
                                "علائم درگیری اعصاب جمجمه ای شامل : دوبینی و افتادگی پلک ، قیافه خواب آلود و شبیه ماسک ، تمایل به باز ماندن دهان بدلیل  ضعف عضلات صورت ، دیس فونی و صداهای تو دماغی ، اشکال در تلفظ کلمات ، اختلال در جویدن و بلع\n" +
                                "عوارض احتمالی :\n" +
                                "بحران میاستنی : حمله ناگهانی ضعف عضلانی ، دیسترس حاد تنفسی ، اشکال در بلع ، تکلم ، پتوز و دوبینی که معمولا به علت ناکافی بودن یا عدم دریافت داروهای کولینرژیک و یا در اثر استرس عاطفی ، عفونت ، جراحی یا تروما ایجاد می شود.\n" +
                                "بحران کولینرژیک : در اثر مصرف بیش از حد داروهای کولینرژیک یا آنتی کولین استراز ایجاد می شود که علاوه بر بحران میاستنی یا علائم تهوع ، استفراغ ، اسهال ، تعریق و میوز و برادیکاردی و افزایش ترشح بزاق و ترشحات ریوی نیز همراه است سایر عوارض شامل : نارسایی تنفسی و پنومونی آسپراسیون \n" +
                                "تشخیص : \n" +
                                "1. آزمون تزریق ادروفونیوم (تنسیلون) ؛ که بهبود قدرت عضلات صورت و بهبود افتادگی پلک ، 30 ثانیه بعد از تزریق ، نشانه مثبت بودن تست است ، جهت کنترل عوارض جانبی این (بردیکاردی ، تعریق و کرامپ) باید آتروپین در دسترس باشد.\n" +
                                "آزمایش تجزیه سرم از نظر وجود آنتی بادی ضد گیرنده استیل کولین ، الکترومیوگرافی و بررسی هدایت عصبی سی تی اسکن و MRI قفسه سینه جهت بررسی تیموس.\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "درمان : \n" +
                                "\uF076\tداروهای آنتی کولین استراز : برومید پیرید و ستگمین و نئوستگمین که انتقال ایمپالسهای عصبی را بهبود می بخشد.\n" +
                                "\uF076\tدرمان سرکوب ایمنی : داروهای سرکوب کننده ایمنی (آزایتوپرین ، سیکلوسپورین) و کورتیکواستروئید (پردنیزولون)\n" +
                                "\uF076\tایمونو گلوبین وریدی\n" +
                                "\uF076\tپلاسما فروزیس (تعویض پلاسما)\n" +
                                "\uF076\tدرمان بحران میاستنی و کولینرژیک : حفظ راه هوایی ، ساکشن ترشحات ، اکسیژن تراپی ، در صورت لزوم انتوباسیون و تهویه مکانیکی در بخش مراقبت های ویژه لازم است. جهت افتراق انواع بحران از ادروفونیوم وریدی استفاده می شود که این دارو بحران میاستنی را بهبود می بخشد و بحران کولینرژیک را موقتا تشدید می کند.\n" +
                                "\uF076\tدر درمان بحران میاستنی از نئوستگمین استفاده می شود و جهت رفع عوارض موسکارینی بحران کولینرژیک (تهوع ، استفراغ ، اسهال ، تعریق و ...) پروپانتلین تجویز می شود.\n" +
                                "آموزش به بیمار :\n" +
                                "1.\tفعالیت : توصیه که از انجام فعالیتهای تگراری و طولانی که باعث ضعف و خستگی می شود ، خودداری نماید. فعالیت و استراحت را به طور متناوب انجام دهید و فعالیت ها را مناسب با سطح تحمل و در زمان برخوداری از انرژی زیاد یعنی یک ساعت پس از مصرف داروهایش انجام دهد.\n" +
                                "\uF076\tاز روش ها و وسایل مختلف برای حفظ انرژی استفاده کند مثلا موقع استحمام روی چهار پا یا نیمکت بنشیند یا وسایل مورد نیاز یا وسایل روزانه اش را در دسترس یا نزدیک خود قرار دهد .\n" +
                                "\uF076\tسعی کند که کمترین انرژی لازم را برای قعالیت های لذت بخش و مورد علاقه ذخیره کند .\n" +
                                "\uF076\tقبل از احساس خستگی فعالیت های خود را متوقف کند \n" +
                                "رژیم غذایی :\n" +
                                "\uF076\tقبل و بعد از صرف غذا کاملا استراحت کند.\n" +
                                "\uF076\tزمان وعده های غذایی را طوری تنظیم کند که با حداکثر دارو ها (5-1 ساعت بعد از مصرف دارو) مطابقت داشته باشد0 برای تسهیل بلع هنگام صرف غذا در وضعیت نیمه نشسته قرار گیرد در حالیکه گردن کمی به جلو متمایل شود .\n" +
                                "\uF076\tاز غذا های نرم مثل غذا های پوره ای مثل پوره سیب زمینی و غذا های ابکی که بلع انها راحت تر است استفاده کند.\n" +
                                "\uF076\tغذا های جامد را با مخلوط کن با غذاهای ابکی دیگر مخلوط نموده مصرف کند و به اهستگی غذا بخورد .\n" +
                                "\uF076\tاگر اشکال در بلع دارد از مصرف غذاها و نوشیدنی هایی که تولید بزاق را تحریک می کند مثل شیر خودداری کند. \n" +
                                "\uF076\tاجتناب از مصرف الکل  زیرا احساس ضعف را افزایش میدهد .\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\uF076\tخوردن غذا های گرم (نه داغ) می تواند به بلع اسان کمک کند و اگر بیمار قادر به خوردن غذا های های نیست رژیم پر کالری استفاده شود.\n" +
                                "\uF076\tتوصیه که به علت احتمال اسپیراسیون در هنگام غذا خوردن دستگاه ساکشن اماده باشد.\n" +
                                "دارو درمانی:\n" +
                                "\uF076\tدارو های انتی کولین استراز: تاکید بر اهمیت مصرف دارو ها طبق دستور پزشک و اینکه هیچ یک از دوز های دارویی نباید حذف شود.\n" +
                                "\uF076\tدر مواردی مانند استرس جسمی و عاطفی قاعدگی عفونت و جراحی ممکن است نیاز به افزایش دوز دارو وجود داشته باشد و باید در این موارد با پزشک مشورت شود. برای کاهش عوارض گوارشی این دارو ها بهتر است دارو با غذا و یا شیر مصرف شود.\n" +
                                "\uF076\tدر صورت تجویز دارو های سرکوب کننده سیستم ایمنی بدلیل مستعد عفونت بودن از رفتن به جاهای شلوغ و تماس با افراد مبتلا  به عفونت اجتناب نماید.\n" +
                                "\uF076\tدر صورت تجویز داروهای کورتیکو استروءید  دارو را همراه با غذا  یا شیر مصرف کند افزایش وزن ناگهانی را گزارش کند. رژیم غذایی کم نمک پر پروتئین و پر پتاسیم توصیه می شود .\n" +
                                "\uF076\tتوصیه به بیمار که از مصرف داروهای بدون نسخه خودداری کند زیرا برخی دارو ها مانند : انتی بیوتیک ها داروهای قلبی-عروقی ضد تشنج هاو... می تواندمنجر به تشدید میاستنی گراو شود \n" +
                                " سایر آموزش ها: \n" +
                                "1. در صورت افتادگی پلک با استفاده از نوار چسب به فواصل کوتاه چشم هارا باز نگه دارد .و در صورت کاهش اپر نور درخشان بر چشم از عینک افتابی استفاده نماید .\n" +
                                "2. در صورت دو بینی به طور متناوب 4-2 ساعت یک چشم را با پوشش محافظ ببندد \n" +
                                "3. از فعالیت ها با شرایطی که باعث تشدید علایم و افزایش ضعف عضلات می شود:استرس جسمی و روحی اشفتگی عاطفی فعالیت شدید بدنی  هوای گرم یا سرد حمام داغ صدمه و عفونت ها اجتناب نماید .\n" +
                                "4. اموزش نحوه تنفس عمیق و سرفه موثر جهت خروج ترشحات تنفسی به بیمار انجام شود .\n" +
                                "5. توصیه به خانواده ای که ساکشن در دسترس باشد و تکنیک صحیح ساکشن اموزش داده شود .\n" +
                                "6. از آنجایی که مستعد به عفونت های تنفسی هستند : در صورت بروز علائم عفونت مانند تب سرفه تغییر رنگ خلط و تنگی نفس به پزشک اطلاع دهند.اگر بیمار دچار اسم است توجه خاصی به علائم تنفسی داشته باشد .\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "7.توصیه که در صورت بروز علائم بحران میاستنی یا کلینرژیک مانند : مشکل تنفسی اختلال بینایی اشکال بلع و تکلم افزایش بزاق استفراغ اسهال کرامپ شکمی سفتی عضلاتی تپش قلب بیقراری کاهش هوشیاری  و غش به پزشک مراجعه نمایند.\n");
                        transaction4.replace(R.id.frame_layout, fragment4);
                        transaction4.addToBackStack(null);
                        transaction4.commit();
                        break;

                }
            }
        });

        showBackButton();

        return v;
    }

    public void showBackButton() {
        if (getActivity() instanceof MainActivity) {
            ((MainActivity) getActivity()).getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        }
    }

}
