package com.example.nazanin.hospitalapp.Illness;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentTransaction;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

import com.example.nazanin.hospitalapp.MainActivity;
import com.example.nazanin.hospitalapp.R;


public class IllnessGhalb extends Fragment {


    private ListView listGhalb;
    private String[] list={"آمبولی ریه","آنژین صدری","سکته قلبی","فشارخون", "نارسایی قلبی"};


    public static IllnessEye newInstance() {
        IllnessEye fragment = new IllnessEye();

        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_illness_ghalb, container, false);
        listGhalb = v.findViewById(R.id.listGhalb);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(getContext(),R.layout.list_textview,list);
        listGhalb.setAdapter(adapter);
        listGhalb.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                switch (position){

                    case 0:
                        FragmentTransaction transaction = getFragmentManager().beginTransaction();
                        InfoIllness fragment = new InfoIllness();
                        fragment.SetTitle("آمبولي ريه");
                        fragment.SetBody("آمبولي ريه عبارتست از انسداد شريان ريه توسط توده اي از لخته خون ، چربي و هوا که در خون حرکت کرده و در نقطه اي از شريان ريه متوقف مي شود . \n" +
                                "در اثر اين عارضه خون کافي به شش ها نمي رسد و در نتيجه اکسيژن دريافت و دي اکسيد کربن خارج نمي شود . ( تبادل گازي انجام نمي شود) خون داخل سياهرگ هاي عمقي گاها در شرايط بي حرکتي طولاني مدت تجمع و کندي حرکت خون مستعد تشکيل لخته مي شود .\n" +
                                "عوامل کمک کننده به ايجاد آمبولي :\n" +
                                "\uF0D8\tمسافرت طولاني مدت با وسايل نقليه\n" +
                                "\uF0D8\tبعد از اعمال جراحي و يا شکستگي اندام تحتاني \n" +
                                "\uF0D8\tحاملگي و نارسايي قلبي\n" +
                                "\uF0D8\tسن بالاي 50 سال \n" +
                                "\uF0D8\tبي حرکتي طولاني مدت و بستري در بيمارستان \n" +
                                "\uF0D8\tعوامل ژنتيک( سابقه قبلي آمبولي ريوي در فرد يا بستگان)\n" +
                                "\uF0D8\tچاقي و ازدياد چربي هاي خون \n" +
                                "\uF0D8\tمصرف قرص هاي ضد بارداري و سيگار \n" +
                                "شايع ترين علامت آمبولي :\n" +
                                "\uF076\tتنگي نفس ناگهاني \n" +
                                "\uF076\tگاها درد ناگهاني و خنجري قفسه سينه و يا غش همراه با افت فشار خون\n" +
                                "\uF076\tسرفه و افزايش ضربان قلب\n" +
                                "\uF076\tتعريق شديد \n" +
                                "\uF076\tدفع خلط خوني\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "آمبولي ريه هنگامي رخ مي دهد که لخته از وريدهاي اندام تحتاني (ساق پا) به رگهاي ريه وارد مي شود . تشکيل لخته خون در وريدهاي اندام تحتاني با درد و تورم و گرمي اندام همراه است که معمولا عضلات پا سفت شده و با التهاب پوست همراه است . \n" +
                                "در اين صورت شما : \n" +
                                "\uF0A7\tنبايد بايستيد\n" +
                                "\uF0A7\tاندام درگير را بي حرکت کنيد .\n" +
                                "\uF0A7\tفوري به بيمارستان مراجعه کنيد \n" +
                                "راه هاي پيشگيري : \n" +
                                "\uF0FC\tاز استراحت طولاني مدت در بستر در طي بيماري خودداري کنيد .\n" +
                                "\uF0FC\tدر طي دوره نقاهت از جوراب کشي استفاده کنيد.\n" +
                                "\uF0FC\tبعد از جراحي هر چه سريعتر اندام تحتاني را حرکت داده و شروع به راه رفتن کنيد . ابتدا پاها را در تخت تکان دهيد . پاها را لبه تخت آويزان کنيد . اگر سرگيجه داشتيد سريعا به جاي خود برگرديد .\n" +
                                "در صورتيکه سرگيجه نداشتيد لبه تخت پاها را حرکت دهيد و روي پاها بايستيد . باز هم مواظب باشيد اگر سرگيجه نداشتيد مي توانيد اندازه طول تخت راه برويد و کم کم مسافت راه پيماني را افزايش دهيد .  ( بهتر است پرستار شما را همراهي کند) در صورت سرگيجه تغييرات فشار خون بهتر است راه رفتن را به وقت ديگري موکول نمائيد . \n" +
                                "\uF0FC\tخودداري از استعمال دخانيات به خصوص در خانمهاي 35 سال به بالا که  قرص ضد بارداري مصرف ميکنند.\n" +
                                "\uF0FC\tدر طي سفر هر 1-2 ساعت مدتي ايستاده و راه برويد . \n" +
                                "\uF0FC\tجلوگيري از افزايش وزن \n" +
                                "\uF0FC\tاز نشستن به حالتي که ساقها يا مچ پاها را روي يکديگر بيندازيد خودداري کنيد . \n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\uF0FC\tدر هنگام خوابيدن پاها را بالاتر از سطح بستر قرار دهيد .بهتر است زير پاها  يک  بالشت  نازک  گذاشته شود. \n" +
                                "درمان : \n" +
                                " \tاستفاده از داروهاي ضد انعقاد در جهت جلوگيري از ايجاد دوباره بيماري توصيه        مي گردد.( داروها مرتب با آزمايش خون کنترل مي شود به همين جهت هميشه با پزشک خود درتماس باشيد .)\n" +
                                " \tتجويز اکسيژن \n" +
                                " \tانجام تمرينات ورزشي با هماهنگي واحد فيزيوتراپي \n" +
                                " \tمعمولا با مراقبت هاي پزشکي و پرستاري در بخش ، عرض 10 الي 14 روز بهبود        مي يابيد. \n");
                        transaction.replace(R.id.frame_layout, fragment);
                        transaction.addToBackStack(null);
                        transaction.commit();
                        break;

                    case 1:
                        FragmentTransaction transaction1 = getFragmentManager().beginTransaction();
                        InfoIllness fragment1 = new InfoIllness();
                        fragment1.SetTitle("آنژین صدری چیست؟");
                        fragment1.SetBody("احساس درد و ناراحتی در قفسه سینه می باشد و زمانی رخ می دهد که قلب اکسیژن مورد نیاز خود را دریافت نمی کند. عضله قلب مانند سایر نقاط بدن برای سالم ماندن و فعالیت بهتر و دریافت غذا نیاز به خون رسانی و اکسیژن دارد که این عمل توسط رگهای موجود در قلب به نام شریانهای کرونری انجام می شود به هر علتی که شریانهای قلبی (کرونری) خون کافی دریافت نکنند خون رسانی به عضله قلب کم شده غذا و اکسیژن کافی به آن نمی رسد و فرد دچار درد قلبی می شود که به این درد آنژین صدری می گویند.\n" +
                                "علت آنژین صدری چیست؟\n" +
                                "•\tتنگ شدن شریانهای قلبی (کرونری) در اثر رسوب چربی و سایر مواد در دیواره آنها (تصلب شرایین)\n" +
                                "•\tنامنظم بودن ضربان قلب و آریتمی های قلبی\n" +
                                "•\tکم خونی\n" +
                                "•\tبیماری شریانهای کرونر، فشردگی (تنگ شدن= انقباض) و یا اسپاسم شریانهای کرونر که به نوبه خود باعث کاهش خونرسانی به قلب می شود.\n" +
                                "عوامل افزایش دهنده خطر ابتلا به آنژین صدری چیست؟\n" +
                                "•\tفشارخون بالا\n" +
                                "•\tچربی خون بالا (کلسترول بالا)\n" +
                                "•\tمرض قند (دیابت)\n" +
                                "•\tنداشتن تحرک و ورزش منظم\n" +
                                "•\tمصرف سیگار\n" +
                                "•\tچاقی\n" +
                                "•\tخوردن زیاده از حد نمک وچربی\n" +
                                "•\tمردان بالای 60 سال\n" +
                                "•\tیائسگی در زنان\n" +
                                "•\tوعده های سنگین غذا (انحراف خون به سمت معده و نرسیدن خون کافی به قلب)\n" +
                                "•\tقرار گرفتن در معرض سرما (تنگ شدن عروق کرونر شده)\n" +
                                "•\tاسترس ، اضطراب و عصبانیت و هر گونه فعالیت هیجانی\n" +
                                "•\tسابقه خانوادگی بیماری قلبی\n" +
                                "•\tانجام فعالیت و ورزش سنگین\n" +
                                "علائم و نشانه ای آنژین صدری چیست؟\n" +
                                "•\tدرد در قفسه سینه به صورت له کننده، فشار دهنده است از نظر اغلب افراد شدت آن به حدی است که قبلاً مانند آن را تجربه نکرده اند.\n" +
                                "•\tغالباً درد فقط محدود به منطقه قلب نیست و به گردن، فک و شانه ها، بازوها، مچ دست، انگشتان چهارم و پنجم دست (بخصوص دست چپ) تیر می کشد ولی با استراحت و یا با مصرف قرص زیر زبانی بهبود می یابد.\n" +
                                "•\tمدت زمان درد نهایتاً سه تا پنج دقیقه می باشد.\n" +
                                "•\tعلاوه بر درد ممکن است علائمی مانند سختی در نفس کشیدن، کوتاه شدن نفس، رنگ پریدگی، عرق سرد، گیجی، طپش قلب، تهوع و استفراغ؛ اضطراب، سوء هاضمه، احساس خفگی شدید نیز وجود داشته باشد.\n" +
                                "در افراد دیابتی: ممکن است به دلیل درگیری گیرنده های عصبی احساس درد کاهش یابد.\n" +
                                "\n" +
                                "در افراد سالمند آنژین صدری با علامت تنگی نفس وجود دارد.\n" +
                                "گاهي حمله های آنژین صدری در سالمندان بدون درد و همراه با ضعف و بی حالی بروز می کند.\n" +
                                "آنژین صدری چگونه تشخیص داده می شود؟\n" +
                                "با توجه و علائم و نشانه های مشاهده شده و انجام آزمایشات خون و نوار قلب و تست ورزش و انجام آنژیوگرافی قلبی تشخیص داده می شود.\n" +
                                "راههای پیشگیری از آنژین صدری چیست ؟\n" +
                                "•\tسیگار نکشید و از افراد سیگاری دوری کنید.\n" +
                                "•\tدر صورت بالا بودن فشار خون آن را درمان کنید.\n" +
                                "•\tاز رژیم کم نمک و کم چرب استفاده کنید.\n" +
                                "•\tدست کم 30 دقیقه در بیشتر یا تمامی روزهای هفته ورزش کنید.\n" +
                                "•\tوزن خود را در سطح سالمی حفظ نمایید.\n" +
                                "•\tپزشک خود را به شکل منظم ملاقات نمایید.\n" +
                                "•\tداروهای خود را درست مطابق دستور پزشک مصرف نمایید.\n" +
                                "•\tاگر مبتلا به مرض قند (دیابت) هستید قند خون را کنترل کنید.\n" +
                                "•\tاز عوامل فیزیکی و عاطفی استرس زا دوری کنید.\n" +
                                "•\tعلائم هشدار دهنده حمله قلبی را بیاموزیم.\n" +
                                "عوارضی که در صورت عدم توجه به دردهای قلبی برایم پیش می آید چیست؟\n" +
                                "-\tسکته قلبی (انفارکتوس میوکارد)\n" +
                                "-\tنامنظمی ضربان قلب (آریتمی)\n" +
                                "-\tاختلال کار قلب (نارسایی قلب)\n" +
                                "-\tمرگ ناگهانی\n" +
                                "مراقبت در مددجوی مبتلا به آنژین صدری\n" +
                                "1- حتماً بین فعالیت و استراحت خود تعادل برقرار کنید.\n" +
                                "•\tفعالیت روزانه تان منظم و تا حدی باشد که موجب ایجاد درد در قفسه سینه، تنگی نفس و خستگی شما نشود.\n" +
                                "•\tاز ورزشهای سنگین و ناگهانی بپرهیزید.\n" +
                                "•\tتا حد امکان فعالیت هایتان را سبک کنید مثلا به جای پله از آسانسور استفاده نمایید.\n" +
                                "•\tما بین فعالیت های خود دوره های استراحت بگنجانید.\n" +
                                "•\tاز ورزش کردن بعد از وعده غذا، در هنگام آشفتگی و اضطراب و روزهای مه آلود بسیار گرم و به خصوص در هوای سرد خودداری کنید.\n" +
                                "•\tقبل از شروع کار یا صرف غذا ورزش های سبک انجام دهید.\n" +
                                "حتماً در زمستان نکات ذیل را رعایت نمایید.\n" +
                                "•\tبا شال گردن روی دهان و بینی تان را بپوشانید.\n" +
                                "•\tاز لباس گرم استفاده کنید.\n" +
                                "•\tدر مقابل باد حرکت نکنید\n" +
                                "•\tدر هوای سرد آهسته حرکت کنید و زودتر خود را به منزل برسانید.\n" +
                                "2- هرگز سیگار نکشید و درمعرض دود سیگار قرار نداشته باشید.\n" +
                                "3- در مورد مصرف داروها به نکات زیر توجه کنید:\n" +
                                "•\tبه یاد داشته باشید که دارو شما مخصوص خود شماست و هرگز به دوستان و آشنایانی که بیماری مشابه دارند توصیه نکنید.\n" +
                                "•\tاز مصرف خودسرانه داروهایی نظیر (داروی لاغری- قطره های ضداحتقان بینی و غیره) بپرهیزید چون می تواند باعث افزایش ضربان قلب و فشارخون شود.\n" +
                                "•\tداروها را منظم مصرف کرده خودسرانه آن را قطع نکنید\n" +
                                "•\tقرص زیرزبانی همواره با خود داشته باشید.\n" +
                                "دستورالعمل استفاده از قرص زیرزبانی هنگام درد:\n" +
                                "•\tتمام فعالیتهایتان را متوقف کرده، بنشینید و اولین قرص را زبر زبانتان بگذارید و تا قطع کامل درد استراحت مطلق داشته باشید.\n" +
                                "•\tبعد از گذاشتن قرص زیر زبانی صبر کنید تا خوب حل شود و بزاق را کمی نگهدارید بعد آنرا قورت دهید.\n" +
                                "•\tدراز بکشید، سعی کنید ذهنتان آزاد باشد و هیچ استرسی به خود وارد نکنید.\n" +
                                "•\tپنج تا ده دقیقه صبر کنید، اگر دردتان کمتر نشد دومین قرص را استفاده نمایید. چنانچه بعد از ده دقیقه دردتان تسکین نیافت، سومین قرص را زیر زبانتان گذاشته و به نزدیکترین مرکز درمانی مراجعه نمایید.\n" +
                                "•\tقرصهای زیرزبانی تا 6 ماه قابل استفاده هستند.\n" +
                                "•\tقرصها را در جای خشک و خنک و در شیشه تیره رنگ نگهداری کنید. \n" +
                                "•\tقبل از فعالیت های سنگین و شرکت در موقعیت های هیجانی یک قرص زیر زبانتان بگذارید.\n" +
                                "4- وزنتان را بطور منظم کنترل کنید: اگر اضافه وزن دارید با یک برنامه صحیح غذایی اقدام به کاهش وزن نمایید.\n" +
                                "5- نکات قابل توجه در مورد رژیم غذایی\n" +
                                "•\tرژیم غذایی (کم کالری، کم چرب و با فیبر زیاد) را رعایت نمایید.\n" +
                                "•\tهرگز پرخوری نکنید، می توانید حجم غذا کمتری را در وعده های بیشتر دریافت کنید و میان وعده ها را بین وعده های اصلی بگنجائید.\n" +
                                "•\tاز نوشیدن چای پررنگ و نوشیدنی های حاوی کافئین (قهوه) خودداری کنید.\n" +
                                "•\tغذاهای نفاخ مصرف نکنید. بعد از صرف غذا مدت کوتاهی استراحت کنید و تا2ساعت فعالیت بدنی نداشته باشید.\n" +
                                "•\tرژیم پرفیبر (سبزیجات و میوه ها مانند شوید، هویج و سیب ...) را در برنامه غذایی تان بگنجانید چون فیبر باعث کاهش زور زدن حین اجابت مزاج و احتمال یبوست و سایر ناراحتی های روده ای می شود ضمناً سطح چربیهای مضر خون (کلسترول و تری گلیسرید) را کم کرده و از شدت حملات آنژین می کاهد .\n" +
                                "تمام عواملی را که احتمال می دهید روبرو شدن با آنها در شما \n" +
                                "موجب شروع درد می شود، شناسایی کرده و از مواجهه با آنها بپرهیزد.\n" +
                                "•\tاسترس نداشته باشید. در انجام کارها عجله نکنید و برای کارهایتان برنامه ریزی داشته باشید.\n" +
                                "•\tاگر سابقه مشکل روانی، اضطراب دارید حتماً به روانشناس مراجعه کنید.\n" +
                                "•\tدر مواقع تنش زا به نزدیکترین مرکز درمانی (مشاور، پزشک، پرستار) مراجعه کنید.\n" +
                                "در چه مواردی باید حتماً به پزشک مراجعه کنید؟\n" +
                                "•\tدردها، تعدادش بیش از حد معمول شود.\n" +
                                "•\tبدون فعالیت هم بروز کند.\n" +
                                "•\tبا استراحت تسکین نیابد\n" +
                                "•\tبا داروی زیرزبانی برطرف نشود\n" +
                                "•\tبیش از 5 دقیقه طول بکشد\n" +
                                "\n");
                        transaction1.replace(R.id.frame_layout, fragment1);
                        transaction1.addToBackStack(null);
                        transaction1.commit();
                        break;

                    case 2:
                        FragmentTransaction transaction2 = getFragmentManager().beginTransaction();
                        InfoIllness fragment2 = new InfoIllness();
                        fragment2.SetTitle("سکته قلبی ( انفارکتوس میوکارد ) ");
                        fragment2.SetBody("سکته قلبی ( انفارکتوس میوکارد ) چیست ؟ \n" +
                                "یک وضعیت اورژانسی است و رمانی رخ می دهد که عروق کرونر ( عروقی که به قلب خون رسانی می کنند ) دچار کاهش ناگهانی یا قطع کلی جریان خون می شوند و اجازه عبور خون کافی را به عضله قلب نمی دهند در صورتی که درمان سریع برای آن انجام نگردد باعث مرگ عضله قلبی و سکته قلبی می شود . \n" +
                                "عوامل ایجاد کننده سکته قلبی چیست ؟ \n" +
                                " \tسابقه خانوادگی\n" +
                                " \tسن و جنس ( سالمندان 60 سال و بالاتر ، زنان\n" +
                                " بعد از یائسگی ) \n" +
                                " \tفشار خون بالا\n" +
                                " \tداشتن اضافه وزن و چاقی \n" +
                                " \tابتلا به دیابت ( مرض قند ) \n" +
                                " \tمصرف دخانیات ( سیگار ، قلبان ، پیپ و چپق ) \n" +
                                " \tعدم ورزش و فعالیتهای کافی\n" +
                                " \tرژیم غذایی نامناسب ، پرچرب و پر نمک \n" +
                                " \tمصرف قرصهای ضد بارداری به مدت 10 سال \n" +
                                " \tاسترس روحی ( خصومت ، خشم ، عصبانیت ، پرخاشگری ، رقابت ) \n" +
                                "علائم و نشانه ها : \n" +
                                " \tدرد ناگهانی و احساس ناراحتی در قفسه\n" +
                                "سینه مثل درد فشار دهنده ، فشار یا سوزشی\n" +
                                " که معمولاً بیش از 20 دقیقه طول می کشد . \n" +
                                " \tدرد به گردن ، فک ، گلو ، شانه ها و بازوی چپ منتشر می شود . \n" +
                                " \tدرد ممکن است همراه با تنگی نفس ، سرگیجه ، بیقراری ، تهوع و استفراغ ، اضطراب ، هیجان ، عصبانیت و تعریق ( پوست سرد رنگ پریده یا مرطوب ) باشد . \n" +
                                " خستگی بدون علت و گیجی\n" +
                                " \tوحشت با احساس نزدیک شدن به مرگ\n" +
                                "در افراد سالمند و یا افراد دیابتی حدوداً \n" +
                                "در 20 درصد موارد سکته قلبی بدون درد می باشد \n" +
                                "هر دقیقه برای رسیدن به بیمارستان ، برای دریافت کمک پزشکی ارزش حیاتی دارد نيم ساعت اول بعد از شروع سکته قلبی مهمترین زمان است و به آن زمان طلایی گفته می شود هر چه درمان زودتر انجام شود آسیب عضله قلب کمتر و احتمال زنده ماندن بیشتر می شود هر چه درمان دیرتر انجام شود و مدت زمانی که خون به عضله قلب نمی رسد طولانی تر باشد صدمه عضله قلب وسیع تر می شود و مقدار بیشتری از بافت قلب از بین می رود . \n" +
                                "راههای تشخیصی : \n" +
                                " \tشرح حال بیمار ( علائم و نشانه ها )\n" +
                                " \tنوار قلب \n" +
                                " \tآزمایشات خون ( بررسی آنزیمهای قلبی ، چربی خون و ....  ) \t\n" +
                                " \tاکوکاردیوگرافی\n" +
                                " \tتست ورزش\n" +
                                " \tاسکن قلب\n" +
                                " \tآنژیوگرافی\n" +
                                "درمان : \n" +
                                "هدف از درمان سکته قلبی جلوگیری از پیشرفت حمله قلبی و کاهش بار قلب و پیشگیری از عوارض قلبی می باشد . \n" +
                                "درمان با استراحت و اکسیژن درمانی شروع و بدنبال آن از داروهای ضد درد قوی مثل مورفین تجویز می شود بعد سریعاً درمان با نیتروگلیسرین وریدی جهت کاهش بار قلبی شروع شده بدنبال آن در صورت صلاحدید پزشک متخصص قلب از داروهای ضد انعقاد ( ضد لخته ) بصورت وریدی استفاده می شود . این داروها شامل استرپتوکیناز ، هپارین و ... می باشد .\n" +
                                "در ادامه درمان ممکن است با توجه به شرایط شما و صلاحدید پزشک قلب  داروهای مرتبط با نوع بیماری شما شروع  شود مثل داروهای ضد فشارخون ، کاهنده چربی خون و ضد پلاکت (آسپرین ، پلاویکس) آرامبخش ها و ... \n" +
                                "رعایت نکات زیر از سکته قلبی در بازتوانی به شما کمک می کند : \n" +
                                "عیادت کنندگان \n" +
                                "عیادت کننده زیاد باعث خستگی بیمار می شود در زمانی که احساس خستگی می کنید از دوستان عذرخواهی نموده و از ملاقات با افرادی که شما را عصبانی می کنند بپرهیزید . \n" +
                                "\n" +
                                "تغذیه : \n" +
                                " \tبعد از گذراندن مرحله حاد سکته قلبي و با اجازه پزشک معالج طي 24 ساعت اول ، رژیم مایعات و سپس با توجه به تحمل شما رژیم قلبی شروع می شود در ابتدا از مصرف غذاهاي خیلی گرم و سرد خودداری کنید .\n" +
                                " \t معمولاً وعده های غذایی با حجم کم در دفعات بیشتر بهتر تحمل می شود  ، بهتر است در پنج وعده غذای خود را میل نمایید . \n" +
                                " \tاز پرخوری و با عجله خوردن اجتناب کنید و بعد از صرف غذا مدت کوتاهی استراحت کنید . \n" +
                                " \tاز فعالیت بدنی تا 2 ساعت بعد از غذا خودداری کنید . \n" +
                                " \tتوصیه اصلی به استفاده از غذای کم نمک و کم چربی می باشد . \n" +
                                " \tتوصیه می شود از غذاهای حاوی مرغ ، ماهی و گوشت تازه بدون چربی ، سبزیجات و میوه جات تازه ( بجز نارگیل حاوی چربی مضر می باشد ) و نوشیدنی های غیر شیرین استفاده کنید . \n" +
                                " \tاز مصرف غذاهای آماده ، کنسروها ، تن ها ، چای پررنگ ، قهوه و سایر غذاهای سنگین و پرچرب مثل دل ، جگر ، قلوه ، کله پاچه و چربی حیوانی مثل سرشیر ، ماست پر چرب و خامه خودداری کنید . \n" +
                                " \tمصرف هویج ، سیب ، شوید ، گوجه فرنگی و بادام برای قلب مفید است . \n" +
                                " \tاز روغن مایع بخصوص روغن زیتون و آفتابگردان استفاده کنید . \n" +
                                " \tدر غذای خود از نمک کمتر استفاده نمائید و برای خوش طعم کردن غذا از آب لیمو ، گیاهان معطر ، میخک ، فلفل فرنگی و مرکبات استفاده کنید. \n" +
                                " \tاز انواع سس ها ، ترشی ها ، شوری ها ( خیارشور و گوجه شور ) و پنیر محلی استفاده نکنید . \n" +
                                " \tماهی غذای جهانی قلب است . \n" +
                                "فعالیت بدنی : \n" +
                                " \tدر روزهای اول شما به 24 تا 48 ساعت\n" +
                                " استراحت کامل در بستر نیاز دارید. \n" +
                                "\n" +
                                " \tبسته به وضعیت بالینی و با نظر پزشک در بستر تمرین حرکات دست و پاها را شروع کنید برای کاهش خطر لخته شدن خون پاها را به آرامی حرکت دهید . \n" +
                                " \tاز فشار دادن پا به تخت یا بلند کردن سریع پاها از تخت اجتناب کنید . \n" +
                                " \tپس از تثبیت وضعیت می توانید چندین بار در روز هربار به مدت 20 الی 30 دقیقه روی صندلی کنار تخت بنشینید و سپس بتدریج ایستادن و راه رفتن را در حد تحمل و نظر پزشک انجام دهید . \n" +
                                " \tاگر در حین فعالیت ، احساس گیجی ، ضعف ، درد قفسه سینه ، تنگی نفس و خستگی داشتید بلافاصله فعالیت را متوقف نمایید . \n" +
                                " \tپس از ترخیص فعالیت را بتدریج از سربگیرید  فعالیت شما باید آرام ، آرام و تدریجی باشد . \n" +
                                " \tپیاده روی یک ورزش مفید می باشد . بعد از استراحت و زمانی که خسته نیستید پیاده روی کنید . \n" +
                                " \tاز ورزش کردن بعد از صرف غذا و در هوای خیلی گرم و سرد ، طوفانی ، هوای آلوده ، رطوبت زیاد ، مه آلود ، ارتفاعات و سربالایی خودداری کنید . \n" +
                                " \tحین فعالیتهای ورزشی نبض خود را کنترل کنید اگر بیش از 110 ضربه دردقیقه رسید و دچار بی نظمی شدید شد فعالیت را قطع کنید . \n" +
                                " \tفعالیتهایی که فشار زیاد به قلب وارد می کنند مثل زور زدن هنگام اجابت مزاج و کشیدن و بلندکردن اجسام سنگین خودداری کنید . \n" +
                                " \tحدود 3 هفته پس از سکته قلبی شما باید بتوانید حتی الامکان 20 تا 30 دقیقه روزانه راه بروید .\n" +
                                "کارهای منزل : \n" +
                                " \tکارهای معمولی خانه مدت کوتاهی بعد از حمله قلبی کم کم شروع شود نه تنها برای شما مضر نیست بلکه باعث سرگرمی و رفع خستگی و افسردگی می شود . \n" +
                                " \tدرانجام کارها عجله نکنید بخصوص هنگام صبح ، فعالیتها را به آهستگی انجام دهید و کارهای سبک و سنگین را بطور متناوب انجام دهید . \n" +
                                "\n" +
                                "\n" +
                                "بازگشت به سرکار : \n" +
                                " \t3 تا 4 هفته بعد از بازگشت به منزل با در نظر گرفتن وضعیت جسمی و نوع شغل شما با مشورت پزشک معالج در مورد رفتن شما به سرکار تصمیم گیری می شود . \n" +
                                " \tاگر کارمند هستید در صورت موافقت رئیس خود ابتدا بصورت نیمه وقت کار کنید و در سرکار خود استراحت داشته باشید . ( البته ابتدا نیمه وقت و بعد از 2 تا 3 هفته تمام وقت )  از کارهای سبک شروع کنید . \n" +
                                "رانندگی کردن : \n" +
                                " \tحداقل 4 هفته بعد از سکته قلبی نباید\n" +
                                " رانندگی کنید زیرا رانندگی با ماشین\n" +
                                " باعث استرس ، هیجان و سفتی عضلات شده که این امر باعث تپش قلب می شود . پس از گذشت این زمان می توانید رانندگی در فواصل کوتاه را شروع کنید . \n" +
                                " \tاگر در حین رانندگی دچار درد قفسه سینه شدید تا بهبودی کامل درد قلبی از رانندگی پرهیز کنید . \n" +
                                " \tدر مسافرتهای طولانی ماشین سواری نکنید . در صورت طولانی بودن مسیر بین راه هر یک ساعت یک مرتبه توقف کنید و قدم بزنید تا جریان خون در پاها بهتر شود . \n" +
                                " \tحداقل 2 تا 3 هفته بعد از سکته قلبی می توانید سفر هوایی داشته باشید مشروط  بر اینکه درگیری دیگر نداشته و با پزشک قلب خود مشورت نمائید .\n" +
                                "حمام کردن : \n" +
                                " \t4 تا 7 روز بعد از حمله قلبی با تائید پزشک با آب نیمه گرم و ملایم می توانید حمام کنید . بهتر است در روزهای اول یک نفر در حمام با شما باشد تا در صورت ضعف از او کمک بخواهید . \n" +
                                " \tآب سرد باعث بروز درد قلبی می شود و آب گرم باعث بروز حالات ضعف می گردد  . \n" +
                                " \tدر حمام زیاد نایستید بلکه روی چهارپایه نشسته و زمان حمام کردن کوتاه بین 15 تا 20 دقیقه باشد . \n" +
                                "روابط زناشویی : \n" +
                                " \tفعالیت جنسی فعالیت در حد متوسط محسوب می شود وقتی قادر به بالا رفتن از دو طبقه پله بدون سختی و بروز علائم باشید می توانید فعالیت جنسی را شروع کنید که معمولاً بسته به شرایط حداقل 4 هفته بعد از ترخیص می باشد . \n" +
                                " \tاز داشتن فعالیت جنسی در زمانهای خستگی و پس از خوردن غذای سنگین خودداری کنید . \n" +
                                " \tفعالیت جنسی را در زمان مناسب بعد از استراحت کافی و با داشتن یک خواب خوب شبانه انجام دهید و بعد از آن استراحت کنید . \n" +
                                " \tبرای جلوگیری از بروز درد قلبی قبل و بعد از فعالیت جنسی می توانید از پرل زیرزبانی نیتروگلیسرین استفاده کنید . \n" +
                                " \tدرد قلبی بعد از فعالیت جنسی که با مصرف 2 تا 3 پرل زیر زبانی نیتروگلیسیرین که به فواصل هر 5 دقیقه از هم برطرف نشود و همچنین خستگی بیش از حد و بیخوابی پس از فعالیت جنسی را حتماً به پزشک معالجتان اطلاع دهید . \n" +
                                " \tاز مصرف داروهای تقویت قوای جنسی مثل قرص ویاگرا(سيلدنافيل) بشدت پرهیز کنید زیرا با داروهای قلبی تداخلی مرگ آور دارد . \n" +
                                "سیگار کشیدن : \n" +
                                " \tدیگر سیگار نکشید و از افراد سیگاری دوری کنید . \n" +
                                " \tنیکوتین سیگار باعث تنگ شدن عروق و تندشدن ضربان قلب می شود و اکسیژن رسانی را به قلب کاهش می دهد . ( مصرف هر پاکت سیگار10 ساعت از عمر انسان را کاهش می دهد . ) \n" +
                                "اضافه وزن و چاقی : \n" +
                                " \tاگر اضافه وزن دارید ( بخصوص چربی دور شکم زیاد باشد ) ریسک سکته قلبی در آینده نیز بیشتر خواهد بود پس بهتر است با یک متخصص تغذیه مشورت کنید . \n" +
                                " \t\n" +
                                " افسردگی : \n" +
                                " \tافسردگی معمولاً بعد از سکته قلبی بوجود می آید اگر این احساس را دارید با پزشک خود مشورت کنید . درمان افسردگی کیفیت زندگی را بالا می برد . \n" +
                                "استرس : \n" +
                                "برای کاهش استرس می توانید کارهای زیر را انجام دهید : \n" +
                                " \tاز محیط پر سروصدا و شلوغ دوری کنید . \n" +
                                " \tتغییر شغلهای پر استرس\n" +
                                " \tاجتناب از رانندگی طولانی و پر استرس\n" +
                                " \tانجام ورزش و استراحت کافی\n" +
                                " \tداشتن سرگرمیهای لذت بخش\n" +
                                " \tتمرین تنفس عمیق و تن آرامی از طریق انجام یوگا و پیاده وری\n" +
                                "دیابت و فشار خون : \n" +
                                " \tدیابت ( مرض قند ) و فشار خون بالا از عوامل ایجاد کننده حمله های قلبی می باشند با رعایت رژیم غذایی و مصرف بموقع داروها و مراجعه دوره ای به پزشک احتمال حمله های قلبی را کاهش دهید . \n" +
                                "دارو : \n" +
                                " \tبدون دستور پزشک دارو را کم یا قطع نکنید .\n" +
                                " \tقبل از ترخیص ، پرستار یا پزشک راجع به چگونگی مصرف دارو به شما توضیح خواهند داد بهتر است یادداشت نمایید تا از خاطر نبرید . \n" +
                                " \tدر صورتیکه دارویی را در موقع مصرف فراموش کردید در زمان بعدی دو قرص را همزمان مصرف نکنید . \n" +
                                " \tداروهای تجویز شده مخصوص شما می باشد از دادن آن به دیگران خودداری کنید . \n" +
                                " \tبرخی داروها برای تنظیم ضربان قلب و فشار خون شما تجویز شده اند پس به صورت دوره ای نبض و فشار خون خود  را کنترل کنید در صورت وجود نبض کمتر از 60 ضربه در دقیقه و یا علائم فشار خون پائین ( سرگیجه ، تاری دید ، احساس ضعف شدید ، تعریق و ...) به پزشک معالج مراجعه نمائید شاید لازم باشد نوع داروی شما تغییر داده شود .  \n" +
                                " \tداروهایی مثل نیتروگلیسرین زیر زبانی و ایزوردیل(ايزوسوربايد) باعث سردرد می شوند که پس از چند روز مصرف به آن عادت کرده و کاهش می یابد در صورت نیاز به استامینوفن با پزشک خود مشورت کنید . \n" +
                                " \tدر صورت ایجاد تاری دید ، خشکی دهان و سردردهای شدید و ضربان دار با پزشک خود مشورت کنید . \n" +
                                " \tقرص های زیر زبانی در جای خشک و خنک و دور از نور تا شش ماه قابل نگهداری می باشد ( در یخچال نگهداری نشود . ) \n" +
                                " \tبرخی داروها باعث طولانی شدن زمان لخته خون می شوند سعی کنید از هر گونه صدمه و بریدگی پوست خودداری کرده و در محلهای بریدگی به مدت 10 دقیقه فشار وارد کنید . \n" +
                                " \tاز مسواک نرم و ریش تراش بجای تیغ استفاده نمایید . \n" +
                                " \tدر صورت بروز علائم خونریزی از بیني ، لثه ، تغییر رنگ ادرار و مدفوع ، خلط خونی ، خونریزی قاعدگی بیش از حد و کبودی در هر نقطه از بدن به پزشک خود اطلاع دهید \n" +
                                "مراجعه به پزشک : \n" +
                                " \tهنگام ترخیص از بیمارستان وقت مراجعه بعدی به پزشک به شما گفته می شود و در صورت بروز هرگونه علائم غیر عادی به پزشک مراجعه کنید. \n" +
                                " \tمعاینات دوره ای در طی سال برای بررسی وضعیت شما الزامی می باشد.\n" +
                                "\n" +
                                " \n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\n");
                        transaction2.replace(R.id.frame_layout, fragment2);
                        transaction2.addToBackStack(null);
                        transaction2.commit();
                        break;

                    case 3:
                        FragmentTransaction transaction3 = getFragmentManager().beginTransaction();
                        InfoIllness fragment3 = new InfoIllness();
                        fragment3.SetTitle("فشار خون");
                        fragment3.SetBody("فشار خون از عواملی است که برای ادامه حیات به آن نیاز داریم.\n" +
                                "فشار خون نیرویی است که همزمان با پمپ کردن خون توسط قلب به دیواره، عروق خونی وارد می شود. فشار خون ایده ال معمولاً 120/80 می باشد ولی می تواند بعد از ورزش استراحت یا تغییرات روحی و روانی بالا و پایین رود. فشار خون شما همیشه در یک حد ثابت نیست از یک روز به روز دیگر، از یک لحظه به لحظه دیگر و بر حسب نیاز بدن در حال تغییر است برای مثال حوالی9 صبح فشار خود شما حداکثر مقدار خود را دارد و عصرها فشار خون کاهش یافته و در شب به حداقل میزان خود می رسد.\n" +
                                "فشار خون با عواملي نظیر وضعیت بدن، فعالیت مغز، فعالیت گوارش، فعالیت عضلانی، تحریکات عصبی، تحریکات دردناک، مثانه پر، دمای هوا، میزان سر و صدا، مصرف سیگار، الکل، قهوه، چای و دارو در طول روز تغییر می کند اما موقتی است.\n" +
                                "فشارخون شامل دو رقم است . رقم بزرگتر فشار خون سيستولي است و مربوط به زماني است كه قلب منقبض جمع ميشود و خون را به درون رگهاي بدن مي راند. رقم كوچكتر فشار خون دياستولي است و مربوط به زماني است كه قلب مابين دو انقباض در حال استراحت است . واحدي كه فشار خون باآن اندازه گرفته مي شود ميليمتر جيوه  نام دارد .\n" +
                                "فشار خون بالا چیست؟\n" +
                                "به حداقل دوبار فشار خون بیش از 140/90 فشار خون بالا گفته می شود.\n" +
                                "با افزایش سن احتمال بروز فشار خون بالا بیشتر می شود و در افراد بالای60 سال شیوع فشار خون بالا به 50 درصد می رسد یعنی از هر دو نفر یک نفر مبتلا به فشار خون بالاست بنابراین در طول زندگی نیاز به کنترل دقیق فشار خون می باشد.\n");
                        transaction3.replace(R.id.frame_layout, fragment3);
                        transaction3.addToBackStack(null);
                        transaction3.commit();
                        break;

                    case 4:
                        FragmentTransaction transaction4 = getFragmentManager().beginTransaction();
                        InfoIllness fragment4 = new InfoIllness();
                        fragment4.SetTitle("نارسائی قلبی چیست؟");
                        fragment4.SetBody("نارسائی قلب یکی از شایع ترین علل مراجعه به بیمارستان در افراد 65 سال یا بیشتر می باشد معمولاً سال ها طول می کشد تا نارسائی قلب ایجاد شود در طول هفته ها و ماهها بدنبال ضعیف تر شدن قلب و توانایی کمتر آن برای پمپ کردن خون بر اساس نیازهای بدن ایجاد می شود.\n" +
                                "نارسایی قلب به دلیل عدم توانایی قلب در پمپاژ کافی خون برای رفع نیاز بافتها به اکسیژن و مواد مغذی ایجاد می شود.\n" +
                                "علائم و نشانه ها\n" +
                                "•\tتنگی نفس به هنگام دراز کشیدن و تنگی نفس حمله ای شبانه\n" +
                                "•\tورم دستها و پاها که به صورت گوده گذرا باشد\n" +
                                "•\tسرفه خشک یا مرطوب، وجود خلط کف آلودگاهی صورتی رنگ\n" +
                                "•\tخستگی، تعریق، کیجی، بی قراری و اضطراب و سبکی سر ، سردرد\n" +
                                "•\tبی اشتهایی ، تهوع و استفراغ، ضعف و شب ادرای\n" +
                                "•\tافزایش وزن به علت تجمع مایع در بدن\n" +
                                "علل نارسایی قلب چیست؟\n" +
                                "•\tعدم دریافت جریان خون کافی به قلب به دلیل گرفتگی سرخرگهاي کرونری\n" +
                                "•\tآسیب به عضله قلبی ناشی از حمله قلبی پیشین\n" +
                                "•\tنقص مادرزادی قلب\n" +
                                "•\tبیماری دریچه ای قلب\n" +
                                "•\tعفونت قلب و یا دریچه های قلب\n" +
                                "•\tفشار خون بالا\n" +
                                "•\tبیماری عضلات قلب (کاردیومیوپاتی)\n" +
                                "درمان\n" +
                                "اهداف کلی درمان نارسایی قلبی\n" +
                                "کاهش علائم و نشانه های بیماری جهت افزایش عملکرد بهتر قلبی و افزایش کیفیت زندگی و افزایش طول عمر می باشد .\n" +
                                "درمان بر اساس شدت بیماری متفاوت است ممکن است شامل داروها بصورت خوراکی و تزریق وریدی باشد. تغییرات در سبک زندگی، اکسیژن رسانی و عمل های جراحی باشد.\n" +
                                "\n" +
                                "\n" +
                                "داروهای رایج مورد استفاده در درمان نارسایی قلب\n" +
                                "آنالاپریل، لوزار، هیدرولازین، ایزوسورباید، متورال، کارویدولول، لازیکس و هیدروکلرو تيازید و اسپیرنولاکتون باعث کاهش فشار خون و کاهش بار قلب و کاهش علائم بیماری مي شود .\n" +
                                "دیگوگسین باعث افزایش قدرت انقباض قلب و کاهش علائم بیماری می شوند .\n" +
                                "\n" +
                                "نکات آموزشی: \n" +
                                "فعالیت و استراحت:\n" +
                                "•\tمدد جوی عزیز به شما توصیه می شود که درمرحله حاد بیماري ، در طول روز استراحت کافی داشته باشید و درزمان استراحت ، براي کاهش تنگی نفس بهتراست سربستر را 20 الی 30 سانتیمتر بالا برده ودرحالت نشسته یا نیمه نشسته قرار بگیرید.\n" +
                                "•\tدرصورتیکه درحالت درازکش دچارتنگی نفس می شوید بهتر است لبه ي تخت بنشینید و پاهاي خود را  آویزان روي صندلی قرارداده و دستها وسر خود را روي میزٍ بالاي تخت قراردهید .\n" +
                                "•\tپس از بهتر شدن بیماري ، فعالیت خود را به آهستگی و با کمک دیگران شروع کنید و کم کم آنرا افزایش دهید.\n" +
                                "•\tبراي جلوگیري از سرگیجه به آهستگی تغییروضعیت دهید و از حالت نشسته به ایستاده درآیید.\n" +
                                "•\tپس از هر بار فعالیت کمی استراحت نیز داشته باشید .\n" +
                                "•\tباتوجه به شرایط، فعالیت خود را افزایش دهید می توانید ورزش هایی مانند پیاده روي ، شنا ودوچرخه سواري انجام دهید ، درصورتیکه قادر به تحمل فعالیت نیستید ، بلافاصله آنرا متوقف کنید .\n" +
                                "•\tازقرارگرفتن در معرض هواي خیلی سرد یاگرم خودداري کنید و درهواي سرد روي بینی و دهان خود را با شالگردن بپوشانید و لباس گرم و مناسب استفاده کنید. همچنین بهتر است فعالیت خود را در موقعی از روز که هوا معتدل است انجام دهید .\n" +
                                "\n" +
                                "\n" +
                                "تغذیه\n" +
                                "•\tبه شما توصیه می شود درغذاي خود از نمک(سدیم) کمتر استفاده نمایید ، هر یک گرم نمک تقریبا\" 400 میلیگرم سدیم دارد . میزان سدیم مورد نیاز در رژیم غذایی افراد سالم 3 الی 10 گرم در روز است ،ولی لازم است شما مصرف آنرا به کمتر از 1 گرم در روز محدود نمایید ، یعنی به هنگام طبخ و صرف غذا به آن نمک اضافه نکنید و از مصرف غذاهاي نمک دار نیز خودداري نمایید ، زیرا این مقدار سدیم در مواد خام غذایی بدون  اضافه کردن نمک وجود دارد . ولی براي خوش طعم کردن غذاها می توانید از آبلیمو ، گیاهان معطر ، میخک ، فلفل فرنگی و مرکبات استفاده کنید.\n" +
                                "•\tمواد غذایی باسدیم فراوان شامل : گوشت نمک سود شده ، گوشتهاي آماده و غذاهاي کنسرو شده ، سوسیس ، همبرگر، انواع سسها ، ترشی ، شورها ، ادویه جات و برخی پنیرها می باشد که لازم است از خوردن آنها خودداري کنید.\n" +
                                "•\tغذاهایی مانند : مرغ ، برنج ، سیب زمینی، سدیم کمی دارند ، از این دسته از مواد غذایی     می توانید استفاده کنید.\n" +
                                "•\tبرچسب مواد غذایی، نوشیدنی ها و غذاهاي آماده را از نظرمیزان سدیم کنترل کنید. همچنین داروهایی مانند آنتی اسیدها (شربتهاي معده) ، مسهل ها ، شربت ضد سرفه وقرصهاي مسکن ممکن است حاوي سدیم فراوان باشند ، بنابراین بدون نسخه پزشک دارویی را مصرف نکنید.\n" +
                                "•\tتعداد وعده هاي غذایی خود را بیشتر ، ولی حجم آنرا کم کنید و از مصرف مواد محرك مانند : قهوه ، مواد حاوي کافئین ، الکل و سیگار خودداري نمایید.\n" +
                                "•\tبسته به وضعیت خود و با نظر پزشک محدودیت مصرف مایعات را رعایت کنید.\n" +
                                "•\tممکن است نیاز به محدود کردن مایعات به کمتر از 5/1 لیتر در روز باشد برای رفع خشکی دهانتان می توانید از آبنبات سفت و آدامس بدون قند استفاده کنید و یا دهانتان را شستشو دهید. البته در صورتی که سدیم موجود در رژیم غذایی خود را کنترل نمایید و داروی ادرارآور مصرف کنید، معمولاً مصرف مایعات خودبه خود تنظیم می شودو نیازی به محدودیت شدید مایعات ندارید، مگر اینکه دستور پزشکی خاصی داشته باشید.\n" +
                                "•\tجهت بررسی حجم مایعات بدنتان ، هر روز صبح در یکساعت مشخص پس از تخلیه ي مثانه وزن خود را کنترل و یادداشت نمایید و هر گونه افزایش  وزن ناگهانی به میزان (4/1-9/0) کیلوگرم در روز یا (5/2-3/2) کيلوگرم در عرض یک هفته را گزارش دهید.\n" +
                                "•\tبسته به نوع داروی ادرار آوری که مصرف می کنید ممکن است یک رژیم غذایی با پتاسیم کم یا زیاد به شما توصیه شود. مواد غذایی با پتاسیم بالا شامل: موز، مرکبات، سبزیجات برگدار سبز، گوجه فرنگی، خرما، زردآلو، هلو، انجیر، و غذاهای دریایی می باشد.\n" +
                                "در مورد مصرف داروهای قلبی\n" +
                                "مددجوي عزیز لطفا\" در صورتیکه دیگوگسین مصرف میکنید:\n" +
                                "حتما\" قبل از مصرف آن نبض خود را کنترل کنید و در صورتیکه کمتر از 60 ضربه در دقیقه بود به پزشک خود اطلاع دهید .\n" +
                                "حتما\" به علایم مسمومیت با دیگوگسین مانند : بی اشتهایی ، گیجی ، تهوع و استفراغ ، خستگی و اختلالات  بینایی توجه داشته باشید و در صورت بروز این علایم به پزشک خود مراجعه نمایید .\n" +
                                "به خاطر داشته باشید که مصرف همزمان دیگوگسین با برخی از مواد غذایی پرفیبر مانند : سبزیجات خام ، میوه ها ، سبوس ، داروهاي آنتی اسید (شربت معده)، داروهاي ضد اسهال وملین ها باعث کاهش جذب دیگوگسین میشود ، بنابراین از مصرف همزمان آنها خودداري کنید.\n" +
                                "در صورت مصرف داروهاي ادرارآور:\n" +
                                "•\tاین داروها را در ابتداي صبح مصرف کنید.\n" +
                                "•\tوزن و فشار خون خود را تحت نظر پزشک کنترل نمایید.\n" +
                                "•\tعوارض این داروها از جمله : گیجی ، نبض نامنظم ، شلی عضلانی ، کرختی و مورمور شدن دست و پا ، اسهال ، تهوع و درد شکمی ، خشکی دهان ، تشنگی زیاد ، تب ، ضعف و خستگی را در نظر داشته باشید.\n" +
                                "•\tبصورت دوره ای جهت اندازه گیری سدیم و پتاسیم خون به پزشک مراجعه کرده و آزمایش انجام دهید.\n" +
                                "•\tتوصیه می شود برای جلوگیری از عفونتهاي تنفسي از رفتن به محلهای آلوده و شلوغ و تماس با افراد عفونی خوداری کنید.\n" +
                                "•\tاول پاییز جهت پیشگیری از آنفولانزا به پزشک خود مراجعه کرده و واکسن بزنید.\n");
                        transaction4.replace(R.id.frame_layout, fragment4);
                        transaction4.addToBackStack(null);
                        transaction4.commit();
                        break;
                }
            }
        });

        showBackButton();

        return v;
    }

    public void showBackButton() {
        if (getActivity() instanceof MainActivity) {
            ((MainActivity) getActivity()).getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        }
    }

}
