package com.example.nazanin.hospitalapp.Illness;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentTransaction;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

import com.example.nazanin.hospitalapp.MainActivity;
import com.example.nazanin.hospitalapp.R;


public class IllnessICU extends Fragment {

    private ListView listICU;
    private String[] list={"تشنج","سپسیس","سکته قلبی","سکته مغزی","مسمومیت با مونوکسیدکربن","مسمومیت"};


    public static IllnessEye newInstance() {
        IllnessEye fragment = new IllnessEye();

        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_illness_icu, container, false);
        listICU = v.findViewById(R.id.listICU);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(getContext(),R.layout.list_textview,list);
        listICU.setAdapter(adapter);
        listICU.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                switch (position){
                    case 0:
                        FragmentTransaction transaction = getFragmentManager().beginTransaction();
                        InfoIllness fragment = new InfoIllness();
                        fragment.SetTitle("تشنج");
                        fragment.SetBody("تشنج\u200C (كه\u200C حمله\u200C تشنجي\u200C يا حمله\u200C غش\u200C هم\u200C نام\u200C دارد) شامل\u200C انقباضات\u200C غيرارادي\u200C تعداد زيادي\u200C از عضلات\u200C بدن\u200C است\u200C. اين\u200C وضعيت\u200C  ناشی از تغییر ناگهانی و موقتی در عملکرد مغز است که بعلت تخلیه الکتریکی گروهی از سلولهای عصبی مغز ایجاد میشود. تخلیه الکتریکی همزمان، حمله ای و گذرای سلولهای عصبی،تغییراتی را در فعالیت ذهنی و رفتار فرد ایجاد می کند که از دوره زمانی بدون توجه تا بدون واکنش به تحریکات و انقباض پرشی عضلات متغیر است. تشنج یک بیماری نیست بلکه نشانه ای از نقایص زمینه ای، آسیب یا بیماری است.");
                        transaction.replace(R.id.frame_layout, fragment);
                        transaction.addToBackStack(null);
                        transaction.commit();
                        break;

                    case 1:
                        FragmentTransaction transaction1 = getFragmentManager().beginTransaction();
                        InfoIllness fragment1 = new InfoIllness();
                        fragment1.SetTitle("سپسیس");
                        fragment1.SetBody("هدف کلی:\n" +
                                "آگاهی و شناخت بیماری و چگونگی مراقبت از این افراد و آموزش مراقبت از خود\n" +
                                "اهداف رفتاری\n" +
                                "شناختی :  \n" +
                                "•\tشناخت ماهیت بیماری، علایم و روش های تشخیصی و درمان\n" +
                                "روانی –حرکتی : \n" +
                                "•\tاجرای صحیح مراقبت های پرستاری در رابطه با بیماری\n" +
                                "•\tآموزش صحیح به بیماران جهت خودمراقبتی در منزل و پیگیری مجدد\n" +
                                "عاطفی : \n" +
                                "•\tدرک اهمیت اصول صحیح مراقبت های پرستاری\n" +
                                "•\tدرک اهمیت آموزش صحیح به بیمار \n" +
                                "\n" +
                                "سپسیس (عفونت خون)\n" +
                                "سپسیس (عفونت خون) زمانی ایجاد می شود که میکروب وارد بدن شده و در کل خون و بافت های بدن منتشر می شود. بدن در پاسخ به سمی که میکروب تولید می کند، پاسخی می دهد که با توجه به وسعت انتشار میکروب در بدن، این واکنش التهابی وسیع می تواند در کل بدن انتشار یابد و درجه حرارت، فشار خون، عملکرد ریه ها و کلیه ها و سایر اعضای بدن را به سرعت تغییر  دهد. \n" +
                                "سپسیس یک بیماری جدی می باشد و شدت آن متفاوت است. نوع شدید (حاد) سپسیس را شوک سپتیک (عفونی) گویند و زمانی رخ می دهد که واکنش التهابی باعث بوجود آمدن لخته های کوچک خون می شود و خونرسانی کاهش می یابد و باعث شده  اندام های حیاتی، اکسیژن و غذای کافی دریافت نکرده و دچار اختلال عملکرد گردیده و منجر به نارسایی کلیه، کبد و ریه می شود.\n" +
                                "علت سپسیس:\n" +
                                "بسیاری از میکروب ها (باکتری ها، قارچ ها، ویروس ها) می توانند باعث عفونت خون  شوند. عفونت باکتریایی خون یکی از شایع ترین آنها می باشد. عفونت ریه (پنومونی)، عفونت کلیه و مثانه، عفونت پوست، عفونت های شکمی مثل التهاب آپاندیس، عفونت های مناطق دیگر بدن مثل مننژیت، می توانند منتشر شده و به سپسیس تبدیل شوند. عفونت های بعد از جراحی ها هم می توانند باعث سپسیس شوند.\n" +
                                "افرادی که در معرض خطر ابتلا قرار دارند:\n" +
                                "\uF0D8\tافرادی که سیستم ایمنی بدنشان هنوز کامل نشده است (نوزادان و خردسالان)\n" +
                                "\uF0D8\tنوزادان با وزن بسیار کم هنگام تولد\n" +
                                "\uF0D8\tاافراد مسنی که سیستم ایمنی بدنشان ضعیف شده است\n" +
                                "علائم سپسیس:\n" +
                                "\uF0FC\tحرارت بدن بالا و پائین می رود، زیرا قادر نمی باشد دما را کنترل کند.\n" +
                                "\uF0FC\tلرز\n" +
                                "\uF0FC\tافزایش ضربان قلب و تنفس\n" +
                                "\uF0FC\tکاهش سطح هوشیاری، هذیان گویی و گیجی\n" +
                                "\uF0FC\tخونریزی های کوچک زیر پوستی که هم می تواند به صورت تغییر رنگ پوست و هم به صورت نقطه های کوچک قرمز باشد.\n" +
                                "\uF0FC\tکاهش پلاکت خون\n" +
                                "\uF0FC\tدرد مفاصل مثل ستون مهره ها، مچ دست، ران، آرنج و زانو\n" +
                                "\uF0FC\tتهوع و استفراغ\n" +
                                "\uF0FC\tاسهال \n" +
                                "\uF0FC\tکاهش ادرار\n" +
                                "\uF0FC\tدر نوزادان کاهش تون عضلات و کاهش اشتها\n" +
                                "\uF0FC\tدر شوک عفونی، علاوه بر علائم  فوق ، فشار خون افت می کند و پوست سرد می شود.\n" +
                                "چه وقت باید به پزشک مراجعه کرد؟\n" +
                                "\uF0D8\tاگر هر کدام از علائم سپسیس را مشاهده کردید و یا اگر در هر کدام از وضعیت های زیر بودید به پزشک مراجعه کنید:\n" +
                                "\uF0D8\tدر حال شیمی درمانی و یا درمان با اشعه هستید.\n" +
                                "\uF0D8\tپیوند عضو شده اید.\n" +
                                "\uF0D8\tبیماری ایدز داشتید.\n" +
                                "\uF0D8\tکودک زیر دو ماه که تب، بی حالی، کاهش اشتها، تغییر در رفتار طبیعی و لکه های پوستی غیر معمول دارد.\n" +
                                "تشخیص سپسیس:\n" +
                                "\uF076\tآزمایش خون و کشت خون (بررسی میکروب در خون)\n" +
                                "\uF076\tآزمایش خلط، مایع مغزی نخاعی\n" +
                                "\uF076\tعکس برداری از قفسه سینه (بررسی ذات الریه)\n" +
                                "\uF076\tسی تی اسکن شکم (بررسی عفونت شکم)\n" +
                                "درمان سپسیس:\n" +
                                "\uF0FC\tمعمولا\" فرد مبتلا در بیمارستان بستری می شود. در موارد شدید (شوک سپسیس) در بخش مراقبت های ویژه بستری می شود.\n" +
                                "\uF0FC\tممکن است نیاز به اکسیژن داشته باشید که از طریق ماسک (بر روی دهان و بینی قرار می گیرد) و یا لوله (داخل بینی قرار می گیرد)  و به شما اکسیژن داده می شود.\n" +
                                "\uF0FC\tاستراحت در تخت برای بیمار در وضعیت حاد ضروری است.\n" +
                                "\uF0FC\tآنتی بیوتیک تزریقی داده می شود.\n" +
                                "\uF0FC\tپزشک ممکن است سرم و داروهایی برای افزایش فشار خون تجویز کند.\n" +
                                "\uF0FC\tاگر عفونت در شکم وجود داشته باشد، جراحی برای تخلیه عفونت لازم می باشد.\n" +
                                "\uF0FC\tانجام دیالیز در مواردی که نارسایی کلیه رخ داده است.\n" +
                                "عوارض احتمالی:\n" +
                                "در صورتی که عفونت خون درمان نشود یا همه بدن را در بر گیرد، می تواند عواقب جدی را در پی داشته باشد:\n" +
                                "\uF0D8\tعفونت دائمی دریچه های قلبی\n" +
                                "\uF0D8\tنارسایی تنفسی بزرگسالان\n" +
                                "\uF0D8\tنارسایی اعضای بدن (قلب، ریه ها، کلیه ها و کبد)\n" +
                                "\uF0D8\tشوک، کاهش شدید فشار خون، عفونت شدید و مرگ\n" +
                                "پیشگیری:\n" +
                                "\uF0FC\tدر صورت بروز هرگونه عفونت، برای درمان مراجعه نمائید.\n" +
                                "\uF0FC\tتوجه به اصول بهداشتی و استریل در مراقبت های بیمارستانی و پس از جراحی های بزرگ\n" +
                                "\uF0FC\tتزریق واکسن آنفلوآنزا به بیماران در معرض خطر بالای این عفونت می باشند.\n" +
                                "\uF0FC\tاگر قبلا\" انجام کار دندانپزشکی باعث بروز عفونت خون در شما شده است، یا اینکه بیماری دریچه ای قلب دارید، پیش از انجام هر گونه کار دندانپزشکی، با راهنمایی دندانپزشک، آنتی بیوتیک جهت پیشگیری مصرف کنید.\n" +
                                "\uF0FC\tانجام به موقع برنامه های واکسیناسیون کودکان، احتمال این عفونت ها را کاهش می دهد.\n" +
                                "\uF0FC\tبا رعایت بهداشت و شستن دست ها در محیط بیمارستان، عفونت های بیمارستانی که منجر به عفونت خون می شوند را می توان کاهش داد.\n" +
                                "\uF0FC\tویتامین ث (C) مانع بروز عفونت خون می شود و حتی در صورت بروز عفونت، به درمان آن کمک می کند. ویتامین ث مانع بروز لخته های مویرگی (در رگ های کوچک) شده و به این ترتیب احتمال بروز عفونت خون را کاهش می دهد.\n" +
                                "\uF0FC\tمنابع غنی از ویتامین ث عبارتند از: مرکبات، گوجه فرنگی، گل کلم، فلفل سبز، توت فرنگی، کیوی و طالبی.\n" +
                                "بعد از ترخیص، در این شرایط به پزشک خود مراجعه کنید:\n" +
                                "\uF0D8\tبروز تب مجدد\n" +
                                "\uF0D8\tعلائم عفونت (تورم، درد، قرمزی) در هر قسمت از بدن\n" +
                                "\uF0D8\tاگر شما قبلا\" سابقه عفونت خون داشته ای و هم اکنون می خواهید یک جراحی غیر اورژانسی و یا یک اقدام دندانپزشکی انجام دهید.\n" +
                                "\uF0D8\tاگر دچار علائم جدید و غیر قابل کنترل شده اید (ممکن است نشانه ای از عوارض جانبی داروهای مورد استفاده باشد)\n");
                        transaction1.replace(R.id.frame_layout, fragment1);
                        transaction1.addToBackStack(null);
                        transaction1.commit();
                        break;

                    case 2:
                        FragmentTransaction transaction2 = getFragmentManager().beginTransaction();
                        InfoIllness fragment2 = new InfoIllness();
                        fragment2.SetTitle("سکته قلبی ( انفارکتوس میوکارد ) ");
                        fragment2.SetBody("سکته قلبی ( انفارکتوس میوکارد ) چیست ؟ \n" +
                                "یک وضعیت اورژانسی است و رمانی رخ می دهد که عروق کرونر ( عروقی که به قلب خون رسانی می کنند ) دچار کاهش ناگهانی یا قطع کلی جریان خون می شوند و اجازه عبور خون کافی را به عضله قلب نمی دهند در صورتی که درمان سریع برای آن انجام نگردد باعث مرگ عضله قلبی و سکته قلبی می شود . \n");
                        transaction2.replace(R.id.frame_layout, fragment2);
                        transaction2.addToBackStack(null);
                        transaction2.commit();
                        break;

                    case 3:
                        FragmentTransaction transaction3 = getFragmentManager().beginTransaction();
                        InfoIllness fragment3 = new InfoIllness();
                        fragment3.SetTitle("سکته مغزي ");
                        fragment3.SetBody("سکته مغزي يک آسيب ناگهاني به سيستم عصبي است\n" +
                                " که طي آن ، جريان خوني که تامين کننده مواد غذايي\n" +
                                " و اکسيژن قسمتي از مغز مي باشد قطع مي شود . در نتيجه\n" +
                                " عملکرد عصبي ناحيه آسيب ديده دچار اشکال مي شود .\n" +
                                " شدت اختلال عملکرد ، براساس ناحيه ي درگير و وسعت ان متفاوت مي باشد که اين وضعيت را اصطلاحاً سکته مغزي مي گويند . \n");
                        transaction3.replace(R.id.frame_layout, fragment3);
                        transaction3.addToBackStack(null);
                        transaction3.commit();
                        break;

                    case 4:
                        FragmentTransaction transaction4 = getFragmentManager().beginTransaction();
                        InfoIllness fragment4 = new InfoIllness();
                        fragment4.SetTitle("مسمومیت با مونوکسید کربن");
                        fragment4.SetBody("آگاهی و شناخت بیماری و چگونگی مراقبت از این افراد و آموزش مراقبت از خود\n" +
                                "اهداف رفتاری\n" +
                                "شناختی :  \n" +
                                "•\tشناخت ماهیت بیماری، علایم و روش های تشخیصی و درمان\n" +
                                "روانی –حرکتی : \n" +
                                "•\tاجرای صحیح مراقبت های پرستاری در رابطه با بیماری\n" +
                                "•\tآموزش صحیح به بیماران جهت خودمراقبتی در منزل و پیگیری مجدد\n" +
                                "عاطفی : \n" +
                                "•\tدرک اهمیت اصول صحیح مراقبت های پرستاری\n" +
                                "•\tدرک اهمیت آموزش صحیح به بیمار \n" +
                                "\n" +
                                "مسمومیت با منواکسید کربن co (گازگرفتگی)\n" +
                                "مسمومیت با منواکسید کربن به دنبال حوادث خانگی ،بدنبال نقص فنی و یا در نتیجه اقدام به خودکشی رخ     می دهد . منو اکسید کربن بیش از هر ماده سمی دیگری به استثنای (الکل) منجر به مرگ افراد می شود.\n" +
                                "کلیه موادی که به عنوان سوخت استفاده می کنیم اگر با مقدار کافی اکسیژن و به طور کامل بسوزند گازی بنام دی اکسید کربن (co2 ) ایجاد می کنند که وارد هوا می شود ولی اگر سوختن به طور ناقص انجام شود گاز سمی و بی بوی منو اکسید کربن تولید می شود.\n" +
                                "این نوع مسمومیت بیشتر بر اثر گازی که در منازل بعنوان سوخت بکار می رود و یا دود آتش با روشن کردن اتومبیل در گاراژ سربسته، کرسی و منقل ایجاد می شود.\n" +
                                "منو اکسید کربن اثر سمی خود را با ترکیب شدن با هموکلوبین موجود در گردش خون و در نتیجه کاهش ظرفیت حمل اکسیژن خون ایجاد می کند در نتیجه کمبود اکسیژن در خون باعث کاهش اکسیژن رسانی به تمام بافتها شده و از آنجا که نیاز مغز به اکسیژن حیاتی می باشد علائم عصبی در مسمومیت با منواکسید کربن واضحتر و غالب می باشد.\n" +
                                "*میل ترکیب شدن منواکسید کربن با هموگلوبین 250برابر بیشتر از میل ترکیب شدن اکسیژن با هموگلوبین می باشد.\n" +
                                "علائم و نشانه های مسمومیت با منواکسید کربن : \n" +
                                "بیمار دچار مسمومیت با منواکسید کربن بدلیل کاهش\n" +
                                " اکسیژن رسانی به مغز ظاهری شبیه به افراد مست دارد.\n" +
                                "علائم شامل موارد زیر می باشد:\n" +
                                "1-سردرد، ابتدا به صورت سنگینی در سر و بعدا به صورت زق زق کردن بود.\n" +
                                "2-تهوع\n" +
                                "3-تحریک پذیری\n" +
                                "4-افزایش تعداد تنفس\n" +
                                "5-ضعف عضلانی \n" +
                                "6- تپش قلب\n" +
                                "7-خواب آلودگی \n" +
                                "8- تشنج\n" +
                                "9-کاهش حس شنوایی و بینایی\n" +
                                "10-رنگ پوست ممکن است سیانوزه (تیره) یا رنگ پریده باشد\n" +
                                "11-گیجی که می تواند سریعا تا کما پیشرفت کند\n" +
                                "کمکهای اولیه در مسمومیت با گاز منواکسید کربن\n" +
                                "1-فورا فرد مسموم را به هوای آزاد انتقال داده کلیه درب و پنجره ها را باز کنید \n" +
                                "2-راههای تنفسی بیمار را باز دید کنید اشیاء خارجی و دندانهای مصنوعی را خارج کرده، سر بیمار را در وضعیتی قرار دهید که راحت تنفس کند و از خم شدن سر به روی سینه جلوگیری کنید برای این منظور بالشتی کوچک زیر شانه وی قرار دهید که سر به عقب بر گردد و راه تنفس باز گردد.\n" +
                                "3-همه لباسهای تنگ را آزاد کنید\n" +
                                "4-از لرزیدن بیمار جلوگیری کرده و روی او را با پتو بپوشانيد\n" +
                                "5-تا حد امکان بیمار را آرام نگه دارید\n" +
                                "6-در صورت لزوم تنفس مصنوعی دهان به دهان بدهید و بیمار \n" +
                                "را فورا به بیمارستان منتقل کنید و یا با 115 تماس بگیرید\n" +
                                "درمان\n" +
                                "در مراکز درمانی دادن اکسیژن با غلظت بالایی100 درصد با \n" +
                                "ماسک می باشد.\n" +
                                "با توجه به علائم نشانه های بیمار سایر اقدامات دیگر ممکن است نیاز پیدا کنند.\n" +
                                "1-در کاهش خون رسانی به مغز و وجود ادم مغزی (بصورت ناگهانی علائم و نشانه هایی شامل سردرد و سرگیجه، تهوع و استفراغ ،کاهش بینایی، تنفس نامنظم، عدم توانایی در راه رفتن ، بی حسی و بهت زدگی، تشنج ، کاهش سطح هوشیاری بروز کند از داروهایی مانند مانیتول و کورتون(طبق نظر پزشک معالج استفاده می شود.\n" +
                                "2-درمان تشنج با داروهای ضد تشنج (دیازپام و فنی توتین)\n" +
                                "در صورت شدید نبودن مسمومیت معمولا با اقدامات درمانی مناسب بیمار بهبود می یابد و کوما (بیهوشی) در طی 10 ساعت بعد از درمان بر طرف می شود ولی اگر علائم بدتر شدن وضعیت ذهنی بیمار برای 2 هفته باقی بماند بهبودی کامل تقریبا مشکل می باشد.\n" +
                                "تمام وسایل گرمازا، اعم از بخاری، اجاق گاز آب گرمکن و غیره\n" +
                                "در منزل باید دارای دودکش سالم باشند\n");
                        transaction4.replace(R.id.frame_layout, fragment4);
                        transaction4.addToBackStack(null);
                        transaction4.commit();
                        break;



                    case 5:
                        FragmentTransaction transaction5 = getFragmentManager().beginTransaction();
                        InfoIllness fragment5 = new InfoIllness();
                        fragment5.SetTitle("مسمومیت");
                        fragment5.SetBody("هدف کلی:\n" +
                                "آگاهی و شناخت بیماری و چگونگی مراقبت از این افراد و آموزش مراقبت از خود\n" +
                                "اهداف رفتاری\n" +
                                "شناختی :  \n" +
                                "•\tشناخت ماهیت بیماری، علایم و روش های تشخیصی و درمان\n" +
                                "روانی –حرکتی : \n" +
                                "•\tاجرای صحیح مراقبت های پرستاری در رابطه با بیماری\n" +
                                "•\tآموزش صحیح به بیماران جهت خودمراقبتی در منزل و پیگیری مجدد\n" +
                                "عاطفی : \n" +
                                "•\tدرک اهمیت اصول صحیح مراقبت های پرستاری\n" +
                                "•\tدرک اهمیت آموزش صحیح به بیمار \n" +
                                "\n" +
                                "مسمومیت \n" +
                                "ابتدا شناخت مسمومیت سپس پیشگیری \n" +
                                "مسمومیت هایی که برخی از آنها در کشور ما شایع است خیلی وقت ها به دلیل ناآگاهی و نداشتن اطلاعات رخ می دهد. گاهی هم علت مسمومیت این است که فرد قصد خودکشی داشته است. آمارها می گوید در سال های اخیر مسومیت با مواد مخدر بیشتر از انواع دیگر مسمومیت شیوع داشته و بعد از آن مسمومیت با سموم دفع آفات و الکل \n" +
                                "در مورد فرد مسموم و چگونگی برخورد با او باورهای غلطی بین مردم وجود دارد. برخی معتقدندباید او را وادار به استفراغ کرد و برخی دیگر مقدار زیادی شیر یا آب به مصدوم می دهند که این اقدام ها گاهی کار را خراب تر از آنچه هست، می کند.\n" +
                                "باید قبل از هر اقدامی صددرصد مطمئن شویم فرد مسموم شده است. علاوه بر این، در انجام هر گونه اقدامی این که بدانیم فرد دچار چه نوع مسمومیتی شده است هم اهمیت دارد.\n" +
                                "هر ماده ای می تواند سمی باشد\n" +
                                "ورود هر ماده سمی به بدن می تواند باعث ایجاد مسمومیت شود. این ماده می تواند از طریق خوراکی، استنشاقی یا تزریق وارد بدن و مخاط شود و مسمومیت ایجاد کند. طبق گفته هاي دکتر شادنيا : ماده سمی، ماده ای است که وقتی وارد بدن می شود، روی سلول های بدن اثر می گذارد یا عملکرد آنها را دچار اختلال یا ساختارشان را مختل می کند و در نهایت به مرگ سلول می انجامد.\n" +
                                "با این تعریف، هر ماده ای می تواند سمی باشد و آنچه تعیین می کند چه ماده ای سمی است، دوز و مقدار مصرف آن است. داروها با وجود اثر درمانی شان در دوزهایی که پزشک تعیین می کند، اگر زیاد مصرف شود، فرد را دچار مسمومیت می کند. حتی آبی که به عنوان مایه حیات می شناسیم اگر زیاد مصرف شود، ممکن است باعث مسمومیت شود. استنشاق بیش از حد اکسیژنی که نبودش باعث از بین رفتن انسان می شود هم در نوزادان تازه به دنیا امده می تواند باعث مسمومیت شود.\n" +
                                "\n" +
                                "مسمومیت ها دو نوع است: \n" +
                                "مسمومیت ها را کلا می توان به دو گروه تقسیم کرد: \n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "مسمومیت های دارویی و مسمومیت های شیمیایی\n" +
                                "شایع ترین مسمومیت های دارویی، با مصرف داروهای آرامبخش و خواب آور مثل دیازپام اتفاق می افتد. بعد از آن، مسمومیت با مسکن ها مثل استامینوفن و داروهای ضدالتهاب غیر استروییدی، آسپرین و ... شایع است.\n" +
                                "گاهی هم مسمومیت با مصرف داروهای قلبی بروز می کند. سردسته مسمومیت های شیمیایی، ترکیب هایی است که مورد سوء مصرف قرار می گیرد، مثل مواد مخدر، مواد محرک مثل آمفتامین ها و مشتقات آن و ... علاوه بر این، مسمومیت با سموم دفع آفات هم شیوع دارد: از سموم کشاورزی گرفته تا هر سم دیگری که برای کشتن آفت ها به کار می رود.\n" +
                                "مسمومیت در سنین مختلف\n" +
                                "علت مسمومیت در گروه های سنی مختلف تفاوت دارد. معمولا مسمومیت در بچه های زیر هفت سال تصادفی است، یعنی کودک ممکن است به دلیل کنجکاوی کودکانه دچار مسمومیت تصادفی با داروهایی که در خانه نگهداری می شود و یا مواد شوینده شود. علاوه بر این، در افراد مسن مسمومیت دیده می شود.\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "علت مسمومیت این گروه سنی در بیشتر موارد این ست که معمولا این افراد به دلیل شرایط سنی و ابتلا به بیمارهای مختلف داروهای زیادی در روز مصرف می کنند و امکان دارد دچار تداخلات دارویی شوند. گاهی هم به دلیل کهولت سن و مشکلات حافظه فراموش می کنند دارویی را مصرف کرده اند و ممکن است دوباره آن را بخورند و دچار مسمومیت تصادفی شوند.\n" +
                                "\n" +
                                "\n" +
                                "مسمومیت عمدی،مسمومیت تصادفی\n" +
                                "در گروه سنی بالای 12 سال تا سنین بالا مسمومیت ها عمدی است، نه تصادفی، گاهی این مسمومیت به دلیل مصرف ماده ای به قصد خودکشی اتفاق می افتد و گاهی هم فرد برای جلب توجه این کار را انجام می دهد.\n" +
                                "البته برخی مسمومیت های تصادفی ممکن است برای همه پیش بیاید، مثل مسمومیت با گاز منواکسید کربن که علت این مسمومیت استفاده غیر اصولی از وسایل گرمایشی یا استفاده از گرم کننده های غیر استاندارد و مواد احتراقی است. مسمومیت با مواد مخدر هم می تواند جنبه عمدی داشته باشد، چون فرد آگاهانه این ماده را به قصد سرخوشی استفاده می کند، نه خودکشی ولی امکان مسمومیت او وجود دارد و این موضوع نمی تواند تصادفی باشد.\n" +
                                "به این علائم توجه کنید.\n" +
                                "علائمی وجود دارد که اگر در خود یا اطرافیانتان دیدید، می توانید به این که مسموم شده اید، شک کنید،\n" +
                                "اول: تهوع و استفراغ ، دل پیچه که خیلی از مردم آن را معمولا به عنوان نشانه مسمومیت می دانند. مخصوصا اگر بدون دلیل خاصی و ناگهانی اتفاق افتاده باشد، معمولا ذهن به سمت مسمومیت غذایی می رود.\n" +
                                "علامت دیگری که می تواند شک به مسمومیت را برانگیزاند، کاهش سطح هوشیاری، تشنج و بی قراری شدید یعنی علائم عصبی ناگهانی و بدون دلیل خاص است. \n" +
                                "هر وقت ریتم قلبی فردی ناگهان تغییر کند و بدون این که سابقه ابتلا به بیماری قلبی داشته باشد، دچار علائم قلبی- عروقی شود هم می توان به مسمومیت شک کرد. به طور کلی اگر فردی سابقه بیماری نداشته باشد و ناگهان دچار علائمی شود، حتما باید مسمومیت به عنوان یکی از تشخیص ها مطرح شود.\n" +
                                "با فرد مسموم چه کنیم؟\n" +
                                "اگر با فردی که شک دارید مسموم شده برخورد داشتید، تنها اقدامی که باید انجام دهید، تماس با اوژانس (شماره 115) تا فرد به اولین مرکز درمانی رسانده شود.\n" +
                                "موضوع اقدام در مواقعی که واقعا مطمئن باشیم کسی مسموم است با وقتی که راجع به این مساله شک داریم، متفاوت است وقتی به این موضوع شک داریم به هیچ وجه نباید به بیمار شیر، اب و مایعی دیگر بدهیم، ولی اگر می دانیم صددرصد مسموم شده، ولی نمی دانیم ناشی از مصرف چه ماده ای بوده، باید قبل از هر مداخله ای با شماره 1490، مرکز اطلاع رسانی داروها و سموم تماس بگیریم.\n" +
                                "کودکان و مسمومیت\n" +
                                "کودکان زیر 5سال، پرخطرترین گروه سنی از نظر بروز مسمومیت هستند. برخلاف بزرگسالان که مسمومیت ها در خیلی موارد عمدی است در کودکان همیشه مسمومیت ها اتفاقی و بیشتر ناشی از سهل انگاری بزرگسالان است. کودکان خردسال ممکن است هر چیزی را به دهان ببرند. این عمل بخشی از آموزش و درک این گروه سنی از محیط اطرافشان است در واقع کودکان نوپا بیشتر از همه حس ها از حس چشایی استفاده می کنند. آنها به طور معمول هر چیز را به دهان می برند تا بفهمند ان چیز چیست. این عمل زمینه ساز بروز مسمومیت است، به همیت دلیل والدین باید مطمئن باشند که کودکان به مواد سمی دسترسی ندارند.\n" +
                                "عمده ترین موارد مسمومیت در کودکان در اثر خوردن داروها،\n" +
                                " مواد شیمیایی و محصولات خانگی مانند مواد آرایشی بهداشتی\n" +
                                "، فرآورده های شوینده، سفید کننده و لوله بازکن، لاک پاک کن استون) و گیاهان آپارتمانی سمی بوده است. برای همین همواره توصیه می شود در هنگام استفاده از محصولات شیمیایی وپاک کننده اگر چنانچه مجبور شدید به زنگ درب ورودی و یا تلفن جواب دهید، هرگز از کودک خود چشم برندارید. مسمومیت اتفاقی با نفت یکی از مواردی است که در کودکان دیده می شود . مسمومیت در اثر بلع نفت در کودکان بسیار خطرناک است. در صورت بلع نفت توسط کودک هر چه سریع تر او را به نزدیک ترین مرکز درمانی منتقل نمایید. برای جلوگیری از وقوع چنین اتفاقاتی، موادی مانند نفت و بنزین را باید در ظرف اصلی آنها نگهداری کرد و از ریختن این مواد داخل ظروف مربوط به فرآورده های خوراکی و نوشیدنی مثل نوشابه جدا پرهیز کرد.\n" +
                                "1-به کودکان بیاموزید چیزی ننوشند یا نخورند مگر این که با اجازه بزرگسالان باشد.\n" +
                                "2-داروهای خود را مقابل چشم کودکان نخورید، چرا که کودکان از رفتار بزرگسالان تقلید می کنند و ممکن است دور از چشم والدین داروها را به دهان ببرند.\n" +
                                "3-زمانی که شما در منزل نیستید و کودک را به فرد دیگری می سپارید، کودکان در معرض بیشترین خطر مسمومیت قرار دارند.\n" +
                                "4-اگر به کودک خود دارو می دهید به او تفهیم کنید که این دارو است و از کلماتی مثل آبنبات، شکلات یا خوراکی استفاده نکنید.\n" +
                                "5-همیشه پس از استفاده از مواد شیمیایی سریعا درب آن را ببندید،ولی بدانید هیچ ظرف دربسته ای از دسترسی کودکان در امان نیست.\n" +
                                "6-مواد شیمیایی، شوینده و سفید کننده را در منزل در کمدهای دارای قفل و دور از دید و دسترس کودکان قرار دهید. همچنین درب کمدهایی که در ان مواد شیمیایی خطرناک را نگه می دارید با قفل با طناب محکم نمایید.\n" +
                                "7-گل ها و گیاهان آپارتمانی را دور از دسترس کودکان قرار دهید\n" +
                                " و هنگام بازی کودکان در فضای باز مراقب آنها باشید تا توسط گلها \n" +
                                "و گیاهان سمی، مسموم نشوند.\n" +
                                "8-داروهای مصرفی را دور از دسترس کودکان نگه دارید.\n");
                        transaction5.replace(R.id.frame_layout, fragment5);
                        transaction5.addToBackStack(null);
                        transaction5.commit();
                        break;

                }
            }
        });

        showBackButton();

        return v;
    }

    public void showBackButton() {
        if (getActivity() instanceof MainActivity) {
            ((MainActivity) getActivity()).getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        }
    }

}
