package com.example.nazanin.hospitalapp.Illness;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentTransaction;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.Button;
import android.widget.ListView;

import com.example.nazanin.hospitalapp.MainActivity;
import com.example.nazanin.hospitalapp.R;


public class IllnessDakheli extends Fragment {


    private ListView listDakheli;
    private String[] list={"آسم","انسداد مزمن ریوی","پنومونی","خونریزی گوارشی","کم خونی - فقر آهن","گاستریت"};

    public static IllnessEye newInstance() {
        IllnessEye fragment = new IllnessEye();

        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_illness_dakheli, container, false);
        listDakheli= v.findViewById(R.id.listDakheli);
        ArrayAdapter<String> adapter=new ArrayAdapter<>(getContext(),R.layout.list_textview,list);
        listDakheli.setAdapter(adapter);
        listDakheli.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {
                switch (position){
                    case 0:
                        FragmentTransaction transaction = getFragmentManager().beginTransaction();
                        InfoIllness fragment = new InfoIllness();
                        fragment.SetTitle("آسم");
                        fragment.SetBody("آسم بیماری شایعی است که راههای هوایی را درگیر می کند در این بیماری لوله های تنفسی در ریه ها بطور قابل برگشت تنگ می شود .\n" +
                                "انواع آسم :\n" +
                                "1 : حساسیتی (که معمولاً در دوران کودکی شروع می شود و نسبت\n" +
                                "به گردوغبار،گرده گیاهان و حشرات ، دود دخانیات و غذا و دارو حساس است )\n" +
                                "2 : آسم غیر حساسیتی ( در اثر اختلالات داخلی – مانند سرماخوردگی ، عفونت دستگاه تنفسی فوقانی یا ورزش تشدید می شود )\n" +
                                "3 : آسم ترکیبی ( ترکیب از نوع حساسیتی و غیر حساسیتی )\n" +
                                "علائم و نشانه های بیماری آسم چیست ؟\n" +
                                "علائم و نشانه های بیماری آسم هم از نظر شدت و هم از نظر شکل علائم در بین افراد متفاوت است ممکن است شما فقط در هنگام ورزش دچار حملات آسمی شده یا همیشه در خطر این حملات باشید.\n" +
                                "  علائم شامل موارد زیر می باشد .\n" +
                                "•\tسرفه ( بخصوص در شب و اوایل صبح )\n" +
                                "•\tخس خس سینه \n" +
                                "•\tاحساس فشار روی قفسه سینه\n" +
                                "•\tتنگی نفس\n" +
                                "•\tمشکل در خوابیدن بدلیل تنگی نفس\n" +
                                "•\tصدای سوت یا خس خس به هنگام بیرون دادن هوا ( بازدم )\n" +
                                "•\tآسم بسته به شرایط بیماری و درجه تنگی راه تنفسی درجات ضعیف ،  متوسط تا شدید دارد آسم ممکن است در هر سنی شروع شود ولی اغلب شروع آن در دوران کودکی می باشد .\n" +
                                "علائم حمله شدید آسم :\n" +
                                "•\tتعریق\n" +
                                "•\tخستگی شدید\n" +
                                "•\tطپش قلب\n" +
                                "•\tناتوانی در صحبت کردن\n" +
                                "•\tگیجی\n" +
                                "\n" +
                                "چه عواملی در بروز آسم موثرند :\n" +
                                "•\tوراثت\n" +
                                "•\tغذا ها - شکلات ، تخم مرغ ، آجیل ( بادام زمینی ) ، ادویه جات\n" +
                                "•\tگرده گیاهان\n" +
                                "•\tپرها و پشم موجود در بالش ها و پرز فرش\n" +
                                "•\tحیوانات ، سگ ، گربه و اسب (موی این حیوانات ) ، پر پرندگان\n" +
                                "•\tهوای آلوده و پر دود و هوای سرد\n" +
                                "•\tفعالیت جسمانی در آسم های ناشی از ورزش\n" +
                                "•\tبرخی از داروهای خاص مثل ( آسپرین ، بروفن ، ناپروکسن ، ایندرال )\n" +
                                "•\tنارحتی های روحی و استرس ، هیجانات\n" +
                                "•\tمصرف تنباکو و سیگار و پودرهای شوینده ، عطرها ، اسپری مو\n" +
                                "•\tعفونت های تنفسی ( سرماخوردگی )\n" +
                                "•\tدر طول عادت ماهیانه در بعضی از خانم ها\n" +
                                "\n" +
                                "چه عواملی خطر آسم را افزایش می دهند :\n" +
                                "•\tابتلا حداقل یکی از بستگان خونی به آسم\n" +
                                "•\tچاق بودن و اضافه وزن\n" +
                                "•\tسیگار کشیدن یا قرار گرفتن در معرض دود سیگار\n" +
                                "•\tفرزندان مادرانی که در هنگام بارداری سیگار می کشیدن\n" +
                                "•\tقرار گرفتن در برابر آلودگی های شغلی و مواد شیمیایی مورد استفاده در برخی از شغل ها \n" +
                                "(گردغبار فلزات و پنبه )\n" +
                                "   راههای  تشخیص آسم چیست :\n" +
                                "معمولاً پزشک بیماری را به کمک علائم آن تشخیص می دهد .\n" +
                                "ولی گاهی از روشهای تشخیصی دیگر مانند اسپیرومتری نیز استفاده می کند .\n" +
                                "از دیگر روشهای تشخیص داشتن سابقه خانوادگی و گرفتن تاریخچه ، عوامل محیطی و شغلی\n" +
                                "بررسی خون و خلط در حملات شدید آسم ، بررسی گازهای خون شریانی ، پالس اکسیمتری ( دستگاهی که به انگشت متصل شده و درصد اکسیژن در خون شما را نشان می دهد .)\n" +
                                "\n" +
                                "\n" +
                                "عوارض بیماری آسم چیست  :\n" +
                                "بیماری آسم می تواند باعث مشکل در خوابیدن کار و تفریح شما گردد . بعلاوه آسم می تواند باعث بستری شدن پی در پی و طولانی مدت در بیمارستان شده و همچنین داروهای درمان آسم در بلند مدت می تواند اثراتی بر روی سلامتی بگذارد .\n" +
                                "\n" +
                                "عوارض خطرناکی که آسم بجا می گذارد\n" +
                                " شامل ایست تنفسی ، آسم وضعیتی ، پنومونی \n" +
                                "درمان :\n" +
                                "•\tدرمان طبی و دارویی\n" +
                                "•\tاکسیژن تراپی \n" +
                                "•\tاستفاده از بخور یا نبولایزر\n" +
                                "•\tمایعات خوراکی یا وریدی برای حفظ هیدراتاسیون ( کمبود حجم مایعات در بدن )\n" +
                                "درمان دارویی شامل دونوع دارو می باشد :\n" +
                                "1 : داروهای گشاد کننده راه هوایی : داروهای هستند که با انقباض (جمع کردن) عضلات باعث شل شدن مجاری هوایی شده و از این راه سبب کاهش یا رفع علائم آسم بویژه در هنگام حمله آسم می شوند مثل اسپری سالبوتامول ، اسپری اترونت ، تئوفیلین ، آمینوفیلین\n" +
                                "2 : داروهای ضد التهاب غیر استروئیدی : داروهای هستند که سبب کاهش تورم و التهاب مجاری هوایی می شوند و از این راه علائم آسم کاهش می یابد مثل اسپری بکلومتازون ، اسپری فلوتیکازون ، پردنیزولون ، هیدروکورتیزون\n" +
                                "\n" +
                                "اصولی که باید توسط بیمار رعایت شود :\n" +
                                "•\tمصرف بموقع دارو\n" +
                                "•\tمصرف 6 تا 8 لیوان مایعات در روز تا از سفت شدن ترشحات راههای هوایی جلوگیری می شود و مانع ابتلا به عفونت هاي حاد مي شود  .\n" +
                                "•\tاز ایجاد عفونت و سرماخوردگی پیشگری کنید در اول پاییز با پزشک خود در مورد تزریق واکسن انفولانزا مشورت نماييد .\n" +
                                "•\tبرخی از اسپری ها بطور مثال بکلو متازون باعث عفونهای قارچی دهان و حلق می شود به همین دلیل برای کاهش عفونت های قارچی بلافاصله بعد از اسپری زدن دهان خود را آب بکشید .\n" +
                                "•\tشستشوی ملافه و پتو هفته ای یکبار با آب داغ و خشک کردن آن با آفتاب\n" +
                                "•\tعدم استفاده از فرش های پرزدار در اتاق خواب\n" +
                                "•\tپوشش مناسب بالش و تشک\n" +
                                "•\tشستشوی پرده ها و اسباب بازیهای پشمی\n" +
                                "•\tعدم تماس و نگهداری حیوانات خانگی\n" +
                                "•\tعدم استعمال دخانیات\n" +
                                "•\tتهویه مناسب در محل زندگی\n" +
                                "•\tاز آنجا که حمله هاي آسم در شب بيشتر است نحوه خواب و ايجاد شرايط مناسب هنگام خواب اهميت زيادي دارد و بهتر است هنگام خواب از قرار گرفتن در هواي خشک خودداري شود و در اتاق خواب بخور سرد گذاشته شود . \n" +
                                "•\tعدم استفاده از مواد غذایی محرک\n" +
                                "•\tورزش ، محرک شایعی برای آسم می باشد قبل از ورزش از داروهای گشاد کننده برونش استفاده نمائید\n" +
                                "در صورت بروز موارد زیر فوری به پزشک یا اورژانس مراجعه کنید .\n" +
                                "•\tخس خس و سرفه های شبانه\n" +
                                "•\tفشار در قفسه سینه که شما را دچار مشکل کرده باشد .\n" +
                                "•\tبیش از همیشه نیاز به اسپری داشته باشید .\n" +
                                "•\tاگر به دلیل تنگی نفس در راه رفتن یا صحبت کردن با مشکل روبرو می شوید .\n" +
                                "•\tکبودی لب ها و صورت و نوک انگشتان و ضربان قلب بالا اضطراب بدلیل تنگی نفس از علائم\n" +
                                "اورژانس می باشد که نیاز فوری به درمان دارند .\n");
                        transaction.replace(R.id.frame_layout, fragment);
                        transaction.addToBackStack(null);
                        transaction.commit();
                        break;

                    case 1:
                        FragmentTransaction transaction1 = getFragmentManager().beginTransaction();
                        InfoIllness fragment1 = new InfoIllness();
                        fragment1.SetTitle("انسداد مزمن ریوی COPD");
                        fragment1.SetBody("کار ريه ها چيست ؟\n" +
                                "•\tريه ها در حين انجام عمل دم ، اکسيژن موجود در هوا را مي گيرند و وارد خون مي کنند ، سپس خون با جريان خود اکسيژن را به بخش هاي مختلف بدن مي رسانند . \n" +
                                "•\tدر عين حال ، خون دي اکسيد کربن را جمع مي کند و به ريه ها بر مي گرداند و اين دي اکسيد کربن همراه هواي بازدمي از ريه ها خارج مي شود . \n" +
                                "•\tهوا از طريق يک سري لوله هاي شاخه اي به ريه وارد و از آن خارج مي شود . که به اين لوله ها ، لوله هاي برونشيي گفته مي شود . \n" +
                                "\n" +
                                "یک بیماری ریوی است که در جریان هوایی که شما تنفس می کنید بخصوص در هنگام باز دم دچار محدودیت و کاهش سرعت می شود و همراه با آن ممکن است یک واکنش التهابی غیرطبیعی در پاسخ به ذرات مضر و گازها نیز وجود داشته باشد. این بیماری در هر دو جنس زن و مرد دیده می شود معمولاً در سنین میانسالی علائم بیماری ظاهر می شود و با افزایش سن نیز بیشتر می شود.\n" +
                                "\n" +
                                "علائم بیماری چیست؟\n" +
                                "•\tسرفه\n" +
                                "•\tتولید خلط\n" +
                                "•\tتنگی نفس شدید عمدتاً در حالت فعالیت\n" +
                                "•\tتنفسهای تند و کوتاه\n" +
                                "•\tصداهای اضافی ریه مثل ویز\n" +
                                "•\tتنگی نفس حین غذا خوردن\n" +
                                " \tاین بیماری بر فعالیتهای روزانه شما تأثیر گذاشته و فعالیتهای شما را کم می کند همچنین کاهش تنفسی منجر به افزایش مصرف انرژی در نتیجه کاهش وزن بیمار می گردد.\n" +
                                "این بیماری پیشرونده است و بتدریج تا حد اختلال تنفسی در حین استراحت و نیاز دائم به اکسیژن پیشرفت می کند.\n" +
                                "\n" +
                                "روشهای تشخیص بیماری چیست؟\n" +
                                "•\tتاریخچه بیماری و شرح حال بیمار\n" +
                                "•\tتستهای عملکرد ریه مانند اسپیرومتری، عکس قفسه سینه\n" +
                                "•\tسی تی اسکن از ریه ها\n" +
                                "•\tآزمایش های خونی مانند گازهای خونی شریانی (ABG)\n" +
                                "عواملی که در ایجاد بیماری نقش دارند؟\n" +
                                "•\tمصرف سیگار که علت 80 تا 90 درصد (موارد) بیماری می باشد (حتی افراد سیگاری که در حال حاضر سیگار نمی کشند)\n" +
                                "•\tسن\n" +
                                "•\tسابقه خانوادگی\n" +
                                "•\tجنس مذکر\n" +
                                "•\tسابقه عفونتهای تنفسی درمان نشده در کودکی\n" +
                                "•\tوضعیت اقتصادی پایین\n" +
                                "•\tآلودگی هوا\n" +
                                "•\tتماس های شغلی (زغال سنگ، پنبه، غلات)\n" +
                                "•\tوزن بالا\n" +
                                "•\tنقص مادرزادی (کمبود آنزیم آلفا 1 آنتی تریپسین)\n" +
                                "عوارض بیماری چیست؟\n" +
                                "مهمترین عارضه بیماری نارسایی تنفسی و ذات الریه (پنومونی) می باشد.\n" +
                                "اقدامات درمانی برای بیماران COPD\n" +
                                "•\tبرای کنترل کردن علائم بیماری باید درمان خود را ادامه دهید. درمان باید مدام العمر باشد مهمترین چیز ترک سیگار، مؤثرترین اقدام برای پیشگیری و کند کردن بیماری می باشد (ترک سیگار و مصرف اکسیژن که به تجویز پزشک صورت می گیرد طول عمر شما را زیادتر خواهد کرد)\n" +
                                "•\tفعالیتهای خود را بتدریج شروع کرده و هنگامی که احساس خستگی می کنید و تنگی نفس احساس کردید استراحت کنید.\n" +
                                "•\tاگر افزایش وزن دارید کم کنید تا به وزن مناسب برسید.\n" +
                                "•\tاگر کاهش وزن داشتید و مقدار زیادی وزن از دست داده اید باید غذای پرکالری دریافت کنید تا به وزن مناسب دست یابید.\n" +
                                "•\tمایعات بنوشید نوشیدن مایعات باعث رقیق شدن خلط و ترشحات می شود و تخلیه ترشحات براحتی صورت می گیرد سرفه مؤثر نیز خود یاعث تخلیه ترشحات می شود\n" +
                                "•\tاسترس و اضطراب خود را کنترل کنید برای مثال عوامل استرس زا میتواند دوره های سرفه را افزایش دهد.\n" +
                                "•\tداروهایتان را مثل اسپری ها، آنتی بیوتیک ها و داروهای خوراکی مثل کورتن ها را مطابق آنچه پزشک براي شما دستور داده استفاده کنید.\n" +
                                "\n" +
                                "•\tاکسیژن درمانی: اکسیژن را به مقدار توصیه شده که 1 تا 2 لیتر در دقیقه می باشد دریافت کنید از اکسیژن با غلظت بالا اجتناب کنید در ضمن اکسیژن گازی است که به سرعت آتش می گیرد بنابراین بازگذاشتن آن خطرناک است برای جلوگیری از خشکی مخاط دهان و بینی در قسمت مرطوب کننده دستگاه اکسیژن تا خط نشانه آب ریخته شود.\n" +
                                "•\tواکسیناسیون (آنفلوانزا) نیز کمک به حفظ سلامتی شما می کند چون سرماخوردگی و آنفلوانزا می تواند ریه های شما را درگیر کرده و تنفس برایتان سخت گردد.\n" +
                                "•\tمراجعات دوره ای منظم به مطب یا درمانگاه جهت بررسی ریه داشته باشید.\n" +
                                "•\tانجام تمرینات ورزشی ساده را شروع کنید در هوای مناسب نه گرم نه سرد تا عضلات تنفسی شما قوی شود.\n" +
                                "•\tفعالیت روزانه خود را انجام دهید و سعی کنید روزانه فعالیت هایتان را افزایش دهید.\n" +
                                "•\tدر مسافرت های هوایی در مورد نیاز به اکسیژن اضافی با پزشک خود مشورت کنید.\n" +
                                "•\tاز مخدرها ومسکن ها استفاده نکنید.\n" +
                                "•\tخواب و استراحت کافی داشته باشید.\n" +
                                "•\tاتاق شما تهویه مناسب داشته باشد.\n" +
                                "•\tبرای حفظ رطوبت محیط از بخور استفاده کنید.\n" +
                                "•\tبرای بهبود وضعیت تنفسی خود لازم است دم آهسته همراه با بازدم طولانی در وضعیت خم شده به جلو با لبهای غنچه انجام دهید.\n" +
                                "•\tاز قرار گرفتن در گرما و سرمای زیاد اجتناب کنید زیرا می تواند باعث افزایش خلط و تنگی نفس شما شود \n" +
                                "•\tاز افراد سرماخورده یا مبتلا به هر نوع عفونت بخصوص عفونت تنفسی فاصله بگیرید.\n" +
                                "•\tاز ماسک صورت و شال گردن چنانچه در محیط سرد قرار می گیرد استفاده کنید.\n" +
                                "در صورت بروز این علائم پزشک خود را مطلع سازید.\n" +
                                "تغییر رنگ و تغییر در مقدار خلط، افزایش سرفه، افزایش خستگی، افزایش تنگی نفس، افزایش وزن، ورم اندام ها و تب \n" +
                                "تغذیه در بیماران COPD\n" +
                                "•\tوضعیت تغذیه ای در این بیماران بسیار مهم و آثارش در شدت علائم، میزان ناتوانی و پیش آگهی منعکس می شود.\n" +
                                "•\tمواد پرکالری و پر پروتئین مصرف کنید تعداد وعده های غذایی خود را افزایش داده ولی حجم مصرفی را در هر وعده کاهش دهید.\n" +
                                "•\tغذاهای نفاخ (کلم، بادمجان و...) مصرف نکنید.\n" +
                                "•\tاز مصرف چای پررنگ ، قهوه، الکل و نوشابه ، ادویه و نمک و سیگار و قلیان خودداری کنید.\n" +
                                "•\tمیوه و سبزیجات بیشتر مصرف کنید.\n" +
                                "•\tمایعات بیشتر بنوشید.\n" +
                                "•\tرژیم غذایی شما سرشار از ویتامین های گروه ب(شامل شیر، تخم مرغ، ماهی ، گوشت ، غلات ، جوانه گندم ) ویتامین)k جوانه گندم ، اسفناج ، گوجه فرنگی ، گل کلم ، ماهی )، ویتامین C   ( مرکبات و گوجه فرنگی .... )، ویتامین )  Aهویج ، شیر ، گوجه فرنگی ، تخم مرغ )و اسید فولیک ( تخم مرغ ، گوشت ، شبزیجات ) باشد.\n" +
                                "•\tدر افرادی که مدفوع چرب دارند توصیه می شود ویتامین A و D ( روغن کنجد ، کره ، ماهی ، تخم مرغ ) و   E ( جوانه گندم ، ماهی، زیتون ) مصرف کنند.\n" +
                                "•\tرعایت بهد اشت دهان برای شما ضروری است.\n");
                        transaction1.replace(R.id.frame_layout, fragment1);
                        transaction1.addToBackStack(null);
                        transaction1.commit();
                        break;

                    case 2:
                        FragmentTransaction transaction2 = getFragmentManager().beginTransaction();
                        InfoIllness fragment2 = new InfoIllness();
                        fragment2.SetTitle("پنومونی");
                        fragment2.SetBody("پنومونی (ذات الریه) یک عفونت تنفسی تحتانی شایع است در اثر عفونت ریه ها ایجاد می شود عفونت بیشتر کیسه های هوایی موجود در ریه وبه میزان کمتری مجاری هوایی انتقال دهنده هوا به ریه ها را درگیر می کند. بخش هایی از ریه که دچار عفونت شده است توسط مایع پر می شود این مایع حاوی گلبولهای سفید خون می باشد که با عفونت مقابله می کند \n" +
                                "بینی انسان برای محافظت از میکروبها ، گردو غیار و دیگر عوامل عفونی از مخاط و مو پوشیده شده است هنگامی که مخاط بینی قادر به جلوگیری از چنین اتفاقی نباشد این عوامل عفونی به قسمت هاي داخلی وارد شده و موجب بیماری می شود.\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "علل و منشاء پنومونی از کجاست؟\n" +
                                "پنومونی توسط جرم ها (ارگانیسم های کوچکی که می توانند منجر به بیماری شوند) ایجاد شود. ویروسها، باکتریها، قارچ ها، از جرم های ایجاد کننده پنومونی هستند. این جرم ها معمولاً در ریه افراد سالم وجود ندارد. گاهی اوقات جرم ها توسط جریان خون به ریه ها می رسند ولی اغلب توسط قطرات ریز آب موجود در هوای تنفسی (قطرات تنفسی) به ریه ها منتقل می گردند. منبع این جرم ها افرادی هستند که با سرفه و عطسه کردن باعث انتشار جرم های موجود در قطرات تنفسی خود می شوند.\n" +
                                "\n" +
                                "انواع پنومونی\n" +
                                "پنومونی اکتسابی: از مراکز درمانی (افرادی که مکررا در بیمارستان بستری میشوند. و روشهای مانند پی گیری معاینات ، دیالیز و غیره دارند بیشتر در معرض خطر ابتلا به این نوع پنومونی که به سختی درمان می شود، هستند.\n" +
                                "پنومونی آسپیراسیون : هنگامی که مواد جامد و یا مایع که به طور طبیعی باید از طریق مری عبور کند تصادفاً به ریه ها وارد می شوند خطر ابتلا به این نوع از پنومونی را افزایش می دهد برخی داروها و الکل نیز می تواند باعث افزایش خطر ابتلا به پنومونی آسپراسیون شود.\n" +
                                "•\tچه کسانی مبتلا به پنومونی می شوند؟\n" +
                                "هر کسی می تواند به پنومونی مبتلا شود حتی افراد سالم هم ممکن است به این بیماری مبتلا شوند. با این وجود، وجود جرم ها بیشتر به ایجاد عفونت در افراد با نقص ایمنی که دفاع طبیعی بدن در آنها کاهش یافته تمایل دارند.\n" +
                                "افراد در سنین بسیار بالا و بسیار پایین (نوزادان و افراد مسن) که ریه ها و سیستم دفاعی ضعیف تری دارند بنابراین پنومونی در سنین ابتدایی وانتهای زندگی بیشتر دیده می شود.\n" +
                                "سایر مواردی که می توان سیستم دفاعی ریه های را تضعیف سازد شامل سیگار، تنباکو، عفونتهای ویروسی که راههای تنفسی را درگیر می کند (مانند سرماخوردگی معمولی) و سایر عفونت های ویروسی (ایدز= HIV) می باشد.\n" +
                                "بعضی داروها هم باعث ضعیف شدن سیستم ایمنی می شود مانند داروهایی که در درمان کانسر (سرطان) کاربرد دارند.\n" +
                                "علل جراحی هم می تواند باعث آسیب پذیر شدن افراد شود به همین علت است که پنومونی در بیمارانی که قبلاً به دلایل دیگر در بیمارستان بستری بودند پیشرفت می کند.\n" +
                                "•\tعلائم و نشانه های ابتلا به پنومونی چیست؟\n" +
                                "علائمی که تقریباً بطور گسترده در تمام بیماران مبتلا به ذات الریه مشاهده می شود \n" +
                                "علائم اولیه شامل:\n" +
                                "•\tتب: اغلب با درجه بالا امّا درجه پایین تر نیز دیده می شود.\n" +
                                "•\tلرز\n" +
                                "•\tسرفه مداوم\n" +
                                "•\tاشکال در تنفس\n" +
                                "•\tاز دست دادن اشتها\n" +
                                "•\tضعف و بی حالی\n" +
                                "•\tدرد بیش از حد قفسه سینه\n" +
                                "•\tافزایش تولید عرق\n" +
                                "علائم پنومونی ناشی از باکتری معمولاً سریع و شامل:\n" +
                                "•\tسرفه خلط دار به رنگ زرد یا سبز آغشته به خون می باشد.\n" +
                                "•\tتب\n" +
                                "•\tتعریق بیش از حد\n" +
                                "•\tتنفس سریع و احساس تنگی نفس\n" +
                                "•\tتکان خوردن، دندان غروچه و لرز\n" +
                                "•\tدرد قفسه سینه که اغلب با سرفه و تنفس بدتر می شود\n" +
                                "•\tضربان قلب سریع\n" +
                                "•\tاحساس خستگی و ضعف زیاد\n" +
                                "•\tتهوع و استفراغ و اسهال\n" +
                                "\n" +
                                "علائم پنومونی ناشی از ویروس که به آرامی ظاهر می شوند و اغلب بد نیستند شامل:\n" +
                                "•\tبی حالی\n" +
                                "•\tتب با درجه بالا\n" +
                                "•\tتنگی نفس و در کنار آن سرفه خشک\n" +
                                "•\tدرد عضلانی\n" +
                                "راههای تخشیص پنومونی چیست؟\n" +
                                "•\tبر اساس تاریخچه (بخصوص یک عفونت اخیر در مجاری تنفسی)\n" +
                                "•\tمعاینه فیزیکی توسط پزشک\n" +
                                "•\tعکس برداری از قفسه سینه \n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "\n" +
                                "•\tکشت خون\n" +
                                "•\tآزمایشات خلط\n" +
                                "درمان پنومونی چیست؟\n" +
                                "درمان اصلی پنومونی آنتی بیوتیک صحیح بر اساس جواب کشت می باشد و بیشتر افراد با استراحت در منزل حال عمومی بهتری پیدا می کنند اما افراد با بیماری شدیدتر باید در بیمارستان بستری شوند تا سطح اکسیژن خون آنها تحت نظر باشد و مایعات بصورت سرم برای آنها تجویز گردد.\n" +
                                "با وجود اینکه بیشتر افراد حال عمومی بهتری پیدا می کنند اگر بیماری بسیار شدید باشد حتی با بهترین شیوه درمان منجر به وخیم شدن حال عمومی بیمار می شود.\n" +
                                "سایر داروها: ضد تب ها، تسکین دهنده های درد، ضد سرفه ها و خلط آور\n" +
                                "•\tدر صورت ابتلا به پنومونی چه اقداماتی انجام دهیم؟\n" +
                                "•\tداروهایی که پزشکان تجویر می کنند بموقع مصرف نمائید. و دوره درمانی با آنتی بیوتیک را کامل کنید.\n" +
                                "•\tاز دستگاه بخور برای مرطوب کردن هوای استشاقی استفاده کنید.\n" +
                                "•\tبیشتر علائم مانند درد قفسه سینه و تب در عرض چند روز بعد از درمان تخفیف می یابد سرفه معمولاً 2 تا 3 هفته طول می کشد تا برطرف شود ولی خستگی و ضعف ممکن است ماه ها زمان ببرد تا به طور کامل برطرف گردد.\n" +
                                "•\tاگر علائم شما در حد انتظار بهبود نیافته و یا چنانچه بیماری عود کرد به پزشک خود جهت بررسی بیشتر مراجعه کنید.\n" +
                                "•\tسرفه کنید تا ترشحات ریوی خارج گردد.\n" +
                                "•\tبهداشت دهان خود را رعایت کنید.\n" +
                                "•\tاز سیگار کشیدن و مصرف الکل خودداری کنید.\n" +
                                "•\tاز خوابیدن طولانی در یک وضعیت خودداری کنید.\n" +
                                "•\tبهداشت فردی خود را جهت پیشگیری از عفونت رعایت کنید هنگام سرفه از دستمال یکبار مصرف استفاده کنید و دستهای خود را با آب و صابون بشوئید.\n" +
                                "•\tبه علت خستگی و تنگی نفس اشتهای شما کاهش می یابد اگر بیماری قلبی ندارید و طبق نظر پزشک مایعات فراوان حداقل 6 تا 8 لیوان آب بنوشید زیرا مصرف مایعات باعث رقیق شدن ترشحات شده و به خروج آن کمک می کند.\n" +
                                "•\tبرای افزایش ایمنی از مواد غذایی حاوی ویتامین C (پرتقال و نارنگی) و انواع مغزها استفاده کنید.\n" +
                                "•\tواکسیناسیون در افراد در معرض خطر توصیه می شود (افراد مسن) واکسن هایی که بیشتر توصیه به آن ها شده است آنفلولانزا و پنوموکوک می باشد\n" +
                                "•\tدر هوای آلوده از منزل خارج نشوید و هنگام بیرون رفتن از منزل لباس گرم و مناسب بپوشید\n" +
                                "•\tاز تماس با افراد مبتلا به سرماخوردگی خودداری کنید.\n" +
                                "•\tاز مصرف غذاهای تحریک کننده مانند غذای چرب، سرخ شده و پر ادویه خودداری کنید.\n" +
                                "•\tاز مصرف مواد محرک مانند اسپری خوشبو کننده، وایتکس و شیشه شوی خودداری کنید.\n" +
                                "•\tاز فعالیت بیش از حد در طی دوره بهبودی خودداری کنید و در بین فعالیت دوره هایی از استراحت داشته باشید.\n" +
                                "•\tدر تاریخ معین جهت پیگیری درمان به پزشک مراجعه کنید.\n");
                        transaction2.replace(R.id.frame_layout, fragment2);
                        transaction2.addToBackStack(null);
                        transaction2.commit();
                        break;

                    case 3:
                        FragmentTransaction transaction3 = getFragmentManager().beginTransaction();
                        InfoIllness fragment3 = new InfoIllness();
                        fragment3.SetTitle("خونريزي گوارشي");
                        fragment3.SetBody("خونريزي گوارشي در اثر صدمه و آسيب موضعي ايجاد ميشود و موجب زخم مخاط دستگاه گوارش ميگردد. خونريزيهاي گوارشي به دو دسته با منشاء فوقاني و تحتاني تقسيم ميشوند. \n" +
                                "علل شايع خونريزي گوارشي : \n" +
                                " \tزخم هاي معده و دوازده\n" +
                                " \tواريس هاي گوارشي \n" +
                                " \tآسيب هاي مخاط معده و اثني عشر\n" +
                                " \tبيماريهاي التهابي مري و بد خيمي ها \n" +
                                " \tبيماريهاي التهابي مري و بد خيمي ها \n" +
                                " \tسوء مصرف از آسپرين و داروهاي ضد التهاب غير استروئيدي (ايبوپروفن ، ناپروکسن ، ديکلوفناک ، پيروکسيکام ، ايندومايسين ، مفناميک اسيد ، سيلوکسيب و نيکوتين ) \n" +
                                " \tناهنجاري هاي خوني \n" +
                                " \tتروما و ضربه \n" +
                                " \tعفونت هليکوباکترپيلوري\n" +
                                "علائم خونريزي گوارشي  \n" +
                                " \tاستفراغ خون روشن با موادي با زمينه قهوه اي که نشانه خونريزي قسمت فوقاني دستگاه گوارش است .\n" +
                                " \tمدفوع قيري و بد بو ، اين نوع مدفوع که ملنا نام دارد بر وجود خون حداقل به مدت 14 ساعت در دستگاه گوارش دلالت دارد . \n" +
                                " \tخون قرمز و روشن در مدفوع که بيشتر مربوط به خونريزي قسمت تحتاني گوارش است . \n" +
                                " \tخونريزي مخفي دستگاه گوارش که در آزمايشات اختصاصي مربوط به مدفوع تشخيص داده مي شود . که با علائم کاهش وزن و کم خوني مزمن همراه است . \n" +
                                " \tعلائم کم خوني مثل خستگي ، سياهي چشم ، درد قفسه سينه يا تنگي نفس ، افت فشار خون \n" +
                                " \tدر برخي موارد شوک به دليل از دست دادن \n" +
                                "شديد خون ( بيش از يک ليتر خون در 24 ساعت)\n" +
                                "\n" +
                                "درمان\n" +
                                "زماني که بيمار با خونريزي گوارشي مراجعه مي کند پس از متعادل کردن علائم حياتي بيمار از طريق مايع درماني مناسب ( سرم تزريقي) براي بيمار لوله معده گذاشته شده ، شستشوي معده انجام مي شود و وضعيت شدت خونريزي بيمار تخمين زده ميشود . گاه به دليل عدم توقف خونريزي جرحي اورژانسي ضروري است براي تشخيص يا درمان خونريزي بسته به منشاء آن اندوسکوپي يا کلونوسکوپي انجام مي شود.\n" +
                                "آموزش هاي لازم به بيمار \n" +
                                "\uF076\tدارو ها را طبق دستور پزشک معالج مصرف کنيد . \n" +
                                "\uF076\tقرص هاي جويدني را کاملا بجويد \n" +
                                "\uF076\tقبل از مصرف شربتهاي آنتي اسيد ، آنها را به خوبي تکان دهيد . \n" +
                                "\uF076\tاز سرفه کردن ، عطسه کردن ، بلند کردن و فشار در حين دفع مدفوع و استفراغ پرهيز کنيد . \n" +
                                "\uF076\tاز مصرف داروهاي مثل آسپرين و داروهاي ضد التهاب غير استيروئيدي ( ايبوپروفن، ناپروکسن ، ديکلوفنام اسيد پرهيز کنيد . \n" +
                                "\uF076\tاز انجام فعاليتهاي سنگين و قدرتي تا زماني که کم خوني شما جبران نشده است . خودداري کنيد . \n" +
                                "رژيم غذايي \n" +
                                "\uF0FC\tبيماراني که از زخم معده شاکي ميباشند بايد از مصرف غذاهاي آماده يا همان فست فود ها اجتناب کنند . \n" +
                                "\uF0FC\tمصرف ميان وعده هاي ناسالم همچون چيپس و پفک ف غذاهاي تند ، شود و پر ادويه را به حداقل برسانيد . \n" +
                                "\uF0FC\tاز مصرف چاي فراوان و پر رنگ بپرهيزيد و غذاهاي چرب نخوريد. \n" +
                                "\uF0FC\tسعي کنيد مقدار وعده هاي غذايي را افزايش ، اما حجم آنها را کاهش دهيد . \n" +
                                "\uF0FC\tاز خوردن سس گوجه فرنگي و ترشي اجتناب کنيد . \n" +
                                "\uF0FC\tعدم مصرف سيگار و ترک الکل از مواردي است که قابل توجه ميباشد .\n" +
                                "\uF0FC\tاز مصرف نوشابه هاي گازدار ، شکلات و تنقلات و غذاهاي چاشني دار اجتناب کنيد . \n" +
                                "\uF0FC\tدر بيماراني که علائم برگشت اسيد معده به داخل مري يا بازگشت غذا از معده به مري دارند لازم است از دراز کشيدن بلافاصله پس از غذا خودداري کرده و حتي الامکان بالاتنه را در هنگام خواب در موقعيت بالاتري از پائين تنه قرار دهند يا طرف پائين تخت ايشان در سطح پائين تري نسبت به قسمت بالاي تخت ( از سطح افق) قرار داشته باشد . \n" +
                                "\uF0FC\tبه ياد داشته باشيد هر زمان براي ساير مشکلات به پزشک مراجعه کرديد سابقه خونريزي گوراشي خود راب يان کنيد . \n");
                        transaction3.replace(R.id.frame_layout, fragment3);
                        transaction3.addToBackStack(null);
                        transaction3.commit();
                        break;

                    case 4:
                        FragmentTransaction transaction4 = getFragmentManager().beginTransaction();
                        InfoIllness fragment4 = new InfoIllness();
                        fragment4.SetTitle("کم خونی (آنمی) چیست؟ ");
                        fragment4.SetBody("کم خونی زمانی بروز می کند که گلبولهای قرمز خون کاهش می یابد، در واقع هموگلوبین که یک پروتئین در گلبول قرمز خون است کاهش می یابد. \n" +
                                "\uF0FC\tکم خونی به سطح هموگلوبین کمتر از 12 (گرم بر دسی لیتر)  در خانم ها و در آقایان کمتر از 13 (گرم بر دسی لیتر) می باشد که در نتیجه آن تحویل اکسیژن به بافت ها کاهش می یابد .\n" +
                                "\uF0FC\tسلولهای بدن برای اینکه بخوبی فعالیت کنند باید اکسیژن کافی دریافت نمایند.\n" +
                                "\uF0FC\tهموگلوبین در حمل اکسیژن از ریه ها به تمام اندام های بدن نقش دارد و کمبود آن باعث ایجاد خستگی می شود.\n" +
                                "انواع کم خونی :\n" +
                                "•\tکم خونی ناشی از فقر آهن\n" +
                                "•\tکم خونی ناشی از فقر ویتامین( ویتامین B12 و اسید فولیک)\n" +
                                "•\tبیماریهای نهفته (بیماری های خاصی که به توانایی بدن در تولید گلبولهای قرمز خونی آسیب می رساند، مثل بیماران  کلیوی که دیالیز می شوند.)\n" +
                                "•\tبیماری های خونی ارثی مثل (تالاسمی)\n" +
                                "•\tکم خونی آپلاستیک : (نوع نادری از کم خونی است و زمانی بروز می کند که بدن به اندازه کافی گلبول قرمز تولید نمی کند در این نوع کم خونی دیگر اجزا موجود در خون مثل گلبولهای سفید و پلاکت نیز کاهش می یابد.)\n" +
                                "کم خونی فقر آهن :\n" +
                                "شایع ترین نوع کم خونی است  به دلیل کمبود عنصر آهن در بدن می باشد (آهن یکی از اجزاء اصلی تشکیل دهنده هموگلوبین خون می باشد)\n" +
                                "این کم خونی، شایع ترین نوع کم خونی  در تمام گروه های سنی می باشد. بطوریکه حدود 20 درصد زنان و 50  درصد خانم های باردار و 3 درصد مردان دچار این کم خونی می شوند.\n" +
                                "کم خونی فقر آهن یک علامت است ، نه بیماری و علت آن بایستی بررسی شود.\n" +
                                "علل کم خونی فقر آهن :\n" +
                                "•\tبارداری (عدم وجود آهن کافی برای مادر و جنین)\n" +
                                "•\tدوران سریع رشد (شیرخوارگی - بلوغ)\n" +
                                "•\tاز دست رفتن خون از بدن به دلیل عادت ماهیانه یا خونریزی به دلیل اعمال جراحی ، جراحت ، خونریزی دستگاه گوارش و غیره).\n" +
                                "•\tدریافت ناکافی آهن از مواد غذایی\n" +
                                "•\tجذب ناکافی آهن موجود در مواد غذایی به دلیل اسهال، کاهش ترشح اسید معده ، مشکلات گوارشی ( بیماری کرون – سلیاک)\n" +
                                "•\tتداخلات داروئی (داروهایی مثل کلسترامین ، سایمتدین ، رانیتیدین ، شربت های آنتی اسید ، تتراسایکلین)\n" +
                                "علائم کم خونی فقر آهن :\n" +
                                "•\tخستگی ، رنگ پریدگی ، کاهش توان فعالیت\n" +
                                "•\tتنگی نفس غیرمعمول در هنگام ورزش\n" +
                                "•\tضربان سریع قلب\n" +
                                "•\tسردرد \n" +
                                "•\t دست و پاهای سرد\n" +
                                "•\tکاهش عملکرد در کار یا مدرسه\n" +
                                "•\tقاشقی شدن ناخن ها \n" +
                                "•\t ترک خوردگی گوشه لب ها\n" +
                                "افراد در معرض خطر :\n" +
                                "•\tزنان باردار\n" +
                                "•\tدختران نوجوان و زنان در سنین باروری به دلیل از دست دادن خون در دوران عادت ماهیانه\n" +
                                "•\tکودکان یک تا پنج سالی که بیشتر از سه لیوان شیر در روز می خورند.\n" +
                                "روش های تشخیصی :\n" +
                                "تشخیص آنمی فقر آهن با انجام معاینات بالینی و آزمایش خون می باشد. ولی جهت بررسی علت کم خونی ممکن است تستهای مختلف از جمله آزمایش مدفوع جهت بررسی وجود خون مخفی ، کولونوسکوپی ، آندوسکوپی جهت بررسی وضعیت دستگاه گوارش از نظر مشکلات خونریزی دهنده ، انجام شود.\n" +
                                "•\tحبوبات ( عدس ، لوبیا و نخود)\n" +
                                "درمان و مراقبت در منزل :\n" +
                                "•\tمصرف غذاهای غنی از آهن\n" +
                                "•\tمصرف مکمل های آهن خصوصا\" در افراد پر خطر مثل زنان باردار و مادران شیرده\n" +
                                "•\tمصرف ویتامین ها مثل ویتامین C ، زیرا ویتامین C جذب آهن را سریع تر می کند. بهتر است قرص های آهن همراه با یک لیوان آب پرتقال یا گوجه فرنگی ، لیمو شیرین ، سیب، آناناس ، آلو ، انبه ، گلابی ، هویچ ، چغندر ، شلغم مصرف کنید.\n" +
                                "•\tبرطرف کردن علل زمینه ایی کم خونی مثل برطرف کردن خونریزی زیاد حین عادت ماهیانه\n" +
                                "•\tاگر بیمار قادر نیست قرص آهن مصرف کند ، بایستی که با پزشک خود در مورد دریافت آهن تزریقی مشورت نماید.\n" +
                                "•\tبرای جذب بهتر آهن بهتر است که دارو با معده خالی مصرف شود. (1 ساعت قبل از غذا یا 2 ساعت بعد از غذا )\n" +
                                "•\tمصرف همزمان شیر ، سایر لبنیات ، چای ، قهوه و شربت های آنتی اسید با آهن ، جذب آهن را کاهش می دهد.\n" +
                                "•\tمصرف مکمل های آهن ممکن است موجب یبوست شود ، بنابراین بهتر است که فیبر کافی (میوه و سبزیجات) در رژیم غذایی گنجانده شود و یا از نرم کننده های مدفوع استفاده شود.\n" +
                                "گوشت قرمز  ، مرغ و ماهی حاوی آهن هِم است. و در صورتیکه همراه مواد غذایی حاوی آهن غیر هِم (غذاهای گیاهی) مصرف شود جذب آنها را افزایش می دهد.\n" +
                                "در مورد مکمل های آهن که بصورت مایع هستند با نی نوشیده شوند یا قاشق را به ته حلق برده و سپس تخلیه نمایید و بلافاصله بعد از مصرف، دهان خود را بشویید.\n" +
                                "علائم هشدار دهنده :\n" +
                                "در صورت وجود علائم زیر سریعا\" به اورژانس مراجعه نمایید:\n" +
                                "•\tدرد قفسه سینه\n" +
                                "•\tتهوع و استفراغ\n" +
                                "•\tاختلال تنفس ضمن فعالیت \n" +
                                "•\tاحساس ضعف و غش\n" +
                                "•\tتند شدن ضربان قلب\n" +
                                "•\tتعریق بی دلیل و احساس سبکی سر و گیجی ضمن بلند شدن از صندلی و یا تختخواب \n" +
                                "توجه : بیشترین علت بروز کم خونی فقرآهن در مردان خونریزی از دستگاه گوارش است که نیاز به مشاوره فوق تخصص گوارش داد.  \n" +
                                "برای پیشگیری  چه باید کرد؟ \n" +
                                "در رژیم غذایی خود حتما\" غذاهای حاوی اهن را بگنجانید.\n" +
                                " غذاهای غنی از آهن شامل :\n" +
                                "•\tجگر و سایر گوشتها (مرغ ، ماهی ، گوشت قرمز و  زرده تخم مرغ)\n" +
                                "•\tخشکبار ( آلو ، زردآلو ، کشمش ، خرما و ...)\n" +
                                "•\tانواع مغزها ( پسته ، گردو ، بادام و ...)\n" +
                                "•\tسبزیجات با رنگ سبز تیره ( اسفناج ، بروکلی و ...)\n" +
                                "•\t\n" +
                                "•\tدر صورتیکه اهن کافی در رژیم شما یافت نمی شود میتوانید از مکمل ها استفاده کنید.\n" +
                                "•\tخانم های باردار باید از ماه چهارم تا سه ماه بعد از زایمان داروی آهن مصرف کنند.\n" +
                                "•\tتمامی کودکان از 6 ماهگی تا پایان دو سالگی باید قطره آهن دریافت کنند.\n" +
                                "•\tمصرف منابع حاوی ویتامین سی (C) مانند مرکبات ، توت فرنگی ، گوجه فرنگی و کلم بروکلی باعث افزایش جذب آهن می شوند ، پس آنها را در رژیم غذایی خود بگنجانید.\n" +
                                "•\tمواظب کودکان باشید تا دچار عفونت های انگلی نشوند.\n" +
                                "•\tاز مصرف داورهای مانند آلومینیوم ام جی اس یا آلومینیوم هیدروکساید یا فرآورده های لبنی بخصوص شیر با آهن یا غذاهای حاوی آن پرهیز کنید.\n" +
                                "•\tاز نوشیدن چای، قهوه و دم کرده های گیاهی یک ساعت قبل و یک تا دو ساعت بعد از صرف غذا خودداری کنید.  \n");
                        transaction4.replace(R.id.frame_layout, fragment4);
                        transaction4.addToBackStack(null);
                        transaction4.commit();
                        break;

                    case 5:
                        FragmentTransaction transaction5 = getFragmentManager().beginTransaction();
                        InfoIllness fragment5 = new InfoIllness();
                        fragment5.SetTitle("گاستريت ( التهاب مخاط معده)");
                        fragment5.SetBody(" يك مشكل گوارشي شايع به شمار مي آيد كه ممكن است\n" +
                                " حاد باشد كه از چند ساعت تا چند روز به طول بیانجامد،\n" +
                                " يا مزمن باشد و از تماس مکرر با مواد محرک ایجاد شود\n" +
                                " و یا ممکن است دارای دوره های عود کننده باشد.\n" +
                                "عوامل ایجاد کننده بیماری چیست؟\n" +
                                "-\tمصرف غذاهای آلوده یا محرک (مانند غذاهای بسیار تند وپرادویه)\n" +
                                "-\tمصرف بیش از حد قرص آسپرین\n" +
                                "-\tمصرف زیاد الکل و دخانیات\n" +
                                "-\tخوردن آشامیدنی های داغ\n" +
                                "نوع بسیار شدیدتر گاستریت حاد در اثر خوردن اسید یا باز قوی ایجاد می شود بطوری که حتی ممکن است باعث گانگرن ( سیاه شدن ) مخاط معده یا سوراخ شدن آن شود.\n" +
                                "علائم ونشانه های گاستریت چیست؟\n" +
                                "در نوع گاستریت حاد به طور ناگهانی دچار نشانه زیر می\u200Cشوند:\n" +
                                "•\tدرد شکم\n" +
                                "•\tسردرد\n" +
                                "•\tبی حالی\n" +
                                "•\tتهوع\n" +
                                "•\tبی اشتهایی\n" +
                                "•\tاستفراغ\n" +
                                "•\tسکسکه\n" +
                                "که می تواند از چند ساعت تا چند روز بطول بینجامد .\n" +
                                " در برخی بیماران ممکن است بدون نشانه باشد.\n" +
                                "بیمار مبتلا به گاستریت مزمن دارای علائم زیر می باشد:\n" +
                                "•\tبی اشتهایی\n" +
                                "•\tسوزش سر دل بعد از غذا خوردن\n" +
                                "•\tآروغ زدن\n" +
                                "•\tاحساس طمع ترش در دهان\n" +
                                "•\tتهوع و استفراغ\n" +
                                "خطراتی که گاستریت بدنبال دارد:\n" +
                                "•\tکم آبی بدلیل مصرف ناکافی مایع و از دست دادن مایعات از طریق استفراغ\n" +
                                "•\tعدم تعادل غذایی کم تر از رفع نیاز بدن\n" +
                                "•\tسوء جذب ویتامین 12B در گاستریت مزمن باعث ایجاد کم خونی شده\n" +
                                "راههای تشخیص گاستریت چیست؟\n" +
                                "•\tشرح حال و نشانه های بیمار\n" +
                                "•\tآندوسکوپی\n" +
                                "•\tعکس برداری از قسمت فوقانی دستگاه گوارش\n" +
                                "درمان\n" +
                                "•\tمعمولاً بیمار در طول یک روز بهبود می یابد گرچه کم اشتهایی او ممکن است برای 2 تا 3 روز بیشتر ادامه داشته باشد. با آموزش در مورد قطع مصرف الکل یا غذاهای محرک ، گاستریت حاد درمان می شود.\n" +
                                "•\tدر صورتی که علت بروز گاستریت اسیدها یا بازهای قوی باشد. درمان شامل رقیق کردن و خنثی کردن ماده ایجاد کننده گاستریت می باشد بطور مثال به منظور خنثی کردن اسیدها از آنتی اسیدها متداول (هیدروکسید آلومینیوم) استفاده می شود جهت خنثی کردن باز از آب لیمو رقیق شده استفاده می شود اگر آسیب شدید باشد از لاواژ (شستشو معده) و دادن داروهای استفراغ آور خودداری می شود.\n" +
                                "سایر درمان ها که ممکن است با توجه به شرایط بیمار مورد نیاز باشد .\n" +
                                "•\tوارد کردن سوند بینی معده .\n" +
                                "•\tدادن مسکن ها و آرام بخش ها، ضد اسیدها و یا مایعات وریدی می باشد و انجام آندوسکوپی ضرورت یابد در موارد بسیار حاد جراحی اورژانس برای برداشتن قسمتهای گانگرن شده یا سوراخ شده ضرورت می یابد.\n" +
                                "در گاستریت مزمن درمان شامل:\n" +
                                "•\t اصلاح شیوه زندگی \n" +
                                "•\t ترک سیگار و الکل\n" +
                                "•\tپرهیز از اضطراب و استرس\n" +
                                "•\tمصرف داروهای تجویز شده بموقع و بطور صحیح.\n" +
                                "•\tدر صورت وجود کم خونی پیگیری درمان لازم است.\n" +
                                "•\tاز غذاهای محرک و سریع خوردن غذا پرهیز کنید.\n" +
                                "•\tوعده های غذایی پرحجم و نفاخ پیش از خواب پرهیز نمایید.\n" +
                                "•\tاز نوشیدنی های حاوی کافئین خودداری کنید.\n" +
                                "•\tروزانه حداقل 6 تا 8 لیوان آب بنوشید.\n" +
                                "•\tخواب و استراحت کافی داشته باشید.\n" +
                                "•\tاگر گاستریت شما از نوع عفونی تشخیص داده شده که علت آن افزایش باکتری موجود در معده به نام هلیکوباکترپیلوری که با آندوسکوپی تشخیص داده می شود نیاز به درمان با آنتی بیوتیک دارید.\n");
                        transaction5.replace(R.id.frame_layout, fragment5);
                        transaction5.addToBackStack(null);
                        transaction5.commit();
                        break;

                }
            }
        });

        showBackButton();

        return v;
    }

    public void showBackButton() {
        if (getActivity() instanceof MainActivity) {
            ((MainActivity) getActivity()).getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        }
    }

}
