package com.example.nazanin.hospitalapp.Illness;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentTransaction;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;

import com.example.nazanin.hospitalapp.MainActivity;
import com.example.nazanin.hospitalapp.R;


public class IllnessOfuni extends Fragment {
    Button btn1, btn2 , btn3, btn4, btn5;



    public static IllnessEye newInstance() {
        IllnessEye fragment = new IllnessEye();

        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_illness_ofuni, container, false);
        btn1 = v.findViewById(R.id.btnPenomoniOfuni);
        btn2 = v.findViewById(R.id.btn_tabeMalt);
        btn3 = v.findViewById(R.id.btn_sel);
        btn4 = v.findViewById(R.id.btn_ofunatEdradi);
        btn5 = v.findViewById(R.id.btn_gastro);



        btn1.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("پنومونی");
                fragment.SetBody("پنومونی (ذات الریه) یک عفونت تنفسی تحتانی شایع است در اثر عفونت ریه ها ایجاد می شود عفونت بیشتر کیسه های هوایی موجود در ریه وبه میزان کمتری مجاری هوایی انتقال دهنده هوا به ریه ها را درگیر می کند. بخش هایی از ریه که دچار عفونت شده است توسط مایع پر می شود این مایع حاوی گلبولهای سفید خون می باشد که با عفونت مقابله می کند \n" +
                        "بینی انسان برای محافظت از میکروبها ، گردو غیار و دیگر عوامل عفونی از مخاط و مو پوشیده شده است هنگامی که مخاط بینی قادر به جلوگیری از چنین اتفاقی نباشد این عوامل عفونی به قسمت هاي داخلی وارد شده و موجب بیماری می شود.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "علل و منشاء پنومونی از کجاست؟\n" +
                        "پنومونی توسط جرم ها (ارگانیسم های کوچکی که می توانند منجر به بیماری شوند) ایجاد شود. ویروسها، باکتریها، قارچ ها، از جرم های ایجاد کننده پنومونی هستند. این جرم ها معمولاً در ریه افراد سالم وجود ندارد. گاهی اوقات جرم ها توسط جریان خون به ریه ها می رسند ولی اغلب توسط قطرات ریز آب موجود در هوای تنفسی (قطرات تنفسی) به ریه ها منتقل می گردند. منبع این جرم ها افرادی هستند که با سرفه و عطسه کردن باعث انتشار جرم های موجود در قطرات تنفسی خود می شوند.\n" +
                        "\n" +
                        "انواع پنومونی\n" +
                        "پنومونی اکتسابی: از مراکز درمانی (افرادی که مکررا در بیمارستان بستری میشوند. و روشهای مانند پی گیری معاینات ، دیالیز و غیره دارند بیشتر در معرض خطر ابتلا به این نوع پنومونی که به سختی درمان می شود، هستند.\n" +
                        "پنومونی آسپیراسیون : هنگامی که مواد جامد و یا مایع که به طور طبیعی باید از طریق مری عبور کند تصادفاً به ریه ها وارد می شوند خطر ابتلا به این نوع از پنومونی را افزایش می دهد برخی داروها و الکل نیز می تواند باعث افزایش خطر ابتلا به پنومونی آسپراسیون شود.\n" +
                        "•\tچه کسانی مبتلا به پنومونی می شوند؟\n" +
                        "هر کسی می تواند به پنومونی مبتلا شود حتی افراد سالم هم ممکن است به این بیماری مبتلا شوند. با این وجود، وجود جرم ها بیشتر به ایجاد عفونت در افراد با نقص ایمنی که دفاع طبیعی بدن در آنها کاهش یافته تمایل دارند.\n" +
                        "افراد در سنین بسیار بالا و بسیار پایین (نوزادان و افراد مسن) که ریه ها و سیستم دفاعی ضعیف تری دارند بنابراین پنومونی در سنین ابتدایی وانتهای زندگی بیشتر دیده می شود.\n" +
                        "سایر مواردی که می توان سیستم دفاعی ریه های را تضعیف سازد شامل سیگار، تنباکو، عفونتهای ویروسی که راههای تنفسی را درگیر می کند (مانند سرماخوردگی معمولی) و سایر عفونت های ویروسی (ایدز= HIV) می باشد.\n" +
                        "بعضی داروها هم باعث ضعیف شدن سیستم ایمنی می شود مانند داروهایی که در درمان کانسر (سرطان) کاربرد دارند.\n" +
                        "علل جراحی هم می تواند باعث آسیب پذیر شدن افراد شود به همین علت است که پنومونی در بیمارانی که قبلاً به دلایل دیگر در بیمارستان بستری بودند پیشرفت می کند.\n" +
                        "•\tعلائم و نشانه های ابتلا به پنومونی چیست؟\n" +
                        "علائمی که تقریباً بطور گسترده در تمام بیماران مبتلا به ذات الریه مشاهده می شود \n" +
                        "علائم اولیه شامل:\n" +
                        "•\tتب: اغلب با درجه بالا امّا درجه پایین تر نیز دیده می شود.\n" +
                        "•\tلرز\n" +
                        "•\tسرفه مداوم\n" +
                        "•\tاشکال در تنفس\n" +
                        "•\tاز دست دادن اشتها\n" +
                        "•\tضعف و بی حالی\n" +
                        "•\tدرد بیش از حد قفسه سینه\n" +
                        "•\tافزایش تولید عرق\n" +
                        "علائم پنومونی ناشی از باکتری معمولاً سریع و شامل:\n" +
                        "•\tسرفه خلط دار به رنگ زرد یا سبز آغشته به خون می باشد.\n" +
                        "•\tتب\n" +
                        "•\tتعریق بیش از حد\n" +
                        "•\tتنفس سریع و احساس تنگی نفس\n" +
                        "•\tتکان خوردن، دندان غروچه و لرز\n" +
                        "•\tدرد قفسه سینه که اغلب با سرفه و تنفس بدتر می شود\n" +
                        "•\tضربان قلب سریع\n" +
                        "•\tاحساس خستگی و ضعف زیاد\n" +
                        "•\tتهوع و استفراغ و اسهال\n" +
                        "\n" +
                        "علائم پنومونی ناشی از ویروس که به آرامی ظاهر می شوند و اغلب بد نیستند شامل:\n" +
                        "•\tبی حالی\n" +
                        "•\tتب با درجه بالا\n" +
                        "•\tتنگی نفس و در کنار آن سرفه خشک\n" +
                        "•\tدرد عضلانی\n" +
                        "راههای تخشیص پنومونی چیست؟\n" +
                        "•\tبر اساس تاریخچه (بخصوص یک عفونت اخیر در مجاری تنفسی)\n" +
                        "•\tمعاینه فیزیکی توسط پزشک\n" +
                        "•\tعکس برداری از قفسه سینه \n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "•\tکشت خون\n" +
                        "•\tآزمایشات خلط\n" +
                        "درمان پنومونی چیست؟\n" +
                        "درمان اصلی پنومونی آنتی بیوتیک صحیح بر اساس جواب کشت می باشد و بیشتر افراد با استراحت در منزل حال عمومی بهتری پیدا می کنند اما افراد با بیماری شدیدتر باید در بیمارستان بستری شوند تا سطح اکسیژن خون آنها تحت نظر باشد و مایعات بصورت سرم برای آنها تجویز گردد.\n" +
                        "با وجود اینکه بیشتر افراد حال عمومی بهتری پیدا می کنند اگر بیماری بسیار شدید باشد حتی با بهترین شیوه درمان منجر به وخیم شدن حال عمومی بیمار می شود.\n" +
                        "سایر داروها: ضد تب ها، تسکین دهنده های درد، ضد سرفه ها و خلط آور\n" +
                        "•\tدر صورت ابتلا به پنومونی چه اقداماتی انجام دهیم؟\n" +
                        "•\tداروهایی که پزشکان تجویر می کنند بموقع مصرف نمائید. و دوره درمانی با آنتی بیوتیک را کامل کنید.\n" +
                        "•\tاز دستگاه بخور برای مرطوب کردن هوای استشاقی استفاده کنید.\n" +
                        "•\tبیشتر علائم مانند درد قفسه سینه و تب در عرض چند روز بعد از درمان تخفیف می یابد سرفه معمولاً 2 تا 3 هفته طول می کشد تا برطرف شود ولی خستگی و ضعف ممکن است ماه ها زمان ببرد تا به طور کامل برطرف گردد.\n" +
                        "•\tاگر علائم شما در حد انتظار بهبود نیافته و یا چنانچه بیماری عود کرد به پزشک خود جهت بررسی بیشتر مراجعه کنید.\n" +
                        "•\tسرفه کنید تا ترشحات ریوی خارج گردد.\n" +
                        "•\tبهداشت دهان خود را رعایت کنید.\n" +
                        "•\tاز سیگار کشیدن و مصرف الکل خودداری کنید.\n" +
                        "•\tاز خوابیدن طولانی در یک وضعیت خودداری کنید.\n" +
                        "•\tبهداشت فردی خود را جهت پیشگیری از عفونت رعایت کنید هنگام سرفه از دستمال یکبار مصرف استفاده کنید و دستهای خود را با آب و صابون بشوئید.\n" +
                        "•\tبه علت خستگی و تنگی نفس اشتهای شما کاهش می یابد اگر بیماری قلبی ندارید و طبق نظر پزشک مایعات فراوان حداقل 6 تا 8 لیوان آب بنوشید زیرا مصرف مایعات باعث رقیق شدن ترشحات شده و به خروج آن کمک می کند.\n" +
                        "•\tبرای افزایش ایمنی از مواد غذایی حاوی ویتامین C (پرتقال و نارنگی) و انواع مغزها استفاده کنید.\n" +
                        "•\tواکسیناسیون در افراد در معرض خطر توصیه می شود (افراد مسن) واکسن هایی که بیشتر توصیه به آن ها شده است آنفلولانزا و پنوموکوک می باشد\n" +
                        "•\tدر هوای آلوده از منزل خارج نشوید و هنگام بیرون رفتن از منزل لباس گرم و مناسب بپوشید\n" +
                        "•\tاز تماس با افراد مبتلا به سرماخوردگی خودداری کنید.\n" +
                        "•\tاز مصرف غذاهای تحریک کننده مانند غذای چرب، سرخ شده و پر ادویه خودداری کنید.\n" +
                        "•\tاز مصرف مواد محرک مانند اسپری خوشبو کننده، وایتکس و شیشه شوی خودداری کنید.\n" +
                        "•\tاز فعالیت بیش از حد در طی دوره بهبودی خودداری کنید و در بین فعالیت دوره هایی از استراحت داشته باشید.\n" +
                        "•\tدر تاریخ معین جهت پیگیری درمان به پزشک مراجعه کنید.\n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.addToBackStack(null);
                transaction.commit();

            }
        });

        btn2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("تب مالت ");
                fragment.SetBody("\uF0FC\tشایع ترین بیماری مشترک بین انسان و دام است.\n" +
                        "\uF0FC\tآنچه باعث بوجود آمدن بیماری تب مالت می شود.باکتری بروسلا می باشد که پس از آلوده کردن دام (گاو ، گوسفند و بز) از راه استفاده از شیر و لبنیات آلوده و تماس با پوست و مواد دفعی  حیوان آلوده باعث انتقال بیماری به انسان می شود.\n" +
                        "\uF0FC\tباکتری تب مالت دستگاه خون ساز بدن و مغز استخوان و طحال را تحت تاثیر قرار می دهد این بیماری در مردان بین سن 20 تا 60 سال شایع است.\n" +
                        "علت باکتری تب مالت :\n" +
                        "باکتری بروسلا  است. 4 نوع باکتری بروسلا وجود دارد.\n" +
                        "1-\tبروسلای گاو 2- بروسلا گوسفند و بز 3- بروسلای خوک 4- بروسلای سگ \n" +
                        "بروسلای نوع گوسفندی و بزی شایع تر است.\n" +
                        "راه های انتقال تب مالت به انسان :\n" +
                        "\uF0FC\t3 راه کلی انتقال به انسان وجود دارد. شامل دستگاه گوارش ، تنفس و پوست است.\n" +
                        "\uF0FC\tمصرف شیر خام و مواد لبنی آلوده خصوصا پنیر تازه ، سر شیر و بستنی خامه دار و آغوز \n" +
                        "\uF0FC\tآلوده بودن ظروف مورد استفاده حین  شیر دوشی\n" +
                        "\uF0FC\tتنفس گرد و غبار موجود در هوای طویله و اصطبل  دامها در دامدارن و یا محیط آزمایشگاه ها \n" +
                        "\uF0FC\tتماس پوست خراشیده با جفت و یا خون و مواد دفعی حیوان آلوده (این مورد بیش تر در هنگام کمک به زایمان دام مبتلا اتفاق می افتد.)\n" +
                        "\uF0FC\tاحتمال انتقال انسان به انسان (شیر دادن مادر ، انتقال جنسی ، خون و پیوند مغز  استخوان) و انتقال از طریق حشرات نیز بصورت نادر موجود دارد.\n" +
                        "نکته : کم خونی وخیم ، مشکلات معده و سابقه جراحی آن بدلیل کاهش اسید معده امکان ابتلا را بالا می برد. اسید معده تا حدودی احتمال ابتلا را کاهش می دهد.\n" +
                        "علائم بیماری در دام :\n" +
                        "-\tسقط جنین (سقط جنین در گاو مبتلا از ماه پنجم به بعد و در گوسفند مبتلا در 2 ماهه آخر اتفاق می افتد.)\n" +
                        "-\tکاهش وزن دام\n" +
                        "-\tکاهش شیر\n" +
                        "علائم و نشانه ها در انسان :\n" +
                        "تب مالت  بدلیل علائم و نشانه های زیاد و متنوع  به بیمار هزار چهره معروف است.\n" +
                        "مهم ترین علامت،  تب مداوم 38 تا 40 درجه که با احساس سرما؟و لرز همراه  است تب مداوم بوده یا به صورت دوره ای باشد.\n" +
                        "دردهای عضلات و استخوان ، سردرد ، تعریق شدید بویژه  در شب ، خستگی بی اشتهایی و کاهش وزن \n" +
                        "بیماران معمولا صبح ها نسبتا خوب و عصرها دارای علائم می باشند.\n" +
                        "انواع تب مالت :\n" +
                        "نوع حاد : علائم به طور ناگهانی ظاهر می شوند. مثل : (تب و لرز ، خستگی ، تعریق ، سردرد ، درد عمومی بدن ، بی اشتهایی)\n" +
                        "نوع مزمن : علائم زیر در تب مالت مزمن به تدریج ظاهر می شود مثل :(خستگی ، درد عضلات ، کمر درد ، کاهش وزن ، افسردگی ، ناتوانی جنسی ، به ندرت ممکن است عفونت کلیه ، مغز ، تخمدان ، ریه و مفاصل ، که معمولا در صورت ناکافی بودن مراقبت و درمان اتفاق می افتد.)\n" +
                        "تشخیص :\n" +
                        "تشخیص قطعی تب مالت با آزمایش خون می باشد (آزمایشات کومس  رایت ، 2MF (تو ام ای)\n" +
                        "درمان :\n" +
                        "•\tدرمان بستگی به نظر پزشک دارد. طول  دوره درمان از 8 هفته یا بیشتر می تواند باشد بخصوص در مواردی که درگیری عصبی (مغز) و قلبی وجود دارد. مدت آن 2 تا 3 برابر می شود. \n" +
                        "•\tداروهای آنتی بیوتیک که معمولا استفاده می شوند ، کپسول داکسی سایکلین ، قرص کوتریموکسازول ، کپسول ریفامپین  ، آمپول های جنتا مایسین و استریتومایسین می باشد.\n" +
                        "\n" +
                        "\n" +
                        "معمولا از بین این داروها  2دارو  انتخاب می شوند. و برای مدت حداقل 6 هفته استفاده می شوند\n" +
                        "•\tدر این دوره طولانی  مصرف  دارو  باید تا پایان ادامه داشته باشد تا از عود بیماری پیشگیری شود.\n" +
                        "نکته : مبتلایان به تب مالت می بایست تا مدت 2 سال هر 3 تا 6 ماه از نظر علائم و نشانه های بیماری و آزمایشات لازم و (کشت خون) برای ریسک عود مجدد بررسی شوند.\n" +
                        "فعالیت \n" +
                        " تا زمان برطرف شدن تب و سایر علائم ، در رختخواب استراحت نمایید پس از آن تقریبا فعالیت های عادی را از سر بگیرید.\n" +
                        " رژیم غذایی\n" +
                        "  معمولا ابتدا از غذاهای نرم و ساده شروع می کنند. و بتدریج تنوع و مقدار غذا را افزایش می دهند.\n" +
                        "بهتر  است از غذاهای پر انرژی و نوشیدنی ها و مایعات فراوان استفاده کنید\n" +
                        "جهت پیشگیری از تب مالت باید اقدامات زیر را انجام داد:\n" +
                        "•\tدر صورت عدم دسترس به شیر پاستوریزه قبل از مصرف آن را به مدت 20 دقیقه جوشانده و در حین جوشاندن مرتب به هم بزنید تا تمام شیر حرارت لازم را ببیند.\n" +
                        "•\tاز مصرف خامه و بستنی غیر پاستوریزه خودداری نمائید.\n" +
                        "•\tپنیر تازه حداقل باید 3 ماه در آب نمک نگهداری شوند چون باکتری تب مالت تا 2 ماه می تواند زنده بماند. {فریز کردن این باکتری را نمی کشد.)\n" +
                        "\n" +
                        "قبل از دوشیدن شیر از دام حتما پستان دام و اطراف آن را با آب و صابون به خوبی بشوئید.\n" +
                        "ظروف مخصوص شیر دوشیدن را قبل از استفاده با دقت کامل شستشو دهید.\n" +
                        "شیر دامی که جدیدا سقط جنین داشته را مصرف نکنید (لازم به ذکر است گوشت حیوانات مبتلا به تب مالت اگر خوب پخته شود قابل استفاده است.)\n" +
                        "از تماس مستقیم با بافتهای آلوده حیوان خودداری نمائید (بویژه ترشحات دستگاه ادراری ، تناسلی و دهان)\n" +
                        "دام تلف شده ، سقط شده و ترشحات رحمی دامهای آلوده را سوزانده یا به مقدار کافی بر روی آنها مواد ضدعفونی کننده ریخته و به طور بهداشتی دفن نمائید.\n" +
                        "در صورت لزوم تماس با ترشحات رحمی و دام تلف شده سعی شود از دستکش استفاده گردد.\n" +
                        "از کستار پراکنده دامها در فضای باز بایستی پرهیز نمود.\n" +
                        "دام ها  باید بر علیه تب مالت واکسینه شوند.\n" +
                        "در مواقع نظافت طویله دهان را با پارچه تمیزی بپوشانید.\n" +
                        "برای شناسایی حیوانات بیمار یا مشکوک با مامورین دامپزشکی همکاری مناسب را داشته باشید.\n" +
                        "از نگهداری دام آلوده در گله خودداری نموده و جهت حذف آن با نظر دامپزشکی اقدام نمائید.\n" +
                        "اساسی ترین راه برای پیشگیری از بیماری تب مالت جوشاننیدن شیر به مدت 20 دقیقه و استفاده از دستکش هنگام تماس با دام ها می باشد.   \n" +
                        "مشاغل در معرض خطر :\n" +
                        "کشاورزان ، دامداران ، دامپزشکان و کارگران کشتارگاه ها\n" +
                        "در این شرایط به پزشک خود مراجعه نمائید.\n" +
                        "•\tاگر شما یا یکی ازاعضای خانواده تان علائم تب مالت را دارید.\n" +
                        "•\tاگر تب یا سایر علائم مجددا پس از درمان عود کنند.\n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.addToBackStack(null);
                transaction.commit();

            }
        });

        btn3.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("بیماری سل چیست؟");
                fragment.SetBody("سل یک بیماری عفونی واگیردار می باشد هر سال بیش از 8 میلیون نفر به بیماری سل مبتلا می شوند.\n" +
                        "میکروب بیماری سل میله ای شکل (شبیه مدار) می باشد به آن باسیل سل می گویند.\n" +
                        "این میکروب می تواند بر روی ریه ها و دیگر جاهای بدن از جمله مغز(مننژیت سلی)، استخوان و مفاصل، غدد لنفاوی،\n" +
                        " کلیه ها اثر بگذارد.\n" +
                        "اگر میکروب سل در ریه ها رشد کند به آن سل ریوی می گویند. اگر در جاهای دیگر بدن رشد کند سل خارج ریوی می گویند.\n" +
                        "سل ریوی با خلط مثبت (میکروب در خلط آنها وجود دارد) قابل سرایت به دیگران می باشد و در اکثر موارد سل ریوی خلط منفی و سل خارج ریوی قابل سرایت به دیگران نمی باشد . باسیل سل میتواند در بدن شما . زندگی کند بدون اینکه بیمار باشید که به آن عفونت پنهان میگویند. ولی اگر سیستم ایمنی بدن به علت بیماری هایی مثل ایدز، سرطان، سو تغذیه پایین بیاید.میکروب فعال شده و شروع به رشد میکند. ودچار علائم بیماری سل می شود و در این مرحله به این فرد ″بیمار مسلول ″ میگویند. تابش مستقیم نور خورشید ظرف مدت 5 دقیقه میکروب سل را می کشد اما این میکروب مدت ها در تاریکی زنده می ماند.\n" +
                        "علائم و نشانه های بیماری سل چیست؟\n" +
                        "1-سرفه( معمولا خشک ) بیش لز 2 هفته (شایعترین علامت)\n" +
                        " 2-تب و لرز و عرق شبانه \n" +
                        "3-خلط فراوان\n" +
                        "4-بی اشتهایی و کاهش وزن \n" +
                        "5-خلط خونی\n" +
                        "6-درد قفسه سینه \n" +
                        "سایر علائم رنگ پریدگی و خستگی مداوم\n" +
                        "\n" +
                        "چه افرادی بیشتر در معرض خطر هستند؟\n" +
                        "1-جمعیت های متراکم: نظیر زندان ها، مراکز بازپروری، اردوگاهها، آسایشگاه های سالمندان و غیره\n" +
                        "2-بیماران مبتلا به ضعف سیستم ایمنی: از جمله افراد آلوده به عفونت ایدز، نارسایی کلیه، دیابت کنترل نشده و بیماران تحت درمانهای تضعیف کننده سیستم ایمنی از جمله: دارو های شیمی درمانی و کورتون\n" +
                        "3-کارکنان سیستم بهداشتی که از نظر مواجهه و ابتلا به سل در معرض خطر بالا یا متوسط قرار دارند بخصوص \n" +
                        "کارکنان آزمایشگاه سل.\n" +
                        "\n" +
                        " روشهای تشخیصی در بیماری سل \n" +
                        "1-کشف میکروب سل با ارسال نمونه مستقیم خلط بیمار مشکوک و یا کشت خلط و روشهای اختصاصی آزمایشگاهی2-عکس برداری از قفسه سینه 3-تست پوستی توبرکولین\n" +
                        "آزمایش پوستی توبرکولین از نظر بالینی ارزش محدودی دارد و این مطلب مخصوصا در کشورهای با شیوع بالا سل بیشتر صادق است.. از یک طرف تست پوستی توبرکولین مثبت، بیماری سل را همیشه به همراه ندارد . و از طرف دیگر وجود پوستی توبرکولین منفی تشخیص سل را کاملا رد نمی کند.\n" +
                        "درمان\n" +
                        "اساس درمان بیماری سل را درمان دارویی تشکیل می دهد.\n" +
                        "در حال حاضر دارو های اصلی ضد سل عبارتند از: 1-اتامبوتول 2-ایزونیازید 3-پیرازینامید 4-ریفامپین\n" +
                        "5-استرپتومایسین\n" +
                        "معمولا از 4 داروی اول استفاده میشود که این 4 دارو در قالب یک قرص ساخته شده . برای اطمینان از نابودی باسیل سل وپیشگیری از عود مجدد بیماری درمان طولانی مدت ضروری است\n" +
                        "دوره درمان و تعداد داروی مورد مصرف بسته به شدت بیماری و قسمت های درگیر بدن متفاوت است ولی به طور متوسط بین 6 ماه تا یک سال می باشد. درمان ناکامل و یا ناقص بیماری سل به مراتب بدتر از درمان نکردن بیماران می باشد. \n" +
                        "نکات قابل توجه به هنگام استفاده از داروهای ضد سل :\n" +
                        "1-داروها را هر روز مصرف کنید به هیچ وجه کم و زیاد نکنید.\n" +
                        "2-دوره درمان را کامل کنید دوره درمان حداقل 6 ماه است.\n" +
                        "3-داروها را با معده خالی یک ساعت قبل ویا 2 ساعت بعد از غذا مصرف کنید.\n" +
                        "4-اگر شربت های سفید رنگ ضد اسید معده (آنتی اسید) استفاده می کنید بدانید که اثر داروهای ضد سل را کاهش می دهد به پزشک معالج خود اطلاع دهید. \n" +
                        "5-در زمان درمان با دارو های ضد سل (به خصوص ایزونیازید) از غذاهایی مانند کنسرو ماهی، تن، پنیر کهنه، شراب قرمز، سس سویا، عصاره مخمرها پرهیز کنند (ممکن است باعث سردرد، تپش قلب، افت فشار خون و تعریق و برافروختگی شود).\n" +
                        "6-ریفامپین اثر دارو هایی مثل وارفارین، دیگوکسین، تئوفیلین، داروهای ضد بارداری خوراکی، کلسیم، کورتن، ایندرال را کاهش می دهد. اگر این داروها را استفاده می کنید موضوع را به پزشک معالج اطلاع داده تا مقدار داروی شما را تنظیم نماید.\n" +
                        "7-نارنجی شدن یا قرمز شدن رنگ ادرار و یا سایر ترشحات بدن در اثر مصرف ریفامپین می باشد وهیچ گونه خطری ندارد.\n" +
                        "8-مقادیر آنزیم های کبد، اوره و کراتینین خون (بررسی عملکرد کلیه ها) هر ماه باید مورد بررسی قرار گیرد.\n" +
                        "در صورت استفاده از لنز چون باعث تغییر رنگ لنز می باشد درطول درمان با ریفامپین از عینک استفاده کنید..\n" +
                        "\n" +
                        "شرایط اتاق بیمار \n" +
                        "•\tنور خورشید به مقدار کافی به اتاق نفوذ کند.\n" +
                        "•\tبه اندازه کافی پنجره داشته باشد. (یک پنجم مساحت کف اتاق)\n" +
                        "•\tاز بستن پنجره اتاق بیمار خودداری شود.\n" +
                        "چطور از بروز بیماری سل پیشگیری کنیم؟\n" +
                        "1-اصلی ترین راه پیشگیری یا مبارزه با این بیماری، شناسایی افراد مبتلا و درمان آنها با دارو های ضد سل می باشد\n" +
                        "2-واکسیناسیون به وسیله واکسن ب ث ژ\n" +
                        "3-ارتقا آموزش های بهداشتی و سطح اقتصادی و فرهنگی در جامعه\n" +
                        " 4-مبارزه با بیماری ایدز، این بیماری موجب شیوع موج جدید از بیماری سل گردیده است.\n" +
                        "5-بعد از دو هفته از شروع درمان، امکان انتقال بیماری به دیگران وجود ندارد ولی در دو هفته اول درمان باید از تماس های مکرر با بیمار مبتلا به سل خودداری کرد.\n" +
                        "6-بیماران حتما از ماسک استفاده کنند\n" +
                        "7-بیماران از بوسیدن کودکان خودداری کنند.\n" +
                        "8-بیماران از پراکنده نمودن خلط درهوا و روی زمین خودداری نمایند. لازم است به بررسی اطرافیان بیمارانی که در موقع تشخیص به دلیل سل فوت می کنند توجه بیشتری شود\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "پیشگیری با واکسن ب ث ژ\n" +
                        " واکسن ب ث ژ در کشور ما در بدو تولد و فقط در یک نوبت تزریق می شود و یکبار تزریق کافی است. باید دانست که واکسن ب ث ژ از بروز موارد خطرناک و مرگ و میر بیماری سل ارزنی ( سل منتشر اعضاء بدن ) و سل مننژیتی جلوگیری می کند ولی اثرات ناچیزی در پیشگیری از گسترش بیماری سل درجامعه دارد.  \n" +
                        "اهمیت مبارزه صحیح با سل\n" +
                        "•\tبا تشخیص به موقع و درمان صحیح بیماران مبتلا به سل به راحتی می توان با این بیماری مبارزه کرد. ولی اگر بیماران را نتوانیم تشخیص دهیم.به راحتی هر بیمار مسلول سالانه 10 تا 15 نفر دیگر را در خانواده و نزدیکان خود آلوده می کند و مهم تر آن که اگر بیمار مبتلا به سل ریوی را تشخیص دهیم ولی تحت درمان صحیح و دقیق قرار نگیرد، موجب به وجود آمدن میکروب سل مقاوم به دارو می گردد که دیگردارو های ضد سل معمولی بر آن اثر نمی کند و در نتیجه بیماری وخیم تر شده و به راحتی قابل درمان نیست و اگر به دیگران منتقل شود مشکلات زیادی را به وجود می آورد.\n" +
                        "تغذیه بیمار مبتلا به سل \n" +
                        "سل و سوء تغذیه همراه هم هستند.عفونت سل باعث کاهش وزن و لاغری می شود.\n" +
                        "اکثرا تمایل به خوردن نداشته باشند، مقادیر کم غذا به دفعات بیشتر شود\n" +
                        "شیر دراین دوره زیاد مصرف شود.\n" +
                        "از میوه های حاوی ویتامین (ث) مثل پرتقال و غذاهای پروتئین دار مثل گوشت و تخم مرغ حتما در این دوران استفاده شود.\n" +
                        "منابع:\n" +
                        "اصول طب داخلی هاریسون ، بیماری های عفونی (باکتریال) 2015 ، پرستاری داخلی جراحی برونر سودارث بیماری های تنفسی و تبادلات گازی 2012\n" +
                        "•\t\n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.addToBackStack(null);
                transaction.commit();

            }
        });

        btn4.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("عفونت های دستگاه های ادراری ");
                fragment.SetBody("عفونت های دستگاه ادراری(UTIs(به وسیله میکروار گانیسم های بیماریزای دستگاه های ادراری ایجاد می شوند (دستگاه ادراری طبیعی در قسمت بالای مجرای ادرار استریل است ). عفونت های \n" +
                        "دسشتگاه های ادراری به طور عموم به صورت عفونت های قسمت فوقانی یا تحتانی دستگاه های ادراری طبقه بندی می شوند و تقسیم بندی بیشتر به صورت بدون عارضه و دارای عارضه بسته به وضعیت بیمار انجام می گیرد  عفونت های ادراری قسمت تحتانی شامل: سیستیت باکتریایی (التهب مثانه )، پروستاتیت باکتریایی (التهاب غده پروستات )، و اور تریت باکتریایی (التهاب مجرای ادرار)می باشد . التهاب حاد یا مزمن غیر باکتریا در هر یک از این قسمت ها می تواند به طور اشتباه به عنوان عفونت های باکتریایی تشخیص داده شود . عفونت های ادراری در بخش فوقانی شیوع کمتری دارند و عبارتند از : پیلونفریست  حاد یا مزمن (التهاب لگنچه کلیوی )، نفریت بینابینی (التهاب کلیه ) آبسه های کلیوی ، عفونت های فوقانی و تحتانی دستگاه های ادراری به دو دسته بدون عارضه و با عارضه تقسیم بندی میبشوند ، براین اساس که آیا این عفونت  ها عود کننده و این که دوره عفونت چقدر است . بیشتر عفونت های ادراری بدون عارضه اکتسابی از جامعه اند . عفونت های ادراری عارضه دار  معمولا در افراد دارای ناهنجار های دستگاه ادراری یا کسانی که اخیرا کاتتریزاسیون برایشان انجام شده اند است و اغلب طی دورهبستری در بیمارستان کسب می شوند.\n" +
                        "عفونت های دستگاه ادراری تحتانی\n" +
                        "مکانسیم های مختلفی استریل بودن مثانه را حفظ می کنند : سد فیزیکی مجرای ادرار ، جریان ادرار،کف6ایت محل اتصال میزنای – مثانه ، آنزیم ها وآنتی بادی های ضد باکتری مختلف و اثرات ضد چسبندگی که بوسیله سلول های مخاطی مثانه ایجادمی شوند . ناهنجاری ها یا اختلالات این مکانسیم ها ، عوامل خطر ساز دخیل در عفونت های دستگاه های ادراری  تحتانی هستند \n" +
                        "پاتوفیزیولوژی\n" +
                        "برای بروز عفونت های ، باکتری باید به مثانه دسترسی پیدا کند و برای این که به وسیله جریان ادرار شسته و خارج نشود به بافت اپی تیلوم چسبیده و کلونی ایجاد می نماید و از مکانسیم های دفاعی میزبان گذشته و التهاب و آغاز میگردد . بیشتر موارد UTIs به علت ارگانسیم  های موجود در مدفوع است که از راه پرینه به مجرای ادرارو سپس به مثانته صعود کرده و به سطوح مخاطی می چسبد . \n" +
                        "تهاجم باکتریایی دستگاه ادراری \n" +
                        "با افزایش ریزش آهسته سلول های اپی تلیال مثانه (که منجربه خروج باکتری ها می شوند ) مثانه می تواند تعداد زیادی از باکتری ها را پاک کند . گلیگوز آمینو گلیان (GAG) که یک پروتئین آب دوست است ،در حالت طبیعی اثر محافظتی غیر چسبنده دربرابر باکتری های مختلف دارند مولکولGAG مولکول های آب را جذب نموده و یک سد آبی ایجاد میکند که به عنوان یک لایه دفاعی بین مثانه و ادرار قرار می گیرد .GAG می تواند به وسیله بعضی از مواد تخریب شود (سیکلامات ،ساخارین ،آسپارتام ، ویا متابولیت های تریپتوفان فلور باکتریال طبیعی واژن – مجرای ادرارنیز از چسبندگی اشریشاکولی جلوگیری می کنند ایمونوگلوبولین A ادراری نیز ممکن است سدی در برابر باکتری ها فراهم کند .\n" +
                        "رفلاکس \n" +
                        "انسداد در جاری شدن ادرا ، سبب رفلاکس مجرای ادرا به مثانه میشود . رفلاکس جریان رو به عقب ادرار از مجرای ادرار به مثانه است  .با سرفه ، عطسه یا زور زدن ، فشار مثانه افزایش یافته و ممکن است ادرار از مثانه به مجرای ادرا ر وارد شود با بزگشت فشار به حالت طبیعی ، ادرار به سمت مثانه بازمی گردد و باکتری هااز بخش جلوی مجرای ادراربه مثانه آورده\n" +
                        "چارت 1-55\tطبقه بندی عفونت های  دست\n" +
                        "گاه ادراری\n" +
                        "عفونت های دستگاه های ادراری  (UTIs) براساس محل تقسیم بندی می شوند:دستگاه های ادراری تحتانی (شامل مثانه و قسمت های زیرز آن )یا دستگاه ادراری فوقانی (شامل کلیه و میزنای\n" +
                        "همچنین به صورت بدون عارضه یا عارضه دار طبقه بندی می شوند.\n" +
                        "UTIsفوقانی \n" +
                        "سیستیت ، پروستاتیت ، اور تریت \n" +
                        "UTIs فوقانی \n" +
                        "پیلونفریت حاد پیلونفریت مزمن ، آبسه های کلیوی ،نفریت بینابینی ، آبسه اطراف کلیوی  \n" +
                        "UTIsبدون عارضهتحتانی یا فوقانی \n" +
                        "عفونت اکتسابی ازجامعه ، در زنان جوان شایع است . معمولا عود کننده نیست \n" +
                        "UTIsعارضه دار تحتانی یا فوقانی \n" +
                        "اغلب اکتسابی از بیمارستان و در ارتباط با سوند گذاری است . در بیماران دارای ناهنجاری های دستگاه ادراری ، بارداری ، سرکوب سیستم ایمنی ، دیابت و انسداد رخ می دهد و اغلب عود کننده .\n" +
                        "\n" +
                        "می شوند . همچنین رفلاکس مجرای ادرار به مثانه ممکن است به دلیل نارسایی گردن مثانه یا پیشابراه باشد. زاویه مجرای ادرار-مثانه و فشار بسته شدن مجرای ادرار ممکن است با یائسگی دچارتغییراتی شود ، که علت افزایش بروز عفونت در زنان بعد از یائستگی است .رفلاکس بیشتر اوقلت در کودکان دیده می شود و درمان ، براساس شدت آن انجام می شود . رفلاکس مثانه به میزنای، به برگشت جریان ادرار از مثانه به یک یاهر دو میز نای گفته می شود . در حالت طبیعی ، اتصال میزنای –مثانه از جریان رو به عقب ادرار به میزنای جلوگیری می کند . قسمتی از میزنای ها دردیواره مثانه جای گرفته اند ، بنابراین قسمت کوچکی از میز نای هنگام دفع ادرار به وسیله عضله مثانه تحت فشار قرار می گیرد. هنگامی که دریچه میزنای – مثانه دچار آسیب شده باشد ، باکتری ها ممکن است به کلیه ها برسند ودر نهایت آن را تخریب نماید\n" +
                        "باکتری های بیماری زای ادراری \n" +
                        "باکتریوری ، به وجود باکتری در ادرار گفته می شوند .به علتاین که نمونه های ادرار (به خصوص در زنان ) معمولا به ئسیله باکتری هایی که به طور طبیعی درمنطقه مجرای ادراری قراردارند آلوده می شوند،شمارش باکتریایی بیشتراز105 کلونی درهر میلی لیتر از نمونه تمیز وسط ادرار می تواند ملاکی جهت تشخیص باکتریوری واقعی در اثر آلودگی باشد . در مردان ،آلودگی نمونه ادرار جمع آوری شده به ندرت پیش می آید ، هر میلی لیتر از ادرار تعریف کرد (هوگان ،یانگ ، گابرت و همکاران 2011)، UTIs اکتسابی از جامعه ، شایع ترین عفونت باکتریایی در زنان است .(پورت وماتفین 2009)،ارگانیسم هایی که اغلب به طور معمول ، عامل یروز UTIs هستند ف به طورطبیعی در قسمت تحتانی دستگاه گوارش وجود دارند و اشریشاکولی شایع ترین آنهاست .  به هر حال در مقایسه با مشاهدات گذشته جداسازی اشریشاکولی کاهش یافته است. به ویژه در مردان و بیماران دارای کاتتر های داخل مثانه ای که در مقایسه با زنان و بیماران بدون کاتتر ادراری ، میزان بالاتری از ارگانیسم های پسودو موناس ، و انتروکوکوس را دارا هستند (لینگمن ولی لا2010) \n" +
                        "راه های عفونت\n" +
                        "باکتری ها از سه راه به دستگاه ادراری وارد می شوند : از راه مجرای ادرار (عفونت بالا رونده )از طریق جریان خون ، (انتشار خون ) از راه یک فیستول رودهای (انتشار مستقیم ). شایع ترین راه ورود عفونت از طریق مجرای ادرار است که باکتری (اغلب از آلودگی مدفوعی ) در اطراف مجرای ادرار تکثیر یافته سپس از مجرای ادرار به مثانه وارد می شود در زنان، مجرای ادرار کوتاه ،مقاومت کمی  در برابر انتقال باکتری های بیماری زای ادراری دارد . مقاومت جنسی باکتری ها را از مجرای ادرار به سمت مثانه هدایت می کند . این امر موجب افزایش میزان بروز UTIs در زنان فعال از نظر جنسی می شود. همچنین باکتری ها ممکن است به وسیله خون از یک محل دورتر عفونت یا از طریق انتشار مستقیم از راه یک فیستول از روده ها به سیستم ادراری وارد شوند. \n" +
                        "تظاهرات بالینی \n" +
                        "علائم و نشانه های متعددی با UTI همراه هستند . در حدود نیمی از بیماران دااری باکتریوری ، هیچ گونه علامتی ندارد . علائم و نشانه های UTI تحتانی بدون عارضه (سیستیت ) عبارتنداز: سوزش در هنگام ادرار کردن ،تکرار ادرار ف (دفع ادرار بیش از هر 3 ساعت )، فوریت در دفع ادرار ، ادرار شبانه (بیدار شدن در شب برای دفع ادرار )، بی اختیاری (بیدار شدن درشب برای دفع ادرار (و درد بالای عانه یا لگنی . خون در ادرار یا کمر درد نیز  ممکن است دیده شود. در افراد سالمند این نشانه ها کمتر شایع است (قسمت ملاحظات سالمندی  را ببینید . در بیماران مبتلا به UTIS عارضه دار ، علائم می تواند از باکتریوری بدون علامت تاسپسیس گرم منفی همراه با شوک متغیر باشد . UTIS عارضه دار اغلب از طیف گسترده  تری از ارگانیسم ها ناشی می شوند. بسیاری از موارد عفونت های سیستم ادراری همراه با سوند ، بدون  علامت هستند . به هر حال هر بیماری با سوند ادراری که به طور ناگهانی  دچار علائم و نشانه های شوک سپتیک شد باید از نظر سپسیس ادراری (انتشار عفونت از سیستم  ادراری به خون که موجب عفونت سیسمتیک می شود)بررسی شود \n" +
                        "ملاحظات سالمندی \n" +
                        "میزان بروز باکتریوری در افراد مسن با بالغین جوان تر متفاوت است . باکتریوری با افزایش  سن و ناتوانی افزایش می یابد و زنان اغلب بیش تر از مردان تحت تاثیر قرار می گیرند . UTIS شایع ترین علت سپسیس باکتریایی حاد در بیماران بالای 65 سال است . که در آن ها سپسیس گرم منفی  با مرگ و میر بالای 5% همراه است (نیکول 2009).\n" +
                        "متخصصین اختلالات  ادراری ، بیماران دارای باکتریوری بدون علامت زیادی را مشاهده میکنند و %20 از ان ها زنان بالای 65 سال هستند . در بیماران  مسن تر که در خانه سالمندان اقامت دارند ،25% تا50% از زنان و 15%تا40% از مردان  دارای باکتریوری مزمن هستند (داس ،پرلی ،تاول فو همکاران 2009)\n" +
                        "در افراد سالمند ،ابتلا به ناهنجاری های ساختمانی  ثانویه به کاهش تون مثانه و مثانه نوروژنیک ،(اختلال عملکرد مثانه )ثانویه به نوروپاتی خودمختار افراد دیابتی ،ممکن است از تخلیه کامل مثانه جلوگیری کرده و خطر UTIS بسیار بالا می رود .(مازی – یجورنسون و ماسرا،2011) . زنان سالمند اغلب تخلیه ناکامل مثانه دارند و دچار رکورد  ادرار  می شوند. در غیاب استروژن ،زنان یائسه مستعد  رشد و افزایش چسبندگی باکتری ها به واژن  و مجرای  ادرار هستند . استروژن خوراکی یا موضعی  موجب  بازسازی میزان گلی  کوژن سلول های اپی تلیال واژن و PH اسیدی در برخی از زنان یائسه دچار سیستیت عود کننده می گردد . فعالیت ضد باکتریایی ترشحات  پروستات که مردان را از تکثیر باکتریایی در مجرایادرار و مثانه محافظت می کند با افزایش  سن، کاهش پیدا می کند.گرچه UTIS در مردان کم تر شایع است،میزان شیوع عفونت در مردان مسن تر از 50 سال با زنان همان گروه سنی یکسان است .\n" +
                        "افزایش UTISدر مردان همراه با افزایش سن تا حدودی در نتیجه هیپرپلازی یا کارسینوم پروتستات، تنگی های مجرای ادرار و مثانه  نوروپاتیک است . استفاده از سوندگذاری یا سیستوسکوپی در ارزیابی و درمان نیز ممکن است  در شیوع بالاتر UTIS در این  گروه موثر  باشد. میزان باکتریوری در مردان مبتلا به گیجی، دمانس  و نیز  ممکن است در شیوع  بالاتر UTIS در این گروه موثر باشد. میزان  باکتریوری در مردان مبتلا به گیجی ، دمانس  و نیز بی اختیاری روده یا مثانه  افزایش  می یابد . شایع ترین علت بروز UTIS عودکننئه  در مردان سالمند ،پروستاتیت باکتریایی مزمن است . برداشتن غده  پروستات ممکن است  به کاهش بروز آن کمک کند. \n" +
                        "در مرکز نگهداری از بیماران  سالمند مانند مکانهایی که تشهیلات مراقبتی طولانی مدت ارائه می دهند،عوامل بیماری زا غالباً به بسیاری از آنتی بیوتیک ها  مقاوم هستند. عواملی را که ممکن است در دایجاد UTIS در بیماران  سالمند  در این محیط ها دخیل باشند فهرست کرده است . بهداشت دست ها به طور جدی، مراقبت دقیق ناحیه پرینه ، و استفاده از توالت به طور مداوم ممکن است میزان بروز UTIS را کاهش دهد.\n" +
                        "عوامل موثر در عفونت دستگاه ادراری در سالمندان \n" +
                        "•\t بروز  بالای چند بیماری مزمن\n" +
                        "•\tاستفاده مداوم از داروهای آنتی بیوتیک\n" +
                        "•\tوجود زخم های  فشاری  عفونی \n" +
                        "•\tاختلال  در سیستم  اییمنی \n" +
                        "•\tاختلالات شناختی\n" +
                        "•\tعدم تحرک و تخلیه ناکامل مثانه \n" +
                        "ارگالنیسم های ایجادکننده UTIS در مراکز نگهداری از سالمندان ممکن است با عوامل بیماری زایی که در بیماران سطح جامعه وجود دارند  متفاوت باشند . تصور می شود که علت آن استفاده  مداوم از داروهای آنتی بیوتیک  در بیماران مقیم  مراکز  نگهداری  طولانی  مدت از سالمندان می باشد . ایکولای شایع ترین  ارگانیسمی است  که در بیماران سالمند جامعه  یا بیمارستان  یدده می شود.  گرچه در بیماران دارای سوندهای موقت عامل UTIS به طور عمده ارگانیسم هایی مانند پروتئوس ،کلبسیلا پسنودوموناس یا استافیلوکوک است . بیمارانی که در گذشته یا آنتی بیوتیک درمان شده اند ممکن است  به گونه های انترئکئک آلوده شوند. عود عفونت در بیماران مسن شایع است .\n" +
                        "سایع ترین نشانه ذهنی (غیرقابل مشاهده) ،تغییر  در عملکرد شناختی ،به خصوص در افراد مبتلا به دمانس  (فراموش) است . زیرا این بیماران  به طور معمول ،حتی در ابتدای بروز UTIS، تغییرات شدید شناختی را نشان می دهند.\n" +
                        "در مورد ضرورت درمان باکتریوری بدون علامت  در بیماران سالمند مقیم خانه سالمندان اختلاف نظر وجود دارد، زیرا عواقب  ارگانیسم های مقاوم به آنتی بیوتیک ها و سپسیس در این بیماران می تواند خطرناک تر باشد . توصیه شده است که تنها هنگامی که علائم ایجاد شده اند آنتی بیوتیک ها تجویز شوند (هارت 2011) . به هر  حال برنامه درمانی درآن ها مانند بالغین جوان است ، گرچه تغییرات مرتبط با سالمندی جذب روده ای  داروها و کاهش عملکرد کلیوی و جریان کبدی و،لزوم تغییراتی در برنامه دارویی سالمندان را مطرح  می نماید.عملکرد کلیوی باید بررسی شود و دوز  داروها براساس آن تغییرات یابد .\n" +
                        "بررسی و یافته های  تشخیص :\n" +
                        "نتایج آزمایشات مختلف ،مانند شمارش کلونی ها، مطالعات سلولی  و نیز کشت های ادراری به تشخیصUTISکمک می کند درUTISبدون عارضه،زنجیره های  باکتریایی ، مشخص کننده نوع آنتی بیوتیک انتخابی خواهد بود(هارت ،2011)\n" +
                        "کشت های ادراری\n" +
                        " برای تشخیصUTI  مفید بوده  و وجود ارگانیسم اختصاص را تعیین می کند UTIS با وجود باکتری در کشت ادرارتشخیص داده می شود.شمارش حداقل 105واحد کولونی باکتری (CFU) در هر میلی  لیتر از نمونه تمیز وسط ادرار یا نمونه گرفته  شده از سوند ادراری ، معیار اصلی برای عفونت  است (اوشه ،2010).\n" +
                        "به هر حال UTI و عفونت های همراه آن می تواند، با تعداد کمتری کلونی باکتریال نیز رخ دهد. در حدود یک  سوم از زنانی که علائم عفونت حاد را دارند، نتایج کشت  نمونه وسط ادرار آن ها  منفی است و چنانچه ملاک مورد  استفاده جهت تعیین عفونت تعداد 105CFU/ML باشد ، ممکن است اینئ افراد بدون درمان باقی بمانند (اوشه ، 2010). وجود هر گونه باکتری در نمونه های اخذ شده از طریق آسپیراسیون سوزنی  بالای عانه ای مثانه یا سونداژ ادراری (وارد کردن لوله به داخل مثانه)، نشانه عفونت  خواهد بود.\n" +
                        "بیماران  زیر باید در صورت  وجود باکتریوری ،کشت ادراری انجام دهند :\n" +
                        "تمام مردان(به دلیل احتمال ناهنجاری های عملکردی یا ساختمانی)\n" +
                        "زنان با تاریخچه ضعف سیستم ایمنی یا مشکلات کلیوی \n" +
                        "بیماران دارای دیابت\n" +
                        "بیمارانی که اخیراً تحت وسیله گذاری دستگاه ادراری بوده اند ( شامل سونداژادراری )\n" +
                        "بیمارانی که اخیراً در بیمارستان بستری شده اند یا در خانه سالمندان زندگی می کنند .\n" +
                        "بیماران دارای علائم طولانی یا پایدار\n" +
                        "بیمارانی مبتلا به 3دوره یا بیشتر utisدر سال گذشته\n" +
                        "زنان بار دار\n" +
                        "زنان یائسه\n" +
                        "زنان فعال از نظر جنسی\n" +
                        "زنانی که شریک جنسی جدید داشته باشند .\n" +
                        "بررسیهای سلولی \n" +
                        "هماچوری میکروسکوپی درحدود نیمی از بیماران دارای utiحاد وجود دارد .(فصل 53 را ملاحظه نمایید )پیوری (وجود گلبول سفیدwbcدر ادرار در تمام بیماران مبتلا به utiرخ می دهد .به هر حال، این یافته ها برا عفونت های باکتریال،اختصاصی نیست. پیوری می تواند در سنگ های کلیوی ، نفریت بینا بینی می تواند در سنگ های کلیوی نیز دیده شود .\n" +
                        "سایر مطالعات\n" +
                        "تست های دیپ استیک شاما ل آزمایش برای wbcبه نام تست های لوکوسیت استراز و تست نیتریت معروف است. آزمایشاتی نیز به منظور تشخیص بیماری های منتقله از راه جنسی ممکن است انجام شود .زیرااورتریت حاد ایجاد شده توسط ار گانیسم های منتقله از راه جنسی ( مانند کلامیدیا ترا کو ماتیس ،نیسریا گنوره ا وهرپسس سیمپلکس) ویا التهاب و عفونت حاد واژن(ناشی از تریکوموناس و گونه های کاندیدا )علائمی شبیه به علائمutisایجاد می کنند.\n" +
                        "آزمایشات تشخیص مانند ctاسکن ذواولترا سو نو گرافی نیز ابزار های تشخیصی مفیدی هستند ct اسکن ممکن است پیلو نفریت یا ابسه ها را مشخص سازد و اولتراسونو گرافی برای تشخیص انسداد ، آبسه ها ، تومورها و کیست ها بسیار دقیق است .\n" +
                        "اولتراسو نو گرافی از راه رکتوم ( برای بررسی پروستات و مثانه) روش انتخابی در مردانی است که بهutiهای عود دکننده یا عارضه دار مبتلا می شوند .سیستویور تروسکوپی برای مشاهده میزنای یا تشخیص چسبند گی ،سنگ ها وتومورها استفاده می شود\n" +
                        "در مان طبی \n" +
                        "درمان utifبه طورخاص شامل دارویی و آموزش به بیمار است. پرستار به بیمار در مورد برنامه دارویی و راه های پیشگیری از عفونت آموزش می دهد .\n" +
                        "درمان دارویی حاد \n" +
                        "در مان ایده آل utiداروی آنتی باکتری است که بطور موثر و با ذحداقل اثرات بر روی فلور طبیعی رو ده ای و واژینال، باکتری ها ارا از دستگاه ادراری حذف کند و در نتیجه میزان بروز عفونت های قارچی واژن رابه حداقل برساند (واژینیت قارچی،25 از بیماران درمان دشده با آنتی بیو تیک که فلور وازن را تغییر می دهند، ایجاد می شود. واژینیت قار چی اغلب علائم بیشتری ایجاد می کند و درمان ان مشکل ترو پر هزینه تر از درمان uti ) به علاوه ، داروی انتی بیو تیک بایدقابل تهیه باشد و عوارض جانبی  محدودی فراهم کند و مقاومت کمی ایجاد کند .از ان جا که بیشترین عامل utiبدون عارضه درزنان ایکولای باکتری موجود در فلور طبیعی روده ای است، دارو باید بر علیهع این ارگانیسم موثر باشد .رژیم های درمانی مختلفی با موفقیت برای درمان utiتحتانی بدون عارضه در زنان  مورد استفاده قرارگرفته است. دارو درمانی تک دوز، رژیم های دارویی کوتاه مدت(3تا4 روزه )یا رژیم های 7-10روزه (الووات ،2010)،درمان  عفونت های ادراری بدون عارضه به سمت رژیم های درمانی کوتاه مدت پیش می رود چرا که اغلب آنها پس از 3 روز درمان بهبود می یابند .بیمارانی که در خانه سالمندان زندگی می کنند   ممکن است جهت درمان مفید و موثر به 7تا 10 روز دارو درمانی نیاز داشته باشند. داروهایی که معمولا در درمان utiمورد استفاده قرار می کیرند در جدول1-55 فهرست شده اند . صرف نظر از رژیم دارویی ، به بیمارتوصیه شود حتی اگر نشانه ها به سرعت برطرف شوند نیز تمام دوز دارو تجویز شده را مصرف نمایند .دوره های طولانی درمان برای مردان ،زنان  باردارو زنان مبتلا ب پیلو نفریت و سایر انواع utisعارضه دار کاربرد دارد.گاهی بستری شدن در بیمارستان و آنتی بیو تیک های داخل وریدی مورد نیاز می باشد \n" +
                        "درمان دارویی طولانی مدت\n" +
                        "  گر چه  درمان دارویی کوتاه مدتutiبرای 30روز معمولا در زنان کافی است ،عفونت در حدود 20 از زنانی که برای utisبدون عارضه درمان شده اند ،عود می کند. عفونت هایی که طی 2 هفته پس از درمان عود می کنند، به علت باقی ماندن ارگانیسم های اولیه است .موارد عود کننده به علت این است که منبع باکتریوری در دستگاه ادراری فوقانی بوده ویا درمان اولیه ناکافی یا کوتاه مدت بوده است .\n" +
                        "درمان های عود کننده در مردان معمولا به علت باقی ماندن همان ار گانیسم قبلی است :بررسی و درمان بیشتر ضرئریت دارد.\n" +
                        "ایجاد عفونت با یک باکتری جدید،علت بیش از 90عفونت های عود کننده  دستگاه ادر اری  در زنان است (کولگان ویلیامز،جانسون ،2011)اگر پس از بررسی های تشخیصی ، هیچ گونه ناهنجاری ساختاری  در دستگاه ادراری مشاهده نشد،زنان مبتلا به utis عود کننده می توانند خود درمانی انجام دهند وتنها زمانی که علائم پایدار بمانند.تب ایجاد می شود ،یا تعداد دوره های درمان بیشتر از چهار بار در طی 6ماه می باشدبه پزشک مراجعه نمایند .می توان به بیمار آموزش داد که از نوار کشت برلی تشخیص وجور باکتری استفاده نماید .\n" +
                        "  اگر  پس از کامل شدن درمان انتی بیوتیکی ، عفونت عود کند یک دوره کوتاه (4-3 روزه ) دیگر مصرف آنتی بیوتیک و به دنبال  ان یک دوز منظم شابنه و در صورت عدم عود به صورت یک شب در میان بر ای 6 تا7 ماه تجویز می شود. مصرف طولانی  آنتی بیوتیک ها  خطر عفونت مجدد را کاهش داده  و می تواند برای خطر عفونت  مجدد  را کاهش داده  و می تواند برای بیماران مبتلا به عفونت های عود کننده تجویز شود.\n" +
                        "اگر باکتری های به جا مانده از قبل  سبب عود عفونت شده اند ،(مانند سنگ های  کلیوی و آبسه )  چنانچه  علل شناخته شده اند باید درمان شوند.\n" +
                        "پس از درمان و استریل شدن ادرار، اغلب درمان پیشگیرانه با دوز پایین (تری متوپریم همراه و با بدون  سولفامتوکسازول)هرشب هنگام خواب توصیه می شود.  شواهد موجود در مورد  اثر بخشی مصرف روزانه آب کرن بری (نوعی زغال اخته) برای پیشگیری از UTIS،قطعی نمی باشد( استاپلتون ،زیورا،هوتون و همکاران ،2010) بیمارانی که آب کرن بری دوست دارند را می توان به افزودن آن مایعات مصرفی روزانه خود به علت اثرات محافظت کننده احتمالیش تشویق کرد.\n" +
                        "فرایند پرستاری\n" +
                        "بیمار دارای عفونت دیتگاه ادراری تحتانی\n" +
                        "مراقبت پرستاری از بیمار مبتلا به عفونت سیستم ادراری تحتانی به درمان عفونت زمینه ای و پیشگیری عود آن تمرکز دارد\n" +
                        "برسی:\n" +
                        "از بیمار مشکوک بهUTI تاریخچه ای از علائم نشانه ها اخذ می گردد وجود  درد، تکرار ادرار ،فوریت در دفع ادرار ، تاخیر و تغییر در ادرار برسی ، تایید و گزارش می شود. جهت تعیین عواملی که بیمار را مستعد UTI نموده است ، الگوی دفع ادرار معمول بیمار برسی میگردد. عدم تخلیه همیشگی مثانه، همراه بودن علائم UTIبا مقاربت جنسی ، روش های پیشگیری از بارداری ، و بهداشت فردی مورد برسی قرار می گیرند. آگاهی بیمار از دارو های آنتی بیوتیکی تجویز شده ، و مراقبت های بهداشتی پیشگیرانه نیز برسی میگردند . به علاوه ادرار از نظر حجم ، رنگ ، غلظت ، گدر بودن و بو ارزیابی می شود ، که تمام این موارد به وسیله باکتری در دستگاه ادراری تغییر میابند.\n" +
                        "تشخیص:\n" +
                        "تشخیص های پرستاری\n" +
                        "براساس اطلاعات حاصل از برسی ، تشخیص های پرستاری می تواند شامل موارد زیر باشد:\n" +
                        "•\tدرد حاد در ارتباط با عفونت دستگاه ادراری \n" +
                        "•\tکمبود آگاهی در مورد عوامل مستعد کننده بیمار به عفونت  عود بیماری ، شناخت و پیشگیری از عودف و درمان دارویی\n" +
                        "\n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.addToBackStack(null);
                transaction.commit();

            }
        });

        btn5.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("گاسترو آنتریت ");
                fragment.SetBody("گاسترو آنتریت\u200C عبارت\u200C است\u200C از آزردگی\u200C و عفونت\u200C لوله\u200C گوارش\u200C که\u200C غالباً می\u200Cتواند باعث\u200C به\u200C هم\u200C خوردن\u200C ناگهانی\u200C و گاهی\u200C شدید وضعیت\u200C گوارشی\u200C شود. گاستروآنتریت\u200C ممکن\u200C است\u200C با کولیت\u200C اسپاستیک\u200C اشتباه\u200C گرفته\u200C شودگاستروآنتریت\u200C در تمام\u200C سنین\u200C روی\u200C می\u200Cدهد اما در کودکان\u200C کم\u200C سن\u200C و سال\u200C (5-1 سال\u200C) و افراد بالای\u200C 60 سال\u200C شدیدتر است\u200C. \n" +
                        "  علایم\u200C شایع\u200C\n" +
                        "تهوع\u200C و گاهی\u200C استفراغ\u200C\n" +
                        "اسهال\u200C که\u200C می\u200Cتواند از روزانه\u200C 3-2 بار اجابت\u200C مزاج\u200C شل\u200C تا تعداد زیادی\u200C اجابت\u200C مزاج\u200C آبکی\u200C متغیر باشد.\n" +
                        "دل\u200Cپیچه\u200C، درد، یا حساس\u200C بودن\u200C شکم\u200C هنگام\u200C لمس\u200C\n" +
                        "بی\u200Cاشتهایی\u200C\n" +
                        "تب\u200C\n" +
                        "ضعف\u200C \n" +
                        "علل\u200C:\n" +
                        "انواع\u200C مختلفی\u200C از ویروس\u200Cها، باکتری\u200Cها، یا انگل\u200Cها که\u200C غذا یا آب\u200C را آلوده\u200C می\u200Cکنند.\n" +
                        "مصرف\u200C مسهل\u200Cهای\u200C قوی\u200C\n" +
                        "تغییر در باکتری\u200Cهایی\u200C که\u200C معمولاً در روده\u200Cها وجود دارند.\n" +
                        "وجود سموم\u200C شیمیایی\u200C در بعضی\u200C گیاهان\u200C، غذاهایی\u200C دریایی\u200C، یا غذاهای\u200C آلوده\u200C\n" +
                        "مسمومیت\u200C با فلزات\u200C سنگین\u200C \n" +
                        "\n" +
                        "عوامل\u200C افزایش\u200C دهنده\u200C خطر: \n" +
                        "افراد بالای\u200C 60 سال\u200C\n" +
                        "نوزادان\u200C یا شیرخواران\u200C\n" +
                        "رژیم\u200C غذایی\u200C نامناسب\u200C\n" +
                        "سوء مصرف\u200C الکل\u200C\n" +
                        "مصرف\u200C داروهای\u200C مثل\u200C آسپیرین\u200C، داروهای\u200C ضد التهابی\u200C غیراستروییدی\u200C، آنتی\u200Cبیوتیک\u200Cها، مسهل\u200Cها، داروهای\u200C کورتیزونی\u200C، یا کافئین\u200C\n" +
                        "مسافرت\u200C به\u200C مناطق\u200C نامناسب\u200C از نظر بهداشتی\u200C \n" +
                        "  پیشگیری\u200C:\n" +
                        "اگر شما یا یکی\u200C از اطرافیان\u200C گاستروآنتریت\u200C دارید، دستان\u200C خود را مرتب\u200C بشویید.\n" +
                        "هر چقدر که\u200C می\u200Cتوانید از علل\u200C و عوامل\u200C خطری\u200C که\u200C در بالا ذکر شد اجتناب\u200C کنید.\n" +
                        "به\u200C هنگام\u200C آماده\u200C کردن\u200C غذا بهداشت\u200C را رعایت\u200C کنید. \n" +
                        "  عواقب\u200C مورد انتظار:\n" +
                        "استفراغ\u200C و اسهال\u200C معمولاً در عرض\u200C 5-2 روز برطرف\u200C می\u200Cشود، اما بزرگسالان\u200C ممکن\u200C است\u200C تا یک\u200C هفته\u200C دچار ضعف\u200C و خستگی\u200C باشند. \n" +
                        "عوارض\u200C احتمالی\u200C \n" +
                        "کم\u200Cآبی\u200C جدی\u200C که\u200C نیازمند سرم\u200C باشد.\n" +
                        "وجود یک\u200C بیماری\u200C جدی\u200C غیر از گاستروآنتریت\u200C که\u200C به\u200C دلیل\u200C شباهت\u200C علایم\u200C گاستروآنتریت\u200C به\u200C علایم\u200C آن\u200C، ممکن\u200C است\u200C با گاستروآنتریت\u200C اشتباه\u200C گرفته\u200C شود. \n" +
                        "  درمان:\n" +
                        " اصول\u200C کلی\u200C: \n" +
                        " اقدامات\u200C تشخیصی\u200C ممکن\u200C است\u200C شامل\u200C آزمایش\u200C خون\u200C و مدفوع\u200C باشد.\n" +
                        "درمان\u200C معمولاً حمایتی\u200C است\u200C (استراحت\u200C، مایعات\u200C(\n" +
                        "موارد خفیف\u200C نیازی\u200C به\u200C بستری\u200C ندارند و در منزل\u200C درمان\u200C می\u200Cشوند.\n" +
                        "لزومی\u200C ندارد افرادی\u200C که\u200C گاستروآنتریت\u200C دارند از بقیه\u200C جدا شوند.\n" +
                        "بستری\u200C شدن\u200C در صورتی\u200C که\u200C کم\u200C آبی\u200C شدید باشد. \n" +
                        "  داروها:\n" +
                        "معمولاً هیچ\u200C دارویی\u200C مورد نیاز نیست\u200C، اما اگر گاستروآنتریت\u200C شدید یا طولانی\u200Cمدت\u200C باشد، امکان\u200C دارد داروی\u200C ضد تهوع\u200C و ضد اسهال\u200C تجویز شود. امکان\u200C دارد برای\u200C بعضی\u200C از باکتری\u200Cها و انگل\u200Cها درمان\u200C آنتی\u200Cبیوتیکی\u200C اختصاصی\u200C مورد نیاز باشد. \n" +
                        "فعالیت\u200C:\n" +
                        "تا زمانی\u200C که\u200C تهوع\u200C، استفراغ\u200C، اسهال\u200C و تب\u200C برطرف\u200C نشده\u200C باشند در رختخواب\u200C استراحت\u200C کنید. \n" +
                        "\n" +
                        "\n" +
                        "رژیم\u200C غذایی\u200C:\n" +
                        "مرتباً قطعات\u200C یخ\u200C بمکید یا مقدار کمی\u200C از مایعات\u200C رقیق\u200C بنوشید.\n" +
                        "پس\u200C از متوقف\u200C شدن\u200C اسهال\u200C و استفراغ\u200C، مقادیر کمی\u200C از مایعات\u200C رقیق\u200C مثل\u200C چای\u200C، سودا، سوپ\u200C رقیق\u200C، یا ژلاتین\u200C بنوشید.\n" +
                        "اگر تا 12 ساعت\u200C با مایعات\u200C مشکلی\u200C پیش\u200C نیامد، مقادیر کمی\u200C از غذاهای\u200C نرم\u200C مثل\u200C غلات\u200C، برنج\u200C، تخم\u200Cمرغ\u200C، یا سیب\u200Cزمینی\u200C پخته\u200C شده\u200C، و ماست\u200C بخورید.\n" +
                        "اگر تا 3-2 روز با غذاهای\u200C نرم\u200C مشکلی\u200C پیش\u200C نیامد، تدریجاً رژیم\u200C عادی\u200C خود را از سر گیرید. \n" +
                        "از خوردن\u200C یا آشامیدن\u200C موارد زیر تا چند روز بعد از خودداری\u200C کنید: غذاهای\u200C پر ادویه\u200C (پیتزا، اسپاگتی\u200C، پیاز)، سس\u200C گوشت\u200C، سبزیجات\u200C و میوه\u200Cهای\u200C خام\u200C، سس\u200C سالاد، قهوه\u200C و شیر\n" +
                        ". در این\u200C شرایط\u200C به\u200C پزشک\u200C خود مراجعه\u200C نمایید:\n" +
                        "اگر علایم\u200C گاستروآنتریت\u200C بیش\u200C از دو روز طول\u200C بکشد.\n" +
                        "اگر یکی\u200C از موارد زیر هنگام\u200C درمان\u200C رخ\u200C دهد:\n" +
                        "ـ وجود مخاط\u200C یا خون\u200C در اجابت\u200C مزاج\u200C\n" +
                        "ـ تب\u200C 3/38 درجه\u200C سانتیگراد یا بالاتر\n" +
                        "ـ تورم\u200C شکم\u200C\n" +
                        "ـ درد شدید در شکم\u200C یا راست\u200C روه\u200C، خصوصاً دردی\u200C که\u200C از وسط\u200C شکم\u200C شروع\u200C شود و تدریجاً به\u200C قسمت\u200C پایینی\u200C شکم\u200C در سمت\u200C راست\u200C تغییر مکان\u200C دهد\n" +
                        "- اگر استفراغ\u200C و اسهال\u200C پس\u200C از درمان\u200C مجدداً بازگردند.\n" +
                        "- اگر علایم\u200C کم\u200Cآبی\u200C مثل\u200C خشکی\u200C دهان\u200C، پوست\u200C چروکیده\u200C، تشنگی\u200C زیاد، یا کاهش\u200C ادرار به\u200C وجود آیند. \n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.addToBackStack(null);
                transaction.commit();

            }
        });



        showBackButton();
        return v;
    }
    public void showBackButton() {
        if (getActivity() instanceof MainActivity) {
            ((MainActivity) getActivity()).getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        }
    }

}
