package com.example.nazanin.hospitalapp.Illness;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentTransaction;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;

import com.example.nazanin.hospitalapp.R;


public class IllnessFogh extends Fragment {
    Button btn1, btn2 , btn3, btn4, btn5, btn6;



    public static IllnessEye newInstance() {
        IllnessEye fragment = new IllnessEye();

        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_illness_fogh, container, false);
        btn1 = v.findViewById(R.id.btn_artrit);
        btn2 = v.findViewById(R.id.btn_kron);
        btn3 = v.findViewById(R.id.btn_khunriziGovareshi);
        btn4 = v.findViewById(R.id.btn_diabet);
        btn5 = v.findViewById(R.id.btn_sekteGhalbiFogh);
        btn6 = v.findViewById(R.id.btn_siruz);



        btn1.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("آرتریت یا التهاب مفصل");
                fragment.SetBody("آرتریت یا التهاب مفصل حالتی است که سبب ایجاد درد\n" +
                        " و سفتی در مفصل می شود و تورم قرمزی و گرمی در \n" +
                        "اطراف مفصل ایجاد می کند.در موارد شدید ممکن است تغییر شکل مفصل نیز دیده شود.\n" +
                        "انواع مختلفی از آرتریت وجود دارد که دو نوع شایع تر آن،استئوآرتریت و آرتریت روماتوئید است.هر دو نوع در زنان بیشتر از مردان مشاهده می شود .\n" +
                        "چگونه آرتریت ایجاد می شود؟\n" +
                        "استئوآرتریت بیماری در غضر وف مفاصلی است که به لیل فرسایش ساییدگی غضروف ایجاد می شود . غضروف ،قسمت نرم مفصل است که انتهای استخوانها را می پوشاندو حرکت استخوانها را روی هم آسان می کند.\n" +
                        "اگر غضروف ،سائیده یا فرسوده شوداستخوانها بر روی هم سائیده می شوند ودر نتیجه مفصل تحریک شده و ملتهب می شود .\n" +
                        "گاهی این تحریکات باعث رشد غیر طبیعی استخوان می شود و برآمدگیهایی روی استخوان ایجاد میکند که سبب تورم استخوان می شود و استئوآرتریت بیشتر در زانو ها ،کمر ،لگن و انگشتان دیده می شود.\n" +
                        "علایم بیماری اغلب سنین چهل تا پنجاه سالگی شروع می شود وشامل درد ،محدودیت حرکتی سر و صدای مفصل می باشد اما گاهی  ممکن است که هیچ علامتی دیده نشود.\n" +
                        "آرتریت روماتوئید یک بیماری خود ایمنی است (این بدین معنی است که دفاع بدن در مقابل بافت طبیعی خود بدن اکنش نشان می دهد و به آن حمله می کند.( آرتریت روماتوئید سبب آسیب سطح داخلی مفصل می شود .\n" +
                        "آرتریت روماتوئید ،در ابتدای سن بزرگسالی یا میانسالی شروع می شود و باعث قرمزی،تورم و بدشکلی مفاصل می شود و معمولاً مفاصل دست ،زانو و پاها را  تحت تأثیر درگیر می کند.\n" +
                        "آرتریت روماتوئید علاوه بر آسیب به مفاصل در برخی موارد می تواند به اندام های دیگر بدن مانند پوست چشم ها ،ریه ها و عروق خونی نیز آسیب برساند.\n" +
                        "علائم آرتریت چیست؟\n" +
                        "•\tشروع آهسته و ناگهانی دارد و علائم معمولاً به صورت قرنیه و دو طرفه می باشد.\n" +
                        "•\tقرمزی و تورم مفاصل\n" +
                        "•\tخستگی تب و کاهش وزن\n" +
                        "•\tمحدودیت حرکتی یا سختی مفاصل بخصوص موقع صبح که معمولاً چندین ساعت طول می کشد.\n" +
                        "•\tبدشکلی مفاصل\n" +
                        "•\tبيرون آمدگی توده های سخت از بافت زیر پوست(ندول آرتریت روماتوئید)که در 25 درصد بیماران ظاهر می شود ،معمولا روی برجستگی های استخوانی مانند آرنج ظاهر می شوند.\n" +
                        "\n" +
                        "\n" +
                        "عوامل خطر:\n" +
                        "عواملی که می تواند باعث افزایش خطر ابتلا به بیماری آرتریت روماتوئید شوند شامل موارد زیر می باشد.\n" +
                        "•\tجنسیت ،ابتلا به این بیماران در زنان بیشتر از مردان است.\n" +
                        "•\tسن،بیماری در هر سنی می تواند رخ دهد اما معمولا بین سنین 30تا60 سالگی بروز می کند\n" +
                        "•\tسابقه خانوادگی: اگر یکی از اعضاء خانواده شما مبتلا به آرتریت روماتوئید می باشد احتمال ابتلا شما بیشتر می شود.\n" +
                        "•\tاسترس عاطفی نیز باعث شعله ور شدن بیماری می شود.\n" +
                        "تشخیص:\n" +
                        "•\tعلائم و نشانه های شما و معاینه فیزیکی توسط پزشک\n" +
                        "•\tانجام آزمایشات خون زمانی که التهاب در بدن بالا می رود این آزمایشات نیز مقدارش بالا می رود (مثل ESR و CRP و RFو...)\n" +
                        "اندازه گیری فاکتور روماتوئید (RF) که در 80درصد موارد درآرتریت روماتوئید مثبت میشود و هرچه عدد آن بالاتر باشد میزان التهاب نیز بیشتر خواهد بود.\n" +
                        "تصویر داری از طریق اشعه ایکس نیز در تشخیص کمک کننده می باشد.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "عوارض:\n" +
                        "ارتریت روماتوئید باعث افزایش خطر ابتلا به بیماری های زیر می شود.\n" +
                        "•\tپوکی استخوان ،خود ارتریت روماتوئید و داروهای که برای این بیماری استفاده میشوند باعث افزایش خطر ابتلا به پوکی استخوان می شود پوکی استخوان بیماری است که استخوان را تضعیف کرده و آنها را مستعد شکستگی می کند\n" +
                        "•\tسندرم کانال مچ دست (سندرم تونل کارپ) اگر آرتریت روماتوئید به مچ دست  شما آسیب  وارد کند  التهاب می تواند به اعصاب دست و انگشتان شما فشار وارد کند.\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "•\tبیماری های قلبی ، آرتریت روماتوئید می تواند خطر سخت شدن و انسداد شریان های و نیز التهاب پرده اطراف قلب را افزایش دهد.\n" +
                        "•\tبیماری های ریوی ،دربیماران مبتلا به آرتریت روماتوئید خطرالتهاب و سخت شدن بافت ریه افزایش می یابد که می تواند منجر به تنگی نفس شود.\n" +
                        "درمان\n" +
                        "منظور از درمان این بیماری کاهش تورم ،کاهش یا توقف تخریب مفاصل و در مجموع بهتر کردن کیفیت زندگی می باشد\n" +
                        "\n" +
                        "روشهای درمانی مورد استفاده در بیماری آرتریت\n" +
                        "* شامل تغییر شیوه زندگی\n" +
                        "* استفاده از داروها\n" +
                        "* روشهای درمانی دیگر نظیر فیزیوتراپی،کاردرمانی ،وسایل کمک کننده به مفصل و وسایل کمک حرکتی می باشد.\n" +
                        "چند توصيه در آرتريت روماتوئيد \n" +
                        "1- استراحت و ورزش که هر دو در اين بيماري با اهميت هستند . بيماران نياز به تناسب خوبي بين استراحت و ورزش خود دارند . در زماني که بيماري فعال است استراحت بيشتر و هنگامي که غير فعال است ورزش بيشتر توصيه مي شود . \n" +
                        "2- استرس هاي روحي نقش مهمي در ايجاد اين بيماري دارند ، وجود اين استرس ها روند بيماري را بدتر مي نمايند . \n" +
                        "3- مبتلايان به اين بيماري اگر چاق هستند بايد وزن خود را کم کنند . زيرا چاقي باعث وارد آمدن فشار به مفصل مي شود . \n" +
                        "4- حتي اگر مفصلي بر اثر اين بيماري معلول شده باشد بايد آن را بطور غير فعال ( بدون استفاده از عضلات حرکت دهنده آن مفصل ) حرکت داد تا از انقباش دائمي و جمع شدگي عضلات جلوگيري شود . \n" +
                        "5- گاهي استفاده از آتل هاي مخصوص براي کوتاه مدت مي تواند تورم درد مفاصل درگير را کاهش دهد . \n" +
                        "6- بعضي از بيماران معتقدند آب و هواي مرطوب وضع بيماري آنها را بدتر مي کند . ولي شاهد علمي کافي براي اين موضوع وجود ندارد . \n" +
                        "7- متخصصان تغذيه توصيه مي کنند بيماران مبتلا به آرتريت روماتوئيد گوشت قرمز را بيشتر از دو بار در هفته استفاده نکنند . \n" +
                        "8- رژيم غذايي مردم نواحي مديترانه بر پايه ميوه ، سبزي ، غلات کامل ، آجيل ، دانه هاي خوراکي و ماهي و زيتون باعث کاهش التهاب مفاص مي شوند . \n" +
                        "9- امگا 3 که در روغن ماهي ، دانه کتان و روغن کانولا و دانه هاي خوراکي مثل گندم و سويا يافت مي شود . مي تواند در کاهش التهاب نقش موثري داشته باشد . \n" +
                        "10- گفته مي شود داروهاي گياهي مانند زنجبيل ، زرد چوبه ، آلوورا ، دانه کتان ، چاي سبز ، زعفران ، گزنه و کرفس نيز مي تواند در کاهش التهاب ها کمک کنند . \n" +
                        "11- چاي سبز ، فلفل شيرين و انگور قرمز در درمان روماتيسم مفيدند \n" +
                        "تحقيقات نشان مي دهد که احتمال ابتلا به روماتيسم مفصلي در زناني که به کودکان خود شير مي دهند 30 تا 50 درصد کمتر مي باشد \n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.commit();

            }
        });

        btn2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("بيماری کرون (آنتریت ناحيه ای)");
                fragment.SetBody("یک بیماری التهابی است که لایه های دیواره ی روده را گرفتار می کند. این تغییرات بیشتر ایلئوم (قسمت پایین روده کوچک  )وبا شیوع کمتر در روده بزرگ   (قسمت بالارونده روده بزرگ  )ایجاد می شود  ولی می تواند در هر قسمت از دستگاه گوارش ایجاد شود. در هر سنی رخ می دهد بیشتر در گروه سنی 15 الی 30 و 50 تا 70 سال ظاهر می شوند0 ابتلاء در زن و مرد یکسان است. \n" +
                        "علت بيماری کرون چيست؟ \n" +
                        "علت بروز بیماری ناشناخته است.ولی به نظر میرسد سه عامل :ژنتیک، محیط، و اختلال سیستم ایمنی در ایجاد و تشدید آن نقش اساسی دارند. :\n" +
                        "1 -عوامل محیطی :  حشره کش ها،افزودنی مواد غذایی ،مصرف سیگار،اشعه،داروهای ضدالتهاب غیراستروئیدی،عفونت باکتریایی \n" +
                        " 2 –ژنتیک:  سابقه خانوادگی بیماری کرون \n" +
                        " 3 –اختلال سیستم ایمنی:  واکنش های غیرطبیعی سیستم ایمنی بدن به بعضی موادغذایی و باکتریها درایجادآن نقش دارد. \n" +
                        "روند ایجاد بيماری:\n" +
                        " درخود مستعد(سابقه خانوادگی مثبت)در هنگام مواجهه با عوامل شروع کننده بیماری مانند عفونت باکتریایی،آلرژی غذایی، سیگارباعث ایجاد یک واکنش التهابی در مخاط روده شده که باعث تورم و ضخیم شدن مخاط شده و زخم ها بر روی مخاط ملتهب ظاهرمیشود\n" +
                        "\n" +
                        "\n" +
                        "زخم ها جدا از یکدیگر قرار می گیرند و حدفاصل این زخم بافت طبیعی وجود دارد. در نیمی از بیماران در مراحل پیشرفته مخاط روده ظاهری شبیه به قلوه سنگ پیدا میکند \n" +
                        "علائم و نشانه های بیماری کرون چیست؟\n" +
                        "\uF0D8\tدرد شکمی همراه با دل پیچه خصوصا پس از  خوردن غذا (درد در قسمت پایین شکم در سمت راست که با آپاندیسیت ممکن است اشتباه شود.) \n" +
                        "\uF0D8\tسوء تغذیه ،کاهش وزن وکم خونی (برای اجتناب از درد، بیمار مصرف غذای خود را محدودمیکند) اسهال آبکی واسهال چرب \n" +
                        "\uF0D8\tتهوع و استفراغ و نفخ شکم \n" +
                        "\uF0D8\tحساس بودن شکم درلمس \n" +
                        "\n" +
                        "عوارض احتمالی بيماری کرون چيست؟\n" +
                        " \tپیدایش فیستول ( ایجاد غیرطبیعی راهی نی مانند از داخل روده به قسمتها و اعضاء دیگر بدن ) بین روده و مثانه\n" +
                        " \tخونریزی و کم خونی\n" +
                        " \tآبسه اطراف راست روده\n" +
                        " \tکمبود ویتامین ب12\n" +
                        " \tاختلالات کلیوی\n" +
                        " \tسوء تغذیه\n" +
                        " \tافزایش استعداد ابنلا به سرطان ایلئوم\n" +
                        " \tدرد و التهاب مفاصل\n" +
                        " \tالتهاب چشم\n" +
                        " \tانسداد روده\n" +
                        " \tسوراخ شدن روده ملتهب\n" +
                        "راههای تشخيص بيماری کرون چيست؟ \n" +
                        "•\tشرح حال بیمار \n" +
                        "•\tآزمایش مدفوع ( وجود خون مخفی و چربی زیاد)،آزمایشات خون (بررسی از نظر کم خونی، وجود التهاب وکاهش میزان آلبومین و پروتئین درخون )\n" +
                        "•\tعکس برداری از روده بزرگ و کوچک با اشعه ایکس \n" +
                        "بعدازخوردن ماده حاجب باریوم (باریوم سوالا) ،مهمترین روش قطعی تشخیص بیماری کرون میباشد \n" +
                        "•\tکولونوسکوپی: دیدن داخل روده بزرگ با یک وسیله فیبرواپتیک انعطاف پذیر که سر آن منبع نور قرار دارد. \n" +
                        "•\tآندوسکوپی\n" +
                        " درمان بیماری کرون: \n" +
                        "هدف از درمان کاهش التهاب روده ، بهبود علائم، سرکوب واکنش های نامناسب سیستم ایمنی، استراحت دادن بیمار است\n" +
                        "درمان داروئی:\n" +
                        " داروهای ضددرد • داروهای ضداسهال • داروهای ضدالتهاب(سولفاسالازین و سالامین برای بهبود التهاب و جلوگیری از عود بیماری در دراز مدت استفاده میشود. ) آنتی بیوتیکها (مترونیدازول) استفاده از استروئید ها ( پردنیزولون) تعدیل کننده های سیستم ایمنی (آزاتیوپرین، سیکوسپورین و...) در بیمارانی که به داروهای دیگر جواب نمی دهند و همچنین جهت پیشگیری از عود آن به کارمیرود. (معمولا داروها تا زمان کاهش علائم بیماری ادامه دارد)\n" +
                        " فعالیت در زمان ابتلا به بیماری:\n" +
                        " به هنگام حمله حاد بیماری،روی تخت یا صندلی استراحت کنید. \n" +
                        "تنها برای توالت،حمام، یاخوردن ازجا برخیزید.\n" +
                        " به هنگام فواصل بین حملات، فعالیتهای خود را تا حد امکان از سرگیرید. \n" +
                        "رژیم غذایی در بيماری کرون:\n" +
                        " برای کاهش التهاب،کنترل درد و اسهال و تامین نیازهای غذایی نکات زیرتوصیه میشود. \n" +
                        "-رژیم کم باقیمانده یا محدود از فیبرمیتوانددربهبود این بیماری موثرباشد(میوه ها وسبزیجات مواد غذایی فیبردار هستند).\n" +
                        " -رژیم غذایی پر پروتئین و پر کالری همراه با جایگزین های ویتامین وآهن استفاده کنید. \n" +
                        "-بهتر است وعده های غذایی را در دفعات بیشترو حجم کمترمصرف کنید\n" +
                        " -اگر آلرژی احتمالی به مواد غذایی دارید، شیر،گندم،تخم مرغ،آجیل وسایر غذاهای مشکوک را از رژیم غذایی خود حذف کنید.\n" +
                        " -محرک هایی مانند قهوه، الکل،ادویه جات وسیگار و خوردن غذای سرد اجتناب کنید. \n" +
                        "-کاهش مقدار چربی در رژیم غذایی کمک کننده  است بنابراین غذاهای چرب،سرخ کردنی،سس های چرب،خامه وکره پرهیزنمایید.\n" +
                        " لیوان آب بنوشید \n" +
                        "-روزی حداقل از غذاهای حاوی فیبر زیاد مانند پاپ کرن(ذرت بوداده ، تخمه ها، حبوبات، مغز های خوراکی وسبوس ،) دوری کنید.\n" +
                        " -دریافت منابع پتاسیم مانندسیب زمینی،موز، و... در  دوره اسهال توصیه میشود. \n" +
                        "عواقب مورد انتظار در بيماری کرون \n" +
                        "معمولا حملات در اوایل 20 سالگی آغاز می شوند و ممکن است برای سال ها ادامه یابند. \n" +
                        "فواصل ببن حملات از چند ماه تا چند سال متغیر  است.گاهی علایم فقط تنها یک یا دوبار بروز می کنند و بعد  از آن بیماری ناپدید می شود. اگر برای درمان شما به جراحی نیاز پیدا شود، این کار ممکن است وضعیت شما را بهبود ببخشد و پیشرفت بیماری را برای سال ها به تعویق اندازد. اما باید توجه داشته باشید که علی رغم انجام جراحی احتمال عود بیماری وجود دارد. این بیماران دارای یک زندگی طبیعی هستند. فعالیت و بچه های آنها طبیعی است اما در کل، این بیماری می تواند طول عمر را کم کند\n" +
                        "علائم هشدار دهنده\n" +
                        " اگر شما یا یکی از اعضای خانواده تان علائم بیماری کرون را دارید. اگر اجابت مزاج شما سیاه و قیری است یا در آن خون وجود دارد. اگر شکم شما متورم شده است. ویا تب دارید به پزشک مراجعه نمایید.\n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.commit();

            }
        });

        btn3.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("خونريزي گوارشي");
                fragment.SetBody("خونريزي گوارشي در اثر صدمه و آسيب موضعي ايجاد ميشود و موجب زخم مخاط دستگاه گوارش ميگردد. خونريزيهاي گوارشي به دو دسته با منشاء فوقاني و تحتاني تقسيم ميشوند. \n" +
                        "علل شايع خونريزي گوارشي : \n" +
                        " \tزخم هاي معده و دوازده\n" +
                        " \tواريس هاي گوارشي \n" +
                        " \tآسيب هاي مخاط معده و اثني عشر\n" +
                        " \tبيماريهاي التهابي مري و بد خيمي ها \n" +
                        " \tبيماريهاي التهابي مري و بد خيمي ها \n" +
                        " \tسوء مصرف از آسپرين و داروهاي ضد التهاب غير استروئيدي (ايبوپروفن ، ناپروکسن ، ديکلوفناک ، پيروکسيکام ، ايندومايسين ، مفناميک اسيد ، سيلوکسيب و نيکوتين ) \n" +
                        " \tناهنجاري هاي خوني \n" +
                        " \tتروما و ضربه \n" +
                        " \tعفونت هليکوباکترپيلوري\n" +
                        "علائم خونريزي گوارشي  \n" +
                        " \tاستفراغ خون روشن با موادي با زمينه قهوه اي که نشانه خونريزي قسمت فوقاني دستگاه گوارش است .\n" +
                        " \tمدفوع قيري و بد بو ، اين نوع مدفوع که ملنا نام دارد بر وجود خون حداقل به مدت 14 ساعت در دستگاه گوارش دلالت دارد . \n" +
                        " \tخون قرمز و روشن در مدفوع که بيشتر مربوط به خونريزي قسمت تحتاني گوارش است . \n" +
                        " \tخونريزي مخفي دستگاه گوارش که در آزمايشات اختصاصي مربوط به مدفوع تشخيص داده مي شود . که با علائم کاهش وزن و کم خوني مزمن همراه است . \n" +
                        " \tعلائم کم خوني مثل خستگي ، سياهي چشم ، درد قفسه سينه يا تنگي نفس ، افت فشار خون \n" +
                        " \tدر برخي موارد شوک به دليل از دست دادن \n" +
                        "شديد خون ( بيش از يک ليتر خون در 24 ساعت)\n" +
                        "\n" +
                        "درمان\n" +
                        "زماني که بيمار با خونريزي گوارشي مراجعه مي کند پس از متعادل کردن علائم حياتي بيمار از طريق مايع درماني مناسب ( سرم تزريقي) براي بيمار لوله معده گذاشته شده ، شستشوي معده انجام مي شود و وضعيت شدت خونريزي بيمار تخمين زده ميشود . گاه به دليل عدم توقف خونريزي جرحي اورژانسي ضروري است براي تشخيص يا درمان خونريزي بسته به منشاء آن اندوسکوپي يا کلونوسکوپي انجام مي شود.\n" +
                        "آموزش هاي لازم به بيمار \n" +
                        "\uF076\tدارو ها را طبق دستور پزشک معالج مصرف کنيد . \n" +
                        "\uF076\tقرص هاي جويدني را کاملا بجويد \n" +
                        "\uF076\tقبل از مصرف شربتهاي آنتي اسيد ، آنها را به خوبي تکان دهيد . \n" +
                        "\uF076\tاز سرفه کردن ، عطسه کردن ، بلند کردن و فشار در حين دفع مدفوع و استفراغ پرهيز کنيد . \n" +
                        "\uF076\tاز مصرف داروهاي مثل آسپرين و داروهاي ضد التهاب غير استيروئيدي ( ايبوپروفن، ناپروکسن ، ديکلوفنام اسيد پرهيز کنيد . \n" +
                        "\uF076\tاز انجام فعاليتهاي سنگين و قدرتي تا زماني که کم خوني شما جبران نشده است . خودداري کنيد . \n" +
                        "رژيم غذايي \n" +
                        "\uF0FC\tبيماراني که از زخم معده شاکي ميباشند بايد از مصرف غذاهاي آماده يا همان فست فود ها اجتناب کنند . \n" +
                        "\uF0FC\tمصرف ميان وعده هاي ناسالم همچون چيپس و پفک ف غذاهاي تند ، شود و پر ادويه را به حداقل برسانيد . \n" +
                        "\uF0FC\tاز مصرف چاي فراوان و پر رنگ بپرهيزيد و غذاهاي چرب نخوريد. \n" +
                        "\uF0FC\tسعي کنيد مقدار وعده هاي غذايي را افزايش ، اما حجم آنها را کاهش دهيد . \n" +
                        "\uF0FC\tاز خوردن سس گوجه فرنگي و ترشي اجتناب کنيد . \n" +
                        "\uF0FC\tعدم مصرف سيگار و ترک الکل از مواردي است که قابل توجه ميباشد .\n" +
                        "\uF0FC\tاز مصرف نوشابه هاي گازدار ، شکلات و تنقلات و غذاهاي چاشني دار اجتناب کنيد . \n" +
                        "\uF0FC\tدر بيماراني که علائم برگشت اسيد معده به داخل مري يا بازگشت غذا از معده به مري دارند لازم است از دراز کشيدن بلافاصله پس از غذا خودداري کرده و حتي الامکان بالاتنه را در هنگام خواب در موقعيت بالاتري از پائين تنه قرار دهند يا طرف پائين تخت ايشان در سطح پائين تري نسبت به قسمت بالاي تخت ( از سطح افق) قرار داشته باشد . \n" +
                        "\uF0FC\tبه ياد داشته باشيد هر زمان براي ساير مشکلات به پزشک مراجعه کرديد سابقه خونريزي گوراشي خود راب يان کنيد . \n" +
                        "\n" +
                        "\n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.commit();

            }
        });

        btn4.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("دیابت");
                fragment.SetBody("دیابت بیماری است که طی آن قند خون بطورمداوم بالاست و جهت کنترل آن فرد باید از داروهای پایین آورنده قند خون و یا انسولین استفاده نماید بالا بودن قند خون به مرور زمان باعث آسیب به قسمتهای مختلف بدن از جمله: اعصاب، کلیه ها، قلب و عروق و چشم می شود.\n" +
                        "بخش زیادی از غذایی که ما مصرف می کنیم در بدن به قندی به نام گلوکز تبدیل می شود و برای این که بدن بتواند از آن استفاده کند نیاز به هورمونی به نام انسولین دارد این هورمون درلوزالمعده ساخته شده و به اندازه نیاز سلولهای بدن برای جذب قند به داخل خون ترشح می شود. انسولین کمک می کند قندی که در جریان خون وجود دارد به سلولها وارد شده و در آنجا تبدیل به انرژی شود.\n" +
                        "در بیماری دیابت یا بدن نمی تواند از انسولین تولید شده استفاده کند یا قادر نیست به اندازه کافی انسولین تولید کند در نتیجه میزان قند خون و قند دفع شده در ادرار بالاتر از میزان طبیعی است.\n" +
                        "انواع شایع دیابت کدامند؟\n" +
                        "1- دیابت نوع یک ( دیابت وابسته به انسولین)\n" +
                        "•\t5 تا 10 درصد بیماران دیابتی را شامل می شود.\n" +
                        "•\tدر این نوع دیابت ترشح انسولین کم شده یا انسولین وجود ندارد. بنابراین این افراد باید با تزریق انسولین درمان شوند.\n" +
                        "•\tویژگی بارز آن بروز ناگهانی و حاد می باشد.\n" +
                        "•\tبیشتر در سنین کودکی و نوجوانی و سنین زیر 30 سال آغاز می شود.\n" +
                        "\n" +
                        "2- دیابت نوع 2 (غیر وابسته به انسولین)\n" +
                        "•\t90 تا 95 درصد بیماران دیابتی را شامل می شود.\n" +
                        "•\tدر این نوع دیابت حساسیت سلولها نسبت به انسولین کاهش یافته در بدن این افراد ابتدا به اندازه کافی انسولین ساخته می شود و در صورت کاهش وزن می توانند بدون تزريق انسولین درمان شوند اما در غیر این صورت جهت کنترل قند خون مجبور خواهند شد از داروهای خوراکی و تزریق انسولین استفاده کنند.\n" +
                        "•\tاکثراً در افراد چاق در سنین بالا (افراد بالای 30 سال) اتفاق می افتد.\n" +
                        "•\tمعمولا طی چندین سال به طور پنهان آغاز می شود.\n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.commit();

            }
        });

        btn5.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("سکته قلبی ( انفارکتوس میوکارد ) ");
                fragment.SetBody("سکته قلبی ( انفارکتوس میوکارد ) چیست ؟ \n" +
                        "یک وضعیت اورژانسی است و رمانی رخ می دهد که عروق کرونر ( عروقی که به قلب خون رسانی می کنند ) دچار کاهش ناگهانی یا قطع کلی جریان خون می شوند و اجازه عبور خون کافی را به عضله قلب نمی دهند در صورتی که درمان سریع برای آن انجام نگردد باعث مرگ عضله قلبی و سکته قلبی می شود . \n" +
                        "عوامل ایجاد کننده سکته قلبی چیست ؟ \n" +
                        " \tسابقه خانوادگی\n" +
                        " \tسن و جنس ( سالمندان 60 سال و بالاتر ، زنان\n" +
                        " بعد از یائسگی ) \n" +
                        " \tفشار خون بالا\n" +
                        " \tداشتن اضافه وزن و چاقی \n" +
                        " \tابتلا به دیابت ( مرض قند ) \n" +
                        " \tمصرف دخانیات ( سیگار ، قلبان ، پیپ و چپق ) \n" +
                        " \tعدم ورزش و فعالیتهای کافی\n" +
                        " \tرژیم غذایی نامناسب ، پرچرب و پر نمک \n" +
                        " \tمصرف قرصهای ضد بارداری به مدت 10 سال \n" +
                        " \tاسترس روحی ( خصومت ، خشم ، عصبانیت ، پرخاشگری ، رقابت ) \n" +
                        "علائم و نشانه ها : \n" +
                        " \tدرد ناگهانی و احساس ناراحتی در قفسه\n" +
                        "سینه مثل درد فشار دهنده ، فشار یا سوزشی\n" +
                        " که معمولاً بیش از 20 دقیقه طول می کشد . \n" +
                        " \tدرد به گردن ، فک ، گلو ، شانه ها و بازوی چپ منتشر می شود . \n" +
                        " \tدرد ممکن است همراه با تنگی نفس ، سرگیجه ، بیقراری ، تهوع و استفراغ ، اضطراب ، هیجان ، عصبانیت و تعریق ( پوست سرد رنگ پریده یا مرطوب ) باشد . \n" +
                        " خستگی بدون علت و گیجی\n" +
                        " \tوحشت با احساس نزدیک شدن به مرگ\n" +
                        "در افراد سالمند و یا افراد دیابتی حدوداً \n" +
                        "در 20 درصد موارد سکته قلبی بدون درد می باشد \n" +
                        "هر دقیقه برای رسیدن به بیمارستان ، برای دریافت کمک پزشکی ارزش حیاتی دارد نيم ساعت اول بعد از شروع سکته قلبی مهمترین زمان است و به آن زمان طلایی گفته می شود هر چه درمان زودتر انجام شود آسیب عضله قلب کمتر و احتمال زنده ماندن بیشتر می شود هر چه درمان دیرتر انجام شود و مدت زمانی که خون به عضله قلب نمی رسد طولانی تر باشد صدمه عضله قلب وسیع تر می شود و مقدار بیشتری از بافت قلب از بین می رود . \n" +
                        "راههای تشخیصی : \n" +
                        " \tشرح حال بیمار ( علائم و نشانه ها )\n" +
                        " \tنوار قلب \n" +
                        " \tآزمایشات خون ( بررسی آنزیمهای قلبی ، چربی خون و ....  ) \t\n" +
                        " \tاکوکاردیوگرافی\n" +
                        " \tتست ورزش\n" +
                        " \tاسکن قلب\n" +
                        " \tآنژیوگرافی\n" +
                        "درمان : \n" +
                        "هدف از درمان سکته قلبی جلوگیری از پیشرفت حمله قلبی و کاهش بار قلب و پیشگیری از عوارض قلبی می باشد . \n" +
                        "درمان با استراحت و اکسیژن درمانی شروع و بدنبال آن از داروهای ضد درد قوی مثل مورفین تجویز می شود بعد سریعاً درمان با نیتروگلیسرین وریدی جهت کاهش بار قلبی شروع شده بدنبال آن در صورت صلاحدید پزشک متخصص قلب از داروهای ضد انعقاد ( ضد لخته ) بصورت وریدی استفاده می شود . این داروها شامل استرپتوکیناز ، هپارین و ... می باشد .\n" +
                        "در ادامه درمان ممکن است با توجه به شرایط شما و صلاحدید پزشک قلب  داروهای مرتبط با نوع بیماری شما شروع  شود مثل داروهای ضد فشارخون ، کاهنده چربی خون و ضد پلاکت (آسپرین ، پلاویکس) آرامبخش ها و ... \n" +
                        "رعایت نکات زیر از سکته قلبی در بازتوانی به شما کمک می کند : \n" +
                        "عیادت کنندگان \n" +
                        "عیادت کننده زیاد باعث خستگی بیمار می شود در زمانی که احساس خستگی می کنید از دوستان عذرخواهی نموده و از ملاقات با افرادی که شما را عصبانی می کنند بپرهیزید . \n" +
                        "\n" +
                        "تغذیه : \n" +
                        " \tبعد از گذراندن مرحله حاد سکته قلبي و با اجازه پزشک معالج طي 24 ساعت اول ، رژیم مایعات و سپس با توجه به تحمل شما رژیم قلبی شروع می شود در ابتدا از مصرف غذاهاي خیلی گرم و سرد خودداری کنید .\n" +
                        " \t معمولاً وعده های غذایی با حجم کم در دفعات بیشتر بهتر تحمل می شود  ، بهتر است در پنج وعده غذای خود را میل نمایید . \n" +
                        " \tاز پرخوری و با عجله خوردن اجتناب کنید و بعد از صرف غذا مدت کوتاهی استراحت کنید . \n" +
                        " \tاز فعالیت بدنی تا 2 ساعت بعد از غذا خودداری کنید . \n" +
                        " \tتوصیه اصلی به استفاده از غذای کم نمک و کم چربی می باشد . \n" +
                        " \tتوصیه می شود از غذاهای حاوی مرغ ، ماهی و گوشت تازه بدون چربی ، سبزیجات و میوه جات تازه ( بجز نارگیل حاوی چربی مضر می باشد ) و نوشیدنی های غیر شیرین استفاده کنید . \n" +
                        " \tاز مصرف غذاهای آماده ، کنسروها ، تن ها ، چای پررنگ ، قهوه و سایر غذاهای سنگین و پرچرب مثل دل ، جگر ، قلوه ، کله پاچه و چربی حیوانی مثل سرشیر ، ماست پر چرب و خامه خودداری کنید . \n" +
                        " \tمصرف هویج ، سیب ، شوید ، گوجه فرنگی و بادام برای قلب مفید است . \n" +
                        " \tاز روغن مایع بخصوص روغن زیتون و آفتابگردان استفاده کنید . \n" +
                        " \tدر غذای خود از نمک کمتر استفاده نمائید و برای خوش طعم کردن غذا از آب لیمو ، گیاهان معطر ، میخک ، فلفل فرنگی و مرکبات استفاده کنید. \n" +
                        " \tاز انواع سس ها ، ترشی ها ، شوری ها ( خیارشور و گوجه شور ) و پنیر محلی استفاده نکنید . \n" +
                        " \tماهی غذای جهانی قلب است . \n" +
                        "فعالیت بدنی : \n" +
                        " \tدر روزهای اول شما به 24 تا 48 ساعت\n" +
                        " استراحت کامل در بستر نیاز دارید. \n" +
                        "\n" +
                        " \tبسته به وضعیت بالینی و با نظر پزشک در بستر تمرین حرکات دست و پاها را شروع کنید برای کاهش خطر لخته شدن خون پاها را به آرامی حرکت دهید . \n" +
                        " \tاز فشار دادن پا به تخت یا بلند کردن سریع پاها از تخت اجتناب کنید . \n" +
                        " \tپس از تثبیت وضعیت می توانید چندین بار در روز هربار به مدت 20 الی 30 دقیقه روی صندلی کنار تخت بنشینید و سپس بتدریج ایستادن و راه رفتن را در حد تحمل و نظر پزشک انجام دهید . \n" +
                        " \tاگر در حین فعالیت ، احساس گیجی ، ضعف ، درد قفسه سینه ، تنگی نفس و خستگی داشتید بلافاصله فعالیت را متوقف نمایید . \n" +
                        " \tپس از ترخیص فعالیت را بتدریج از سربگیرید  فعالیت شما باید آرام ، آرام و تدریجی باشد . \n" +
                        " \tپیاده روی یک ورزش مفید می باشد . بعد از استراحت و زمانی که خسته نیستید پیاده روی کنید . \n" +
                        " \tاز ورزش کردن بعد از صرف غذا و در هوای خیلی گرم و سرد ، طوفانی ، هوای آلوده ، رطوبت زیاد ، مه آلود ، ارتفاعات و سربالایی خودداری کنید . \n" +
                        " \tحین فعالیتهای ورزشی نبض خود را کنترل کنید اگر بیش از 110 ضربه دردقیقه رسید و دچار بی نظمی شدید شد فعالیت را قطع کنید . \n" +
                        " \tفعالیتهایی که فشار زیاد به قلب وارد می کنند مثل زور زدن هنگام اجابت مزاج و کشیدن و بلندکردن اجسام سنگین خودداری کنید . \n" +
                        " \tحدود 3 هفته پس از سکته قلبی شما باید بتوانید حتی الامکان 20 تا 30 دقیقه روزانه راه بروید .\n" +
                        "کارهای منزل : \n" +
                        " \tکارهای معمولی خانه مدت کوتاهی بعد از حمله قلبی کم کم شروع شود نه تنها برای شما مضر نیست بلکه باعث سرگرمی و رفع خستگی و افسردگی می شود . \n" +
                        " \tدرانجام کارها عجله نکنید بخصوص هنگام صبح ، فعالیتها را به آهستگی انجام دهید و کارهای سبک و سنگین را بطور متناوب انجام دهید . \n" +
                        "\n" +
                        "\n" +
                        "بازگشت به سرکار : \n" +
                        " \t3 تا 4 هفته بعد از بازگشت به منزل با در نظر گرفتن وضعیت جسمی و نوع شغل شما با مشورت پزشک معالج در مورد رفتن شما به سرکار تصمیم گیری می شود . \n" +
                        " \tاگر کارمند هستید در صورت موافقت رئیس خود ابتدا بصورت نیمه وقت کار کنید و در سرکار خود استراحت داشته باشید . ( البته ابتدا نیمه وقت و بعد از 2 تا 3 هفته تمام وقت )  از کارهای سبک شروع کنید . \n" +
                        "رانندگی کردن : \n" +
                        " \tحداقل 4 هفته بعد از سکته قلبی نباید\n" +
                        " رانندگی کنید زیرا رانندگی با ماشین\n" +
                        " باعث استرس ، هیجان و سفتی عضلات شده که این امر باعث تپش قلب می شود . پس از گذشت این زمان می توانید رانندگی در فواصل کوتاه را شروع کنید . \n" +
                        " \tاگر در حین رانندگی دچار درد قفسه سینه شدید تا بهبودی کامل درد قلبی از رانندگی پرهیز کنید . \n" +
                        " \tدر مسافرتهای طولانی ماشین سواری نکنید . در صورت طولانی بودن مسیر بین راه هر یک ساعت یک مرتبه توقف کنید و قدم بزنید تا جریان خون در پاها بهتر شود . \n" +
                        " \tحداقل 2 تا 3 هفته بعد از سکته قلبی می توانید سفر هوایی داشته باشید مشروط  بر اینکه درگیری دیگر نداشته و با پزشک قلب خود مشورت نمائید .\n" +
                        "حمام کردن : \n" +
                        " \t4 تا 7 روز بعد از حمله قلبی با تائید پزشک با آب نیمه گرم و ملایم می توانید حمام کنید . بهتر است در روزهای اول یک نفر در حمام با شما باشد تا در صورت ضعف از او کمک بخواهید . \n" +
                        " \tآب سرد باعث بروز درد قلبی می شود و آب گرم باعث بروز حالات ضعف می گردد  . \n" +
                        " \tدر حمام زیاد نایستید بلکه روی چهارپایه نشسته و زمان حمام کردن کوتاه بین 15 تا 20 دقیقه باشد . \n" +
                        "روابط زناشویی : \n" +
                        " \tفعالیت جنسی فعالیت در حد متوسط محسوب می شود وقتی قادر به بالا رفتن از دو طبقه پله بدون سختی و بروز علائم باشید می توانید فعالیت جنسی را شروع کنید که معمولاً بسته به شرایط حداقل 4 هفته بعد از ترخیص می باشد . \n" +
                        " \tاز داشتن فعالیت جنسی در زمانهای خستگی و پس از خوردن غذای سنگین خودداری کنید . \n" +
                        " \tفعالیت جنسی را در زمان مناسب بعد از استراحت کافی و با داشتن یک خواب خوب شبانه انجام دهید و بعد از آن استراحت کنید . \n" +
                        " \tبرای جلوگیری از بروز درد قلبی قبل و بعد از فعالیت جنسی می توانید از پرل زیرزبانی نیتروگلیسرین استفاده کنید . \n" +
                        " \tدرد قلبی بعد از فعالیت جنسی که با مصرف 2 تا 3 پرل زیر زبانی نیتروگلیسیرین که به فواصل هر 5 دقیقه از هم برطرف نشود و همچنین خستگی بیش از حد و بیخوابی پس از فعالیت جنسی را حتماً به پزشک معالجتان اطلاع دهید . \n" +
                        " \tاز مصرف داروهای تقویت قوای جنسی مثل قرص ویاگرا(سيلدنافيل) بشدت پرهیز کنید زیرا با داروهای قلبی تداخلی مرگ آور دارد . \n" +
                        "سیگار کشیدن : \n" +
                        " \tدیگر سیگار نکشید و از افراد سیگاری دوری کنید . \n" +
                        " \tنیکوتین سیگار باعث تنگ شدن عروق و تندشدن ضربان قلب می شود و اکسیژن رسانی را به قلب کاهش می دهد . ( مصرف هر پاکت سیگار10 ساعت از عمر انسان را کاهش می دهد . ) \n" +
                        "اضافه وزن و چاقی : \n" +
                        " \tاگر اضافه وزن دارید ( بخصوص چربی دور شکم زیاد باشد ) ریسک سکته قلبی در آینده نیز بیشتر خواهد بود پس بهتر است با یک متخصص تغذیه مشورت کنید . \n" +
                        " \t\n" +
                        " افسردگی : \n" +
                        " \tافسردگی معمولاً بعد از سکته قلبی بوجود می آید اگر این احساس را دارید با پزشک خود مشورت کنید . درمان افسردگی کیفیت زندگی را بالا می برد . \n" +
                        "استرس : \n" +
                        "برای کاهش استرس می توانید کارهای زیر را انجام دهید : \n" +
                        " \tاز محیط پر سروصدا و شلوغ دوری کنید . \n" +
                        " \tتغییر شغلهای پر استرس\n" +
                        " \tاجتناب از رانندگی طولانی و پر استرس\n" +
                        " \tانجام ورزش و استراحت کافی\n" +
                        " \tداشتن سرگرمیهای لذت بخش\n" +
                        " \tتمرین تنفس عمیق و تن آرامی از طریق انجام یوگا و پیاده وری\n" +
                        "دیابت و فشار خون : \n" +
                        " \tدیابت ( مرض قند ) و فشار خون بالا از عوامل ایجاد کننده حمله های قلبی می باشند با رعایت رژیم غذایی و مصرف بموقع داروها و مراجعه دوره ای به پزشک احتمال حمله های قلبی را کاهش دهید . \n" +
                        "دارو : \n" +
                        " \tبدون دستور پزشک دارو را کم یا قطع نکنید .\n" +
                        " \tقبل از ترخیص ، پرستار یا پزشک راجع به چگونگی مصرف دارو به شما توضیح خواهند داد بهتر است یادداشت نمایید تا از خاطر نبرید . \n" +
                        " \tدر صورتیکه دارویی را در موقع مصرف فراموش کردید در زمان بعدی دو قرص را همزمان مصرف نکنید . \n" +
                        " \tداروهای تجویز شده مخصوص شما می باشد از دادن آن به دیگران خودداری کنید . \n" +
                        " \tبرخی داروها برای تنظیم ضربان قلب و فشار خون شما تجویز شده اند پس به صورت دوره ای نبض و فشار خون خود  را کنترل کنید در صورت وجود نبض کمتر از 60 ضربه در دقیقه و یا علائم فشار خون پائین ( سرگیجه ، تاری دید ، احساس ضعف شدید ، تعریق و ...) به پزشک معالج مراجعه نمائید شاید لازم باشد نوع داروی شما تغییر داده شود .  \n" +
                        " \tداروهایی مثل نیتروگلیسرین زیر زبانی و ایزوردیل(ايزوسوربايد) باعث سردرد می شوند که پس از چند روز مصرف به آن عادت کرده و کاهش می یابد در صورت نیاز به استامینوفن با پزشک خود مشورت کنید . \n" +
                        " \tدر صورت ایجاد تاری دید ، خشکی دهان و سردردهای شدید و ضربان دار با پزشک خود مشورت کنید . \n" +
                        " \tقرص های زیر زبانی در جای خشک و خنک و دور از نور تا شش ماه قابل نگهداری می باشد ( در یخچال نگهداری نشود . ) \n" +
                        " \tبرخی داروها باعث طولانی شدن زمان لخته خون می شوند سعی کنید از هر گونه صدمه و بریدگی پوست خودداری کرده و در محلهای بریدگی به مدت 10 دقیقه فشار وارد کنید . \n" +
                        " \tاز مسواک نرم و ریش تراش بجای تیغ استفاده نمایید . \n" +
                        " \tدر صورت بروز علائم خونریزی از بیني ، لثه ، تغییر رنگ ادرار و مدفوع ، خلط خونی ، خونریزی قاعدگی بیش از حد و کبودی در هر نقطه از بدن به پزشک خود اطلاع دهید \n" +
                        "مراجعه به پزشک : \n" +
                        " \tهنگام ترخیص از بیمارستان وقت مراجعه بعدی به پزشک به شما گفته می شود و در صورت بروز هرگونه علائم غیر عادی به پزشک مراجعه کنید. \n" +
                        " \tمعاینات دوره ای در طی سال برای بررسی وضعیت شما الزامی می باشد.\n" +
                        "\n" +
                        " \n" +
                        "\n" +
                        "\n" +
                        "\n" +
                        "\n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.commit();

            }
        });

        btn6.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                FragmentTransaction transaction = getFragmentManager().beginTransaction();
                InfoIllness fragment = new InfoIllness();
                fragment.SetTitle("سیروز");
                fragment.SetBody("وزن کبد در حالت معمولی 5/1 کیلوگرم و بزرگترین غده بدن که. در قسمت راست بدن و زیر دیافراگم قرار دارد. بزرگترین پالایشگاه بدن است. کبد به هضم غذایی که خورده می شود کمک کرده، بدن را از شر سموم خلاص می کند.\n" +
                        "وظایفی که کبد در بدن انجام می دهد:\n" +
                        "•\tتولید صفرا (صفرا یا زردآب در کبد ساخته می شود و در کیسه صفرا ذخیره می شود و به هضم و جذب چربی کمک می کند)\n" +
                        "•\tپاک سازی خون از مواد سمی و آسیب زا (تبدیل آمونیاک سمی به اوره، که از طریق ادرار دفع می شود)\n" +
                        "•\tذخیره سازی و آزاد سازی گلوکز\n" +
                        "•\tذخیره سازی موادی مانند گلوکز، ویتامین ها (D-E-K-B12 -A و اسیدفولیک)، مس و آهن\n" +
                        "•\tمتابولیسم دارو توسط کبد انجام می شود.\n" +
                        "•\tتولید پروتئین های خاص (آلبومین و فاکتورهای انعقاد خون) \n" +
                        "\n" +
                        "به دنبال صدمه و آسیبهای ناشی از بیماریهای طولانی مدت کبد به دلایل مختلف، کبد سالم به کبد کم کار، تنبل و سفت تبدیل می شود. در ایران بیشترین علت تنبلی کبد، هپاتیتهای B و C، کبد چرب، بیماریهای خودایمنی و مادرزادی کبد، مصرف بعضی دارو¬ها و مواد سمی مانند الکل می¬باشند. \n" +
                        "کبد در حالت عادی می تواند روزانه تا یک سوم صدمات حاد خود را بازسازی کند ولی اگر صدمات و تخریب کبد چندین سال طول بکشد و معمولاً بدون علامت و بی سروصدا است و فرد برای درمان مراجعه نمی کند،کم کم شکل منظم و نرم کبد به هم می¬ریزد و  باعث می شود شرایط عادی کبد برای بازسازی دوباره از بین برود وکبد سفت و نارسا و تنبل شود.\n" +
                        "علایم و عوارض تنبلی کبد:\n" +
                        "در ابتدای بیماری و صدمات مزمن کبدی، زمانی که هنوز خیلی پیشرفت نکرده، کار کبد از قسمتهای نسبتاً سالم تر کبد انجام می شود و  باعث  شده هیچ علامتی در بدن ظاهر نشود. در این مرحله مشکل کم کاری و تنبلی کبد فقط در آزمایشات قابل تشخیص است. با پیشرفت بیشتر بیماری، صدمه بیشتر به قسمت سالم کبد وارد می شود و علایم تنبلی کبد خود را نشان می دهند.\n" +
                        " از روی هر کدام از علایم زیر می توان به کم کاری و تنبلی کبد شک کرد و برای تشخیص آن اقدام کرد:\n" +
                        "1.\tضعف، خستگی و بیحالی: با کم شدن کار کبد تولید نیرو برای قسمتهای مختلف بدن و عضلات کم شده و احساس خستگی، بیحالی و ضعف عمومی به وجود می آید. باید کارهای خود را بر اساس این سطح جدید تنظیم کرده و از خستگی زیاد پرهیز کرد. \n" +
                        "2.\tجمع شدن مایع در شکم: به دلیل ضعیف شدن کبد و کاهش ساخت بعضی مواد در خون توسط کبد، نمک و آب در بدن  جمع می شود و شکم بزرگ شده و پا¬ها ورم می کند. جمع شدن آب در شکم نشانه بیشتر شدن صدمه کبدی است که توجه و رعایت بیشتر را از سمت شما برای رژیم غذایی و مراجعه به پزشک برای درمان می خواهد. \n" +
                        "شاید عفونت و میکروب به آب شکم اضافه شود که خطرناک است و باید سریعاً تشخیص و درمان شود. جمع شدن آب و نمک ممکن است باعث ضعف و کم کاری و حتی توقف کار کلیه شود که اتفاقی خطرناک در تنبلی کبدی به حساب می آید.\n" +
                        "3.\tعوارض مغزی: در حالت عادی روزانه مقداری مواد که زیاد شدن آنها برای بدن سمی هستند از روده تولید و وارد خون می شوند وکبد باید آنها را از خون پاک کند تا به مغز و بدن آسیب نرسانند. در کم¬کاری کبد این کار انجام نمی شود و افزایش مواد سمی باعث ورم مغز شده و علایمی چون گیجی، منگی، خواب ¬آلودگی، فراموشی و در حالت پیشرفته¬تر کاهش هوشیاری و اغما ایجاد می کند. این عوارض خطرناک و نگران کننده می باشد و باید سریعاً درمان شود. گوشت مهمترین ماده برای ایجاد این مواد سمی از روده است. برای جلوگیری از این عوارض مغزی باید در مصرف گوشت و کباب و کله پاچه و سیرابی و شیردان و جگر پرهیز کنید. همچنین می توان با ایجاد اسهال و اجابت مزاج شل و فراوان از ورود مواد سمی به  خون جلوگیری کرد.\n" +
                        "4.\tزردی چشم: زردی چشم بعلت جمع شدن نوعی رنگدانه در خون است. این ماده باید توسط کبد دفع شود. موقعی که شدت نارسایی و ضعف کبد بیشتر از 80 درصد می شود، مقدار آن (رنگدانه ) در خون زیاد شده و چشمها زرد می شوند. این علامت نشانه شدید شدن نارسایی کبد است که مراجعه پزشکی منظم تری را می خواهد.\n" +
                        "5.\tخونریزی از مری: در سفت شدن کبد، خون دستگاه گوارش و روده ها نمی تواند به راحتی از کبد عبور کند تا به قلب برسد و مقدار زیادی خون به روده ها و رگهای مری و معده پس می زند. وقتی فشار در این رگها خیلی زیاد شود، آنها پاره می شوند و باعث خونریزی گوارشی بصورت استفراغ خونی فراوان می شوند. \n" +
                        "6.\tخارش: در کم کاری کبد ماده ای در بدن تغییر می کند که باعث ایجاد خارش در بدن می شود. خارش در هرگونه صدمه کم یا زیاد به کبد دیده می شود. خوشبختانه خارش تهدیدکننده زندگی بیمار نیست. علت و درمان آن هنوز قطعی و کاملاً مشخص نیست ولی می توان با استفاده از کیف آب سرد و مالیدن آبلیمو روی محل خارش میزان آن را کم کرد. \n" +
                        "سعی کنید پوست خود را نخارانید تا زخم نشود بلکه آن را ماساژ دهید. از پوشیدن لباسهای تنگ دوری کنید و همچنین پوست خود را مرطوب نگه دارید. در موارد شدید به پزشک مراجعه کنید تا برای شما دارو تجویز کند.\n" +
                        "7.\tبزرگ شدن طحال: در سفت شدن کبد خون دستگاه گوارش و روده ها نمی تواند به راحتی از کبد عبور کند و خون به روده ها و طحال پس می زند و طحال بزرگ می شود. بزرگ شدن طحال خطری ندارد و اقدام خاصی نمی خواهد ولی از رسیدن ضربه به قسمت چپ شکم خودداری کنید.\n" +
                        "8.\tبزرگ شدن پستان و کوچک شدن بیضه¬ها در مردان و قرمز شدن کف دست¬ها و ایجاد رگ¬های خونی کوچک عنکبوتی روی پوست قفسه سینه و گردن: در کم کاری کبد ماده ای در بدن زیاد می شود و در نتیجه بزرگ شدن پستان و کوچک شدن بیضه¬ها در مردان اتفاق می افتد و همچنین باعث ظاهر شدن رگ¬های خونی کوچک عنکبوتی مانند روی پوست سر و گردن و قفسه سینه و پرخونی و قرمز رنگ شدن کف دست¬ها می شود. این علایم خطری ندارند.\n" +
                        "9.\tافزایش زمان لخته شدن خون: لخته شدن خون توسط یک مجموعه از مواد تولید شده از کبد انجام     می شود. در جریان کم کار شدن کبد این مواد هم کمتر تولید می شوند و لخته شدن خون هم دیرتر انجام می شود که نشانه بدتر شدن کار کبد است، ولی به خودی خود مشکل مهمی را برای بیمار ایجاد نمی کند. \n" +
                        "10.\tمشکلات پوکی استخوان: در جریان تنبلی کبد جذب و تولید ویتامین D که برای ایجاد استخوان لازم \n" +
                        "است کم می شود و دردهای استخوانی بوجود می آید. از لبنیات کم چرب، ماهی، سبزیجات و حبوبات مصرف \n" +
                        "کنید. ورزش کنید و از نور خورشید استفاده کنید.\n" +
                        "تشخیص سیروز چگونه است؟\n" +
                        " پزشک اغلب از روی علائم بیمار و آزمایشات به این بیماری پی می \n" +
                        "برد. پزشک در معاینات بالینی ممکن است در وهله اول متوجه بزرگ \n" +
                        "شدن اولیه کبد باشد و یک آزمایش خون از شما انجام دهد و این آزمایشات نشان دهنده بیماری کبد خواهد بود و گاه پزشک ممکن است از بیمار، سونوگرافی، سی تی اسکن و یا اسکن ایزوتروپ از کبد و طحال به عمل آورد. گاه پزشک جهت تأیید تشخیص، تصمیم به بیوپسی کبد از راه پوست می گیرد. گاه بطور اتفاقی در حین جراحی و یا انجام لاپاراسکوپی که طی آن از طریق یک لوله دوربین دار  داخل شکم دیده می شود، متوجه کبد فرسوده و چروکیده فرد  مبتلا به سیروز می شود.\n" +
                        "\n");
                transaction.replace(R.id.frame_layout, fragment);
                transaction.commit();

            }
        });



        return v;
    }

}
