package com.example.nazanin.hospitalapp;

import android.content.Context;
import android.content.Intent;
import android.net.Uri;
import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;


public class DrugsList_2 extends Fragment {


    //"","","","","","","","","","","","",""
    String [] bakhsh = {"دیابت","دیابت","دیابت","دیابت","دیابت","دیابت","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون",
            "قلب و فشارخون","قلب و فشارخون", "قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون",
            "قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون", "قلب و فشارخون","قلب و فشارخون",

           "متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه",

            "","","","","","","","","","","","","",
            "","","","","","","","","","", "","","","","","","","","","","","",""};

    String [] list = {"گلی بنگلامید", "متفورمین (گلوکوفاژ)" ,"آکاربوز ( گلوکو نورم یا گلوکو بای )","پیوگلیتازون ( پیتوز یا گلوتازون )"
            ,"رپاکلینید ( نئوبت )","زیرامد \n" +
            "(گلی کلازید یا   دیابزید )\n","دیگوکسین","فورزماید","آسپرین","آملودیپین","دیلتیازم","آتورواستاتین و سیمواستاتین","پلاویکس و اسویکس","ایزوسورباید",
            "نیتروگلیسرین و پرل زیرزبانی","هیدرو کلرتیازید","متوپرولول (متورال)","اسپیرونولاکتون","هیدرالازین","کارودیلول و پروپرانولول (ایندرال) و آتنولل",
            "آمیودارون","لوزارتان (لوزار) (پوزارکس) ","وراپامیل","بایولوزاکس-اچ (لوزار + هیدروکلروتیازید)","ریواروکسابان یا (اکسابین، زالربان،کلاتوور، زارلتو)",
            "کاپتوپریل و انالاپریل","والسارتان (والزارتان یا دیووان)", "وارفارین",

            "امی تریپلین","باکلوفن","کلیندیوم C","مترونیدازول","بیزاکودیل","قرص پیراستام یا (نووتروپیل)","قرص سرتالین \n" +
            "(اسنترا یا زولوفت)\n","اناکساپرین","استامینوفن","آلپوازولام (زاناکس)","کپسول آزیتروماسین","سفتریاکسون","پنتوپرازول","فنازوپریدین","استرپتومایسین","اساکول \n" +
            "مسالازین","مگلومین کامپاند","ویزیپک\n" +
            "(ایودیکسانول)\n","دوتارم\n" +
            "(گادوترات مگلومین)\n",


            "","","","","","","",
            "","","","","", "","","","","","","","","","","","","","","","",
            "","","","","","","","","","", "","","","","","","","","","","","",""};

    String [] shekl = {"قرص 5 میلی گرم","قرص 500 و 1000 میلی گرم","قرص 50 و 100 میلی گرم","قرص 15 ، 30، 45 میلی گرم\n" +
            "حداکثر دوز 45 میلی گرم\n","قرص 0.5، 1، 2 میلی گرم","قرص 80 میلی گرم","قرص 25/0 ميلي گرم","قرص 40 ميلي گرم","قرص 500 و 325 و 100و 80 ميلي گرم",
            "قرص 5 میلی گرم","قرص 60 میلی گرم","قرص 40و20و10 ميلي گرم",
            "قرص 75","قرص 40و10 ميلي گرم", "قرص4/6 و 6/2 ميلي گرم","قرص 50 ميلي گرم","قرص 50-100 ميلي گرم","قرص 25 میلی گرمی","قرص 10 و 25 و 50 میلی گرمی",
            "قرص 6.25 و 12.5 میلی گرمی\n" +
                    "قرص 10،20،40\n" +
                    "قرص 50 و100\n","قرص 200 میلی گرم","قرص50 و25 میلی گرم",
            "قرص 40 میلی گرم","قرص 5/12 میلی گرم و50 میلی گرم","قرص 5، 10، 15 و 20 میلی گرمی","قرص 50و25 میلی گرم \n" +
            "قرص5 و20 میلی گرم\n","قرص 40 ، 80 و 320 میلی گرم", "قرص  5 ميلي گرم",

            "قرص 10 و 25 میلی گرم","قرص 10 و 25 میلی گرم","قرص 2.5 و 5 میلی گرم","قرص 250 \n" +
            "میلی گرم\n" +
            "ویال 500 میلی گرم و کرم واژینال\n","قرص 5 میلی گرم و\n" +
            "شیاف 10 \n" +
            "میلی گرم\n","قرص 400 و 800 میلی گرم\n" +
            "شربت\n","قرص 10 و 50 نوع محلول آن 25 و 50 میلی گرم","آمپول 20 ، 40 ، 60 ،  80 و 100 میلی گرم","قرص 325 و 500 میلی گرم و شیاف ","قرص 0.5 و 1 میلی گرم","قرص و کپسول 250 و 500 میلی گرمی\n" +
            "و شربت\n","ویال یک گرمی\n" +
            "500 میلی گرمی\n","آمپول 40 میلی گرم \n" +
            "قرص 40 و 20 میلی گرم\n","قرص100 میلی گرم","ویال 1 گرمی","قرص 250 و 400 میلی گرم\n" +
            "شیاف 500 و 1000 میلی گرم\n","آمپول %76 و %60 \n" +
            "20 سی سی\n" +
            "- محلول خوراکی %76 گاستروگرافین 100 سی سی\n" +
            "- ویال %76 (اوروگرافین) 100 سی سی\n","ویال 270 میلی گرمی/ 20 و50 سی سی\n" +
            "و\n" +
            "ویال 320 میلی گرمی/20، 50 و 100 سی سی\n","ویال 377 میلی گرمی/ 10، 15 و 20 سی سی",

            "","","","","","","","","","","","","","","",
            "","","","","","","","","","", "","","","","","","","","","","","",""};



    String [] asar = {"درمان دیابت نوع 2 با آزادسازی انسولین از لوزالمعده قند خون را کاهش می دهد.",
            "درمان دیابت نوع 2 – قند تولید شده از کبد را کاهش می دهد – باعث کاهش مقاومت سلول های بدن به انسولین شده و جذب قند خون توسط سلولهای بدن راحت تر می شود .",
            "درمان دیابت نوع 2\n" +
                    "جذب گلوکز (قند) را از روده به تأخیر انداخته و در نتیجه قند به آهستگی وارد خون می شود و مانع افزایش ناگهانی قند خون می شود .\n",
            "درمان دیابت نوع 2\n" +
                    "با افزایش حساسیت سلول های بدن نسبت به انسولین قند خون را کنترل می کند .\n","",
            "درمان دیابت نوع 2\n" +
                    "باعث افزایش تولید انسولین در لوزالمعده می شود .\n",
            "کنترل ضربان قلب و نارسایی قلبی",
            "کاهش فشار خون، افزایش دفع ادرار و مایع احتباس یافته",
            "ضد التهاب، ضد درد، کاهش فعالیت پلاکت","کاهش دهنده ی فشار خو\n" +
            " کاهش دهنده ی درد قلبی\n","کاهنده فشار خون\n" +
            "کاهنده درد قلبی\n","کاهش دهنده ی چربي خون","ضد تجمع پلاکت، رقیق کننده ی خون","ضد درد قلبی، گشادکننده ی عروق، کاهنده ی فشار خون",
            "ضد درد قلبی، گشادکننده ی عروق","کاهش فشار خون و افزایش دفع ادرار و مایع احتباس یافته","کاهنده ضربان قلب و فشار خون","کاهش دهنده ی فشار خون\n" +
            "ادرار  آور (نگهدارنده ی پتاسیم)\n","گشاد کننده ی عروق ، کاهش دهنده ی فشار خون","کاهش دهنده ی ضربان قلب و فشار خون","درمان آریتمی (بی نظمی) های قلبی",
            "کاهنده فشار خون",
            "کاهنده فشار خون\n" +
                    "کاهنده درد قلبی\n" +
                    "درمان آریتمی (بی نظمی) های قلبی\n","کاهنده فشار خون","ضد انعقاد (در برخی بیماران قلبی و ترومبوز ورید عمقی آمبولی ریه و بعد از جراحی های ارتوپدی برای جلوگیری از ایجاد لخته استفاده می شود. )",
            "کاهش دهنده ی فشار خون و تقویت عضله ی قلب","کاهنده فشار خون", "ضد انعقاد خون و رقیق کننده ی خون",

            "درمان افسردگی","ضد درد و ضد اسپاسم","درمان زخم های گوارشی","درمان عفونت","درمان یبوست","","* درمان افسردگی و اضطراب \n" +
            "* درمان اختلالات خلقی در دوران قاعدگی زنان\n","جلوگیری از انعقاد خون","ضد درد \n" +
            "ضد تب\n","ضد اضطراب \n" +
            "خواب آور و\n" +
            "آرام بخش\n","درمان عفونت ها","دارو را بصورت عضلانی و وریدی می باشد","درمان زخم ها و خونریزی های گوارشی ","درمان عفونت های مجاری ادراری","درمان برخی عفونت ها (بخصوص در درمان تب مالت کاربرد دارد)","ضد التهاب (غیر استروئیدی) درمان و پیشگیریبیماری التهابی روده (کرون و کولیت اولسراتیو)","داروی تشخیصی حاوی ید می باشد که برای تصویربرداری دستگاه گوارش، بیماری های عروقی، اختلالات مجرای صفراوی، اختلالات مغز،کلیه ، مجاری ادراری، دیسک و مفاصل استفاده \n" +
            "می شود\n","(این داروی تشخیصی در آنژیوگرافی و ونو گرافی تصویربرداری از عروق و شریان های بدن استفاده می شود.)","ماده حاجب تصویربرداری است که برای MRI به کار میرود.\n" +
            "برای تجسم ضایعات یا عروق غیر طبیعی در مغز یا آسیب های سد خونی مغزی، ضایعات داخل جمجمه، ستون فقرات و بافت های مرتبط استفاده می شود\n",


            "","","","","","","","","","","","","","","",
            "","","","","","","","","","", "","","","","","","","","","","","",""};

    String [] zaman = {"قبل از غذا","با غذا یا بلافاصله بعد از غذا","با غذا","قبل یا بعداز غذا","15 دقیقه قبل از غذا مصرف شود.","نیم ساعت قبل از غذا مصرف شود .",
            "بدون غذا","صبح میل شود","همراه غذا","قبل یا بعد از غذا","قبل از غذا و هنگام خواب","بدون غذا (معمولا عصرها میل شود.)","","بدون غذا","","",
            "همراه غذا", "همراه غذا","",
            "همراه غذا","همراه غذا","همراه غذا یا بدون آن","همراه غذا","قبل یا بعد از غذا","با یا بدون غذا مصرف شود.","",
            "همراه غذا یا بدون آن می توان مصرف کرد.\n" +
                    "سر ساعت مشخص استفاده نمائید.\n","",


            "با غذا یا بلافاصله بعد از غذا در صورت نیاز دارو را می توان خرد کرد","همراه غذا مصرف شود","30 الی 60 دقیقه قبل از غذا مصرف نماید","همراه غذا مصرف شود. دارو را می توان خرد کرد و جوید","قرص را هنگام عصر و یا قبل از صبحانه مصرف نمائید","بعد از سکته مغزی و بعد از جراحی مغز درمان آلزایمر وفراموشی\n" +
            "این دارو محافظ مغز در برابر کمبود اکسیژن \n" +
            "می باشد\n","با غذا یا بدون غذا می توان مصرف کرد.\n" +
            "شکل مایع دارو زولوفت قبل از مصرف باید رقیق شود. با نصف فنجان آب یا آب پرتقال ، لیموناد مخلوط کرده و میل نمائید\n","تزریق زیر جلدی","همراه غذا یا بدون آن می توان مصرف کرد","قبل یا بعد از غذا مصرف گردد","با معده خالی یک ساعت قبل یا 2 ساعت بعد از غذا مصرف کنید","هر 12 تا 24 ساعت","نیم ساعت (صبحانه)\n" +
            "قبل از غذا مصرف شود\n","همراه غذا مصرف شود","","قبل از غذا و قبل از خواب","","","","","","","","","","","","","","","","","",


            "","","", "","","","","","","","","","","","","","","","",
            "","","","","","","","","","", "","","","","","","","","","","","",""};

    String [] nokat = {"\uD83D\uDD39 در ابتدای شروع مصرف ممکن است حالت تهوع و استفراغ شدید داشته باشید که موقت بوده و برطرف می شود\n" +
            "\uD83D\uDD39 درصورتی که داروهای ضد انعقاد خوراکی \n" +
            "( وارفارین ، پلاویکس ) ، فنی توئین ، داروهای تیروئیدی و داروهای ضد فشار خون که ادرار آور هستند مصرف می کنید به پزشک معالج خود اطلاع دهید .\n" +
            "\uD83D\uDD39 دارو را طبق تجویز پزشک مصرف نمایید و خودسرانه قطع و کم  و زیاد ننمایید .\n" +
            "\uD83D\uDD39 برای جلوگیری از افت قند وعده های غذایی و میان وعده را حذف ننمایید.\n",
            "\uD83D\uDD39 پیش از شروع درمان با این قرص و سپس بصورت دوره ای آزمایشات عملکرد کلیه و کبد بررسی شود .\n" +
                    "\uD83D\uDD39 در صورت مصرف داروهای ضد انعقاد خوراکی \n" +
                    "( وارفارین ، پلاویکس ) پزشک معالج خود را مطلع نمایید .\n" +
                    "\uD83D\uDD39 48 ساعت قبل و 48 ساعت بعد از تزریق ماده حاجب وریدی ( برای برخی تصویر برداری ها انجام می شود ) باید دارو قطع شود.\n" +
                    "\uD83D\uDD39 در صورت بروز اسهال و استفراغ با مصرف این قرص به پزشک اطلاع دهید .\n",
            "\uD83D\uDD39 پیش از شروع درمان با این قرص و سپس بصورت دوره ای آزمایشات عملکرد کلیه و کبد بررسی شود .\n" +
                    "\uD83D\uDD39 در صورت مصرف داروهای ضد انعقاد خوراکی \n" +
                    "( وارفارین ، پلاویکس ) پزشک معالج خود را مطلع نمایید .\n" +
                    "\uD83D\uDD39 48 ساعت قبل و 48 ساعت بعد از تزریق ماده حاجب وریدی ( برای برخی تصویر برداری ها انجام می شود ) باید دارو قطع شود.\n" +
                    "\uD83D\uDD39 در صورت بروز اسهال و استفراغ با مصرف این قرص به پزشک اطلاع دهید .\n" +
                    "\uD83D\uDD39 برای کاهش عارضه گوارشی بهتر است دارو همراه یا بعد از غذا مصرف شود.\n",
            "\uD83D\uDD39 در بیماران سیروز کبدی و کولیت التهابی و انسداد گوارشی استفاده نشود .\n" +
                    "\uD83D\uDD39 نفخ شدید و اسهال را به پزشک معالج اطلاع دهید.\n" +
                    "\uD83D\uDD39 در کراتی نین 2/2 و حاملگی استفاده نشود.\n",
            "\uD83D\uDD39 در صورت عفونت تنفسی ، سردرد ، درد عضلانی ، زخم گلو ، دندان درد ، افزایش وزن و ورم پاها و خستگی بیش از حد ، پزشک معالج را مطلع نمایید .\n" +
                    "\uD83D\uDD39 این دارو اثر داروهای  ضد بارداری خوراکی را کاهش می دهد.\n" +
                    "\uD83D\uDD39 آزمایشات CBC و آنزیم کبدی دوره ای بررسی شود.\n",
            "\uD83D\uDD39 سردرد ، دندان درد ، درد مفاصل و برونشیت را به پزشک معالج اطلاع دهید .\n" +
                    "\uD83D\uDD39  در بیماران کلیوی ، دوران شیردهی و بارداری ممنوع می باشد .\n",
            "\uD83D\uDD39  در اوائل مصرف این دارو از انجام فعالیتهایی که نیاز به هوشیاری کامل دارند پرهیز نمایید .\n" +
                    "\uD83D\uDD39  در صورت مصرف داروهایی مثل فنی توئین ، ریفامپین و کورتون لازم است به پزشک معالج اطلاع دهید .\n",
            "\uD83D\uDD39باید هر روز صبح و در ساعت معینی با معده خالی (1 ساعت قبل یا 2 ساعت بعد از غذا) مصرف شود.\n" +
                    "\uD83D\uDD39دوز فراموش شده را می توان تا 12 ساعت بعد استفاده کرد. \n" +
                    "\uD83D\uDD39 نحوه ی گرفتن نبض را یاد بگیرید. و با ضربان بین 60-100 دارو را مصرف کنید.\n" +
                    "\uD83D\uDD39 برخی مواقع ممکن است بنا به نظر پزشک دو روز در هفته این قرص را مصرف نکنید.. \n" +
                    "\uD83D\uDD39 در خصوص مصرف فراورده های گیاهی مانند(الوئه ورا ،جیسینگ، زالزالک)ومکمل های کلسیم و ویتامین د احتیاط شود. \n" +
                    "\uD83D\uDD39 فیبرهای غذایی مانند سبوس گندم می تواند موجب کاهش دارو در بدن شود.\n" +
                    "\uD83D\uDD39 این دارو سبب تخلیه پتاسیم می شود بنابراین مواد حاوی پتاسیم (موز ، گوجه فرنگی،طالبی ،زردالو ،سیب زمینی ،قارچ، انگور،خرما ) توصیه می شود." +
                    "\n\uD83D\uDD39 تهوع ، استفراغ، ضربانات نامنظم قلب، توهم بینایی و بی اشتهایی از علائم مسمومیت با دیگوکسین می باشد که باید به پزشک مراجعه کنید.",
            "\uD83D\uDD39 دارو را با غذا یا شیر میل کنید. \n" +
                    "\uD83D\uDD39 رژیم پر  پتاسیم مثل موز- گوجه فرنگی، خرما، کاهو، خشکبار و گردو داشته باشید.\n" +
                    "\uD83D\uDD39 از تغییر وضعیت ناگهانی ، ورزش در هوای گرم وایستادن به مدت طولانی پرهیزکنید. \n" +
                    "\uD83D\uDD39 در صورت بروز ضعف و گرفتگی عضلانی ،تهوع ، سرگیجه، بی حسی سوزن سوزن شدن اندام ها به پزشک مراجعه کنید.\n",
            "\uD83D\uDD39 در صورت بروز خونریزی لثه یا کبودی روی پوست یا دفع خون از مدفوع حتما به پزشک مراجعه شود. \n" +
                    "\uD83D\uDD39 به دلیل بروز عوارض گوارشی با یک لیوان شیر یا آب میوه بعد از غذا میل شود. \n" +
                    "\uD83D\uDD39 در بیماران مبتلا به آسم و زخم گوارشی فعال منع مصرف دارد.\n",
            "\uD83D\uDD39 از مصرف همزمان با گریپ فروت اجتناب نمائید.\n" +
                    "\uD83D\uDD39 از تغییر وضعیت ناگهانی پرهیز نمائید.\n" +
                    "\uD83D\uDD39 در صورت ورم شدید اندام ها، دست و پا، همچنین یبوست، کوتاهی نفس، طپش قلب و ضربان نامنظم قلب به پزشک مراجعه نمائید.\n",
            "\uD83D\uDD39 قبل از شروع مصرف دارو، بایستی عملکرد کبد و کلیه بررسی گردد.\n" +
                    "\uD83D\uDD39 مصرف همزمان با دیگوکسین، احتمال مسمومیت با دیگوکسین را افزایش می دهد.\n" +
                    "\uD83D\uDD39 مصرف نمک و کنسروها، گوجه فرنگی، لبنیات و کلم را محدود نمائید.\n" +
                    "\uD83D\uDD39 مصرف شیرین بیان، نوشیدنی های کافئین دار (چای و قهوه) و گریپ فروت را محدود نمائید.\n" +
                    "\uD83D\uDD39 نحوه گرفتن نبض را یاد بگیرید و نبض زیر 50 را اطلاع دهید.\n",
            "\uD83D\uDD39 می توان دارو را قبل یا بعد از غذا میل کرد.\n" +
                    "\uD83D\uDD39 6-12 هفته بعد آزمایشات کبدی چک شود. \n" +
                    "\uD83D\uDD39 برنامه غذایی کم چرب و برنامه ورزشی منظم داشته باشید. \n" +
                    "\uD83D\uDD39 در صورت استفاده همزمان با دیگوکسین با پزشک مشورت شود.\n",
            "\uD83D\uDD39 مصرف این دارو بیمار را مستعد خون ریزی می کند باید از ضربه یا بریدگی پیشگیری شود و در صورت خونریزی از لثه یا بینی و یا خون مردگی در بدن، دارو قطع و به پزشک مراجعه شود.\n" +
                    "\uD83D\uDD39 اومپرازول و اس آمپرازول باعث کاهش اثر بخشی داروئی می شود و بهتر است از پنتوپرازول در صورت نیاز استفاده شود.\n",
            "\uD83D\uDD39 این دارو در پیشگیری درد قلبی موثر است.\n" +
                    "\uD83D\uDD39 دارو را با معده خالی (1 ساعت قبل یا 2 ساعت بعدازغذا ) مصرف کنید. \uD83D\uDD39 درصورت ایجاد  سر درد با غذا مصرف کنید. \n" +
                    "\uD83D\uDD39 سردرد عارضه شایع این دارو است که با مسکن برطرف می شود، اگر سردرد شدید و پایدار بود به پزشک مراجعه شود. \n" +
                    "\uD83D\uDD39 برافروختگی صورت و احساس سوزش زیر زبان از عوارض دارو می باشد.\n",
            "\uD83D\uDD39 این دارو در پیشگیری دردهای قلبی موثر است.. \n" +
                    "\uD83D\uDD39 دارو دور از رطوبت ، نم ، گرما نگهداشته شود.\n" +
                    "\uD83D\uDD39 نگهداری  در ظروف مقوایی ،کاغذی ومخلوط نمودن با سایر قرصها وتماس ظرف قرص بابدن (جیب پیراهن) باز کردن مکرر درب قوطی  خودداری کنید.\n" +
                    "\uD83D\uDD39 سردرد با این دارو  کمتر دیده می شود . \n" +
                    "\uD83D\uDD39 در صورت تاری دید یا خشکی دهان مصرف را قطع و به پزشک مراجعه کنید.\n",
            "\uD83D\uDD39 صبحها در ساعت معینی مصرف شود تا شب ادراری شما را ناراحت  نکند. \n" +
                    "\uD83D\uDD39 در افراد دیابتی ،قند خون مرتب کنترل شود.\n" +
                    "\uD83D\uDD39 نوبت عصر را قبل از ساعت6 بعداز ظهر میل کنید\n",
            "\uD83D\uDD39 اثر درمانی بعد از یک هفته مشاهده میشود. \n" +
                    "\uD83D\uDD39 نحوه گرفتن نبض را یاد بگیرید و با ضربان بین 100-60 دارو مصرف کنید. \n" +
                    "\uD83D\uDD39 همراه غذا یا بلا فاصله بعد از غذا مصرف کنید .\n" +
                    "\uD83D\uDD39 2 ساعت قبل تا 6 ساعت بعد از مصرف ،آب پرتقال و مکمل کلسیم نخورید\n" +
                    "\uD83D\uDD39 از مصرف هم زمان شیرین بیان با این دارو خوداری کنید.\n" +
                    "\uD83D\uDD39 دارو نباید بطور ناگهانی قطع شود.\n" +
                    "\uD83D\uDD39 افراد دیابتی مرتب قند خون را چک کنند.\n",
            "\uD83D\uDD39 به منظور افزایش جذب دارو آن را همراه با غذا مصرف کنید. \n" +
                    "\uD83D\uDD39 حداکثر اثر دارو ممکن است تا 3 روز پس از شروع درمان ایجاد شود و نیز افزایش ادرار ممکن است به مدت 2 یا 3 روز پس از قطع دارو ادامه یابد. \n" +
                    "\uD83D\uDD39 از جایگزینی مایعات از دست رفته با مقدار زیادی آب اجتناب کنید. \n" +
                    "\uD83D\uDD39 از مصرف زیاد غذاهای سرشار از پتاسیم (در صورتی که همراه با قرص لازیکس تجویزنشده) و جانشین های نمک اجتناب کنید.\n",
            "\uD83D\uDD39 به علت احتمال کاهش فشار خون وضعیتی، آهسته تغییر وضعیت دهید. \n" +
                    "\uD83D\uDD39 از ایستادن بدون حرکت به مدت طولانی، حمام یا دوش داغ و ورزش شدید اجتناب کنید. \n" +
                    "\uD83D\uDD39 در صورت سرگیچه حتما دراز بکشید و پاها را بالاتر قرار دهید.\n" +
                    "\uD83D\uDD39 مصرف نمک ،کنسروها ولبنیات محدود شود.\n",
            "\uD83D\uDD39 همراه غذا یا بلا فاصله بعد از غذا مصرف کنید\n" +
                    "\uD83D\uDD39 2 ساعت قبل تا 6 ساعت بعد از مصرف ،آب پرتقال و مکمل کلسیم نخورید.\n" +
                    "\uD83D\uDD39 از مصرف هم زمان شیرین بیان با این دارو خودداری کنید.\n" +
                    "\uD83D\uDD39 دارو نباید بطور ناگهانی قطع شود، قطع ناگهانی دارو می تواند منجر به افزایش شدید فشارخون شود.\n" +
                    "\uD83D\uDD39 نبض خود را قبل از مصرف کنترل کنید، در صورتی که ضربان کمتر از 60 یا بیشتر از100 باشد، به پزشک خود اطلاع دهید.\n",
            "\uD83D\uDD39 دارو را باید در درجه حرارت 30-15 درجه و بدور از نور نگهداری کنید.\n" +
                    "\uD83D\uDD39 بدنبال مصرف خوراکی دارو بخصوص در دوزهای بالا و شروع درمان، علائم گوارشی دیده می شود. \n" +
                    "\uD83D\uDD39 علائم اغلب با تجویز دارو در دوزهای منقسم و همراه با غذا کاهش می یابد.\n" +
                    "\uD83D\uDD39 قبل از شروع درمان و بصورت دوره ای پس از  شروع درمان، بایستی عملکرد کبد، ریه ها، تیروئید، دستگاه گوارش و سیستم عصبی ارزیابی گردد.\n" +
                    "\uD83D\uDD39 فشار خون خود را بطور دوره ای کنترل نمائید.\n" +
                    "\uD83D\uDD39 نبض خود را روزانه کنترل نمائید و حالات غیر طبیعی را گزارش نمائید.\n" +
                    "\uD83D\uDD39 در طی مدت درمان و تا 4 ماه پس از قطع درمان، از قرار گرفتن در معرض نور مستقیم خورشید پرهیز نمائید.\n" +
                    "\uD83D\uDD39 انجام رادیوگرافی قفسه سینه و انحام تست های فعالیت ریه هر 3 تا 6 ماه و معاینات چشمی 6 ماه پس از درمان و سپس سالیانه را پیگیری نمائید.\n",
            "\uD83D\uDD39 در صورت مصرف درازمدت، به صورت دوره ای، آزمایشات: CBC ، عملکرد کبد و کلیه را انجام دهید.\n" +
                    "\uD83D\uDD39 در طول مدت مصرف دارو، از اقدام جهت حاملگی اجتناب نمائید.\n" +
                    "\uD83D\uDD39 مصرف نمک را کاهش دهید، از مکمل های پتاسیم، جایگزین های نمک، و الکل اجتناب نمائید.\n" +
                    "\uD83D\uDD39 در صورت وجود درد، حساس شدن یا ضعف ماهیچه ای (عضلانی) غیر طبیعی، بویژه اگر همراه تب و ادرار تیره رنگ باشد، سریعا\" به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 از تغییر وضعیت ناگهانی پرهیز نمائید.\n" +
                    "\uD83D\uDD39 نشانه های حساسیت به دارو شامل کهیر، دشواری در نفس کشیدن، ورم صورت، لب ها، زبان و گلو می باشد که بایستی سریعا\" به پزشک مراجعه نمائید.\n",
            "\uD83D\uDD39 مصرف همزمان با دیگوکسین، احتمال مسمومیت با دیگوکسین را افزایش می دهد.\n" +
                    "\uD83D\uDD39 نحوه گرفتن نبض را یاد بگیرید و نبض زیر 50 و نامنظم را اطلاع دهید.\n" +
                    "\uD83D\uDD39 در سردرد های شدید و مقاوم به درمان، به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 حداقل هفته ای یکبار فشارخون خود را کنترل نموده و در دفترچه یادداشت ثبت نمائید.\n" +
                    "\uD83D\uDD39 مصرف نمک و کنسروها، لبنیات و کلم را محدود نمائید.\n" +
                    "\uD83D\uDD39 مصرف شیرین بیان، نوشیدنی های کافئین دار (چای و قهوه) و گریپ فروت را محدود نمائید.\n",
            "\uD83D\uDD39 قبل از شروع مصرف دارو، در صورت داشتن بیماری کبیدی و کلیوی، حساسیت به رنگ ها و غذا، به پزشک خود اطلاع دهید.\n" +
                    "\uD83D\uDD39 در صورت تاری دید، درد چشم و یا هر تغییر دیگری در دید، بایستی سریعا\" به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 در صورت مشاهده جوش، خارش، گرفتگی صدا، اشکال در تنفس و بلع، هر گونه تورم در دست و پا، دهان و صورت به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 در صورتی که حین مصرف دارو، بیماری شدید، بخصوص، اسهال، استفراغ و تهوع داشتید به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 در صورت تعریق شدید بخصوس در روزهای گرم، مایعات بنوشید. \n" +
                    "\uD83D\uDD39 در صورت مصرف درازمدت، به صورت دوره ای، آزمایشات: CBC ، عملکرد کبد و کلیه را انجام دهید.\n" +
                    "\uD83D\uDD39 در طول مدت مصرف دارو، از اقدام جهت حاملگی اجتناب نمائید.\n" +
                    "\uD83D\uDD39 مصرف نمک را کاهش دهید، از مکمل های پتاسیم، جایگزین های نمک، و الکل اجتناب نمائید.\n" +
                    "\uD83D\uDD39 در صورت وجود درد، حساس شدن یا ضعف ماهیچه ای (عضلانی) غیر طبیعی، بویژه اگر همراه تب و ادرار تیره رنگ باشد، سریعا\" به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 از تغییر وضعیت ناگهانی پرهیز نمائید.\n",
            "\uD83D\uDD39 دارو را منظم مصرف نمایید، خودسرانه قطع نکنید، هر روز سر ساعت منظم مصرف نمایید.\n" +
            "\uD83D\uDD39 دارو را می توان خرد کرد.\n" +
            "\uD83D\uDD39 در صورت مشاهده علائم خونریزی شدید، از قبیل درد و ورم غیر طبیعی، احساس خارش، خونریزی از لثه، خونریزی از بینی، قاعدگی های دردناک و طولانی، مدفوع سیاه یا خون در ادرار، سردرد شدید، سرگیجه، احساس ضعف و خستگی شدید و مشکل در بلع غذا حتماً به پزشک معالج مراجعه نمایید.\n" +
            "\uD83D\uDD39 مصرف همزمان با دارو های ضد قارچ (کتوکنازول)، فنی تونین، کاربامازپین، ضد التهاب غیر استروئیدی و ریفامپین و فلوکستین می تواند عملکرد این دارو را تغییر دهد بنابراین هر دارو (شیمیایی و گیاهی)که مصرف می کنید به پزشک خود اطلاع دهید.\n" +
            "\uD83D\uDD39 آب گریپ فوروت اثر دارو را افزایش می دهد.\n" +
            "\uD83D\uDD39 مصرف الکل احتمال خونریزی را افزایش می دهد.\n" +
            "\uD83D\uDD39 از مصرف همزمان با چای سبز اجتناب شود.\n",
            "\uD83D\uDD39 بهتر است دارو یک ساعت قبل از غذا مصرف شود. \n" +
                    "\uD83D\uDD39 رژیم کم نمک باشد. \n" +
                    "\uD83D\uDD39 در صورت برزو سرفه و تورم پلکها، چشم ها، لب ها، زبان یا مشکلات تنفسی و پوستی دارو قطع و به پزشک مراجعه شود.\n" +
                    "\uD83D\uDD39 از تمرینات شدید و تغییر وضعیت ناگهانی از خوابیده به نشسته یا ایستاده خودداری شود. \n" +
                    "\uD83D\uDD39 ممکن است باعث اختلال چشایی شود که 8 الی 12 هفته خود به خود بر طرف می شود.\n",
            "\uD83D\uDD39 در صورتی که باردار هستید این دارو را مصرف نکنید. همچنین در صورتی که در طول مصرف دارو باردار شدید دارو را قطع و به پزشک مراجعه کنید. \n" +
                    "\uD83D\uDD39 در صورت بروز درد عضلانی و ضعف خصوصا اگر همراه با تب و خستگی غیر معمول و ادرار تیره رنگ باشد حتما به پزشک معالج خود مراجعه نمائید.\n" +
                    "\uD83D\uDD39 قبل از استفاده از داروی دیووان آن را به  خوبی تکان دهید.\n" +
                    "\uD83D\uDD39 اگر دچار استفراغ ، اسهال ، و تعریق بیش از حد و همچنین احساس سبکی در سر ادرار کم و یا نداشتن ادرار ضربان قلب نامنظم یا لرزش در قفسه سینه ، شدید حتما به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 از مکمل های پتاسیم و جایگزین های نمک با این دارو اجتناب کنید.\n" +
                    "\uD83D\uDD39 به آرامی تغییر پوزیشن دهید.\n" +
                    "\uD83D\uDD39 علائم حساسیت به داور شامل کهیر ، دشواری نفس کشیدن ، التهاب صورت ، لب ها و گلو می باشد. در صورت مشاهده آنها به پزشک و پرستار اطلاع دهید.\n" +
                    "\uD83D\uDD39 آزمایشات عملکرد کلیه را بصورت دوره ای انجام دهید.\n",
            "\uD83D\uDD39 معمولا این دارو همزمان با هپارین در بیمارستان شروع \n" +
                    "می شود و دوز مناسب با انجام ازمایش خون تعیین می شود و هرگز از مقدار توصیه شده بیشتر و یا کمتر مصرف نکنید. \n" +
                    "\uD83D\uDD39 میزان وارفارین مصرفی شما توسط پزشک معالج و بر اساس آزمایش خون مخصوصی به نام PT و INR مشخص می شود این آزمایش میزان رقیق شدن خون شما توسط وارفارین را نشان می دهد.\n" +
                    "\uD83D\uDD39 دارو را هر روز در ساعت معینی مصرف کنید. \n" +
                    "\uD83D\uDD39 در صورت خونریزی لثه، بینی یا خون مردگی در بدن ، خون در ادرار و مدفوع تیره دارو را قطع و به پزشک مراجعه کنید.\n" +
                    "\uD83D\uDD39 غذاهایی که باعث کاهش اثر وارفارین در بدن می شوند شامل مواد غذایی حاوی ویتامین K (سبزیجات حاوی برگ سبز تیره، اسفناج، نعناع، جعفری و کاهو، کلم بروکلی، گشنیز، شغلم، پوست خیار، کیوی، روغن دانه سویا، چای سبز، جگر، کشمش)\n" +
                    "\uD83D\uDD39 مواد غذایی که باعث افزایش اثر وارفارین می شوند شامل زردچوبه، پیاز، زنجبیل، سیر.\n" +
                    "\uD83D\uDD39 نکته بسیار مهم اینست که شما تقریباً روزانه این مواد غذایی را به همان مقدار روزهای دیگر مصرف نمائید تاثیری در مقدار داروی مصرفی شما نخواهد گذاشت بطور مثال چنانچه این موارد را یک هفته در مقادیر زیاد مصرف نمائید و هفته دیگر مصرف نداشته باشید نیاز شما به دارو ممکن است متغییر باشد پس سعی نمائید این مواد غذایی را بطور متعادل و منظم مصرف نمائید.\n" +
                    "\uD83D\uDD39 اگر شما قصد باردار شدن دارید یا در طی درمان با وارفارین باردار شدید باید با پزشک خود تماس بگیرید.\n" +
                    "\uD83D\uDD39 جهت جلوگیری از بارداری تا حدالامکان از IUD استفاده نکنید.\n" +
                    "از خلال دندان استفاده نکنید.\n" +
                    "\uD83D\uDD39 بجای استفاده از تیغ برای اصلاح از ریش تراش برقی استفاده کنید.\n" +
                    "\uD83D\uDD39 در هنگام کار کردن با وسایل تیز و برنده دقت بیشتری داشته باشید.\n" +
                    "\uD83D\uDD39 در صورتی که مجبور به اعمال جراحی یا دندانپزشکی باشید به جراح و دندانپزشک و پزشک معالج خود اطلاع دهید.\n" +
                    "\uD83D\uDD39از مسواک نرم استفاده نمایید.\n",


            "* در صورت احتباس ادرار ، خشکی دهان و یبوست مداوم را به پزشک اطلاع دهید.\n" +
            "* از پوست خود در برابر نور خورسید حفاظت نمایید (عینک دودی ، لباس مناسب)\n" +
            "* رنگ ادرار به رنگ آبی متمایل به سبز تغییر می کند.\n" +
            "* در مصرف دراز مدت به طور دوره ای عملکرد کبدو کلیه و معاینه چشم انجام شود.\n" +
            "* دارو را به هیچ عنوان به طور ناگهانی قطع نکنید.\n","* دارو به طور خود سرانه و ناگهانی قطع نکنید.\n" +
            "* ممکن است باعث سرگیجه و خواب آلودگی شود تا زمان مشخص نشدن اثر دارو ، رانندگی و کارهای که نیاز به هوشیاری کامل دارند. اجتناب نمائید.\n" +
            "* در خلال مصرف دارو فشار خون ، قند خون ، و آزمایشات عملکرد کبد کنترل شود.\n","* ممکن است باعث خواب آلودگی ، تاری دید ، و سرگیجه شود. بنابراین تا مشخص نشدن اثر درمانی از رانندگی و کارهای نیازمند هوشیاری کامل اجتناب نماید.\n" +
            "* دارو را همزمان با آنتی اسیدها و دیگوکسین استفاده نکنید.\n" +
            "* در صورت بروز خواب آلودگی و سرگیجه شدید ، تحریک پذیری و راش پوستی دارو را قطع و به پزشک مراجعه نماید.\n","* دارو را مطابق تجویز پزشک و سرساعت مصرف نماید.\n" +
            "* خارش و ترشح واژینال و ضایعات خزء مانند روی زبان ، و مدفوع شل و بدبو را به پزشک معالج اطلاع دهیم.\n","* از خرد کرن و جویدن قرص خودداری کنید و دارو را با یک لیوان آب بخورید.\n" +
            "* زمان مصرف آن با داروهای و شربت های آنتی اسید حداقل یک ساعت فاصله باشد.\n" +
            "* مراقب باشید که در زمان یبوستی که همراه با تهوع و استفراغ و درد شکم از این دارو استفاده نکنید. \n","قرص پیراستام یا (نووتروپیل)\tقرص 400 و 800 میلی گرم\n" +
            "شربت\t\tبعد از سکته مغزی و بعد از جراحی مغز درمان آلزایمر وفراموشی\n" +
            "این دارو محافظ مغز در برابر کمبود اکسیژن \n" +
            "می باشد\t* در نارسایی کبد و کلیه و حاملگی و شیردهی استفاده نشود.\n" +
            "* از قطع ناگهانی دارو اجتناب نمائید.\n","قرص سرتالین \n" +
            "(اسنترا یا زولوفت)\tقرص 10 و 50 نوع محلول آن 25 و 50 میلی گرم\t* درمان افسردگی و اضطراب \n" +
            "* درمان اختلالات خلقی در دوران قاعدگی زنان\tبا غذا یا بدون غذا می توان مصرف کرد.\n" +
            "شکل مایع دارو زولوفت قبل از مصرف باید رقیق شود. با نصف فنجان آب یا آب پرتقال ، لیموناد مخلوط کرده و میل نمائید.  \t* برای رسیدن به اثر ضد افسردگی دارو زمان لازم است.\n" +
            "* از قطع ناگهانی دارو خودداری نمائید.\n" +
            "* بدلیل ایجاد سرگیجه و اختلال درتمرکز تا روشن شدن اثر دارو از رانندگی و کارهای که نیاز به هوشیاری دارند پرهیز نمائید.\n" +
            "* حین مصرف دارو اگر باردار شدید یا قصد بارداری دارید به پزشک معالج خود اطلاع دهید.\n" +
            "* در مدت مصرف دارو از پوست خود در برابر نور آفتاب حفاظت نمائید.\n" +
            "* از مصرف همزمان با الکل اجتناب نمائید.\n" +
            "* در صورت ایجاد ، گر گرفتگی ، تعریق ، سفتی و گرفتگی عضلات و بی خوابی ، گزگز انگشتان و زنگ زدن گوش ، بی قراری و پریشانی فورا به پزشک مراجعه کنید.\n" +
            "* علائم حساسیت به دارو ، ضایعات قرمز و خارش دار پوستی ، تنگی نفس و ورم صورت و لبها می باشد که بایستی دارو را قطع و به پزشک مراجعه نمائید.\n" +
            "* الکل مصرف نکنید.\n","* از انجام فعالیت هایی که امکان جراحت یا کبودی دارد اجتناب کنید.\n" +
            "* اگر مدفوع تیره و یا خون در مدفوع و ادرار، کبودی، خلط خونی دیدید به پزشک و پرستار گزارش کنید.\n" +
            "* در صورت نیاز به خدمات پزشکی یا دندان پزشکی پزشک معالج را در جریان مصرف دارو قرار دهید.\n" +
            "* دارو طبق بروشور دور کمر و ناحیه شکم تجویز شود.\n","* میتوان خرد کرد و با آب مصرف کرد.\n" +
            "* در صورت عود یا طول کشیدن تب به بیش از 72 ساعت به پزشک مراجعه کنید.\n" +
            "* در صورت مصرف طولانی مدت آزمایش خون عملکرد کلیه و کبد بصورت دوره ای انجام شود.\n","* به هیچ عنوان همراه مصرف این قرص از الکل و مواد مخدر استفاده نکنید.\n" +
            "* مصرف در حاملگی و شیردهی، ممنوع است. در صورت شک به حاملگی یا قصد بارداری به پزشک معالج مراجعه نمائید.\n" +
            "* دارو را به طور ناگهانی قطع نکنید.\n" +
            "* در طی مصرف دارو از رانندگی اجتناب نمایید.\n" +
            "* در صورت زرد شدن چشم ها و پوست و تشنج و یا حساسیت به دارو (جوش های پوستی، خارش، ورم در گلو و لب ها و زبان) و مشکل تنفسی و سر گیجه به پزشک مراجعه نمائید.\n","* این دارو را همزمان با دارو ها تتوفیلین، داروهای ضد تشنج و شربت های معده و آنتی اسید و وارفارین استفاده نکنید.\n" +
            "* در صورت بروز درد شکم ، تب ، تهوع و استفراغ را به پزشک اطلاع دهید.\n" +
            "* در صورت بروز اسهال دارو را قطع و به پزشک مراجعه نمایید.\n" +
            "* مدت زمان درمان با این دارو 5 روز می باشد.لزوما 5 روز نیست، 5 روز شایع ترین دستور دریافت است.\n","سفتریاکسون\tویال یک گرمی\n" +
            "500 میلی گرمی\tدارو را بصورت عضلانی و وریدی می باشد.\tهر 12 تا 24 ساعت \t* هر علامتی که نشان دهنده خونریزی باشد مانند کبودی بدن، خونریزی از بینی ، لکه لکه شدن بدن را به پزشک اطلاع دهید (این دارو فلوئور طبیعی روده را در مصرف طولانی مدت تغییر داده و باکتری های مفید روده را که ویتامین K می سازند را کاهش می دهد)\n" +
            "* بروز زائده های خزء مانند و سیاه روی زبان و خارش و ترشح واژینال و مدفوع شل (اسهال) را بخصوص اگر همراه چرک و موکوس باشد و تب را اطلاع دهید.\n" +
            "* قبل از شروع درمان با آن باید از عدم حساسیت به پنی سیلین و سفالوسپورین ها مطمئن شوید.\n" +
            "* علائم حساسیت به دارو، تب و لرز، کهیر، راش و تنگی نفس می باشد که باید دارو سریعاً قطع و اقدام لازم انجام شود .\n" +
            "* در نارسائی کلیه و کبد با احتیاط داده شود.\n" +
            "* در سنگ های صفراوی داده نشود (باعث غلیظ شدن صفرا می شود).\n","پنتوپرازول\tآمپول 40 میلی گرم \n" +
            "قرص 40 و 20 میلی گرم\tدرمان زخم ها و خونریزی های گوارشی \tنیم ساعت (صبحانه)\n" +
            "قبل از غذا مصرف شود.\t* در صورت واکنشهای حساسیتی با این دارو مثل کهیر، خارش، ورم دهان و لب ها، گلو و زبان، تنگی نفس را اطلاع دهید.\n" +
            "* اسهال یا درد شدید معده ، خون در مدفوع ، ادرار کم ، مدفوع کم رنگ و زردی پوست و چشم و کبودی و خونریزی غیرمعمول را اطلاع دهید. \n","* باعث تغییر رنگ ادرار به رنگ قرمز می شود که مشکلی ندارد.\n" +
            "* در صورت بروز تغییر رنگ پوست و خشکی غیر طبیعی به پزشک مراجعه نمائید.\n" +
            "* در طول مصرف عملکرد کبد باید بررسی شود.\n","استرپتومایسین\tویال 1 گرمی\n" +
            "\tدرمان برخی عفونت ها (بخصوص در درمان تب مالت کاربرد دارد)\t\t* داروهای مانند وانکومایسین، آمفوتریسین، سیکلوسپورین نباید با این دارو همزمان استفاده شود.\n" +
            "* این دارو در بارداری منع مصرف دارد.\n" +
            "* هنگام تهیه محلول استرپتومایسین از دستکش استفاده کنید.\n" +
            "* این دارو را نباید به شکل تزریق وریدی استفاده کرد.\n" +
            "* در طی درمان با این دارو به علائم وزوز گوش، کاهش شنوایی، سرگیجه، حساسیت شدید(کهیر، خارش) وتب دقت کرد. در صورت به وجود آمدن این علائم سریع به پزشک اطلاع دهید.\n" +
            "* توصیه می شود در زمان استفاده از این دارو مایعات بیشتر (6 تا 8 لیوان)استفاده کنید.\n" +
            "* در طول درمان با این دارو باید حداقل 1500 سی سی ادرار داشته باشید.\n","* عوارض جانبی این دارو تهوع و استفراغ، اسهال، نفخ شکمی، ریزش مو و سرماخوردگی می باشد.\n" +
            "* مصرف آن در حاملگی و شیردهی طبق نظر پزشک با حداقل دوز مانعی ندارد.\n" +
            "* عملکرد کلیه قبل از مصرف دارو، 3 ماه پس از درمان و بصورت دوره ای سالیانه باید بررسی شود.\n" +
            "* از جویدن و خرد کردن قرص خودداری نمایید.\n" +
            "* اجابت مزاج قبل از مصرف شیاف انجام شود.\n" +
            "* انما با این دارو شب ها و حد اقل 8 ساعت بماند.\n" +
            "* پاسخ درمانی معمولا در خلال 3 – 21 روز ایجاد می شود.\n" +
            "* در صورت بروز خونریزی، تاول، درد، سوزش، خارش در ناحیه رکتوم به پزشک معالج مراجعه نمایید.\n" +
            "* در خلال مصرف این دارو از مصرف دیگر دارو ها بدون دستور پزشک خودداری نماید.\n" +
            "* از قطع ناگهانی قرص پرهیز نماید.\n","* برگه رضایت آگاهانه مبتنی بر انجام آزمایش و خطرات احتمالی ناشی از آن باید توسط بیمار و همراهان درجه 1 وی قبل از آزمون تکمیل، امضاء و ممهور به اثر انگشت شود.\n" +
            "*سابقه حساسیت به ید، مواد حاجب ید دار، پنی سیلین،  اموکسی  سیلین ،آلرژی و آسم، بیماری شدید قلب و عروق و نارسائی کلیه و دهیدراتاسیون منع مصرف دارد.\n" +
            "* سابقه بیماری های سرع و تشنج، تیروئید، میاستنی گراو،کم خونی سلول داسی شکل، مولتیپل میلوما، دیابت همچنین اسهال و استفراغ شدید و مکرر در چند روز اخیر و حاملگی و شیردهی سوال تا تصمیم مناسب اخذ شود.\n" +
            "* کلیه داروهای مصرفی و حتی داروهای غیر نسخه ای مصرفی را اطلاع دهید بخصوص داروهای فشارخون (بتابلوکرها و کلسیم بلوکرها) داروهای ضد سرطان (اینترلوکین 2) و داروهای خوراکی دیابت را اطلاع دهید.\n" +
            "* متفورمین 48 ساعت قبل و بعد از تزریق ماده حاجب باید قطع شود.\n" +
            "* از سلامت آنژیوکت بیمار مطمئن باشید و آنژیوکت سبز یا خاکستری برای وی گرفته شود.\n" +
            "* معمولاً بصورت تزریقی یا خوراکی استفاده می شود؛ در نوع خوراکی قبل از انجام تصویربرداری آمپول در  5/1 لیتر آب حل شده و از 5/1 ساعت قبل از اسکن هر 15 دقیقه یک لیوان خورده ودر انتها به اندازه دو لیوان در بطری نگه داشته شود؛ هنگام مراجعه به واحد تصویربرداری همراه خود داشته باشد.\n" +
            "* قبل از شروع داروی خوراکی، مثانه باید تخلیه شود و حین مصرف دارو به هیچ وجه تا پایان CT، نباید مثانه تخلیه شود؛ در صورتی که بیمار سونداژ باشد، باید کلمپ شود؛ باید مثانه در حین CT با کنتراست خوراکی و وریدی پر باشد.\n" +
            "* ممکن است بیمار به دنبال تزریق ماده حاجب احساس گرمی و برافروختگی پوست و سراسر بدن و طعم فلزی در دهان شود که طبیعی بوده و در عرض چند دقیقه پایان می یابد. سایر علائم حسایت خفیف تهوع، استفراغ، کهیر، تب، سردرد، خارش و سرگیجه می باشد؛ در موارد شدیدتر ممکن است خس خس یا اشکال در تنفس و کاهش فشار خون نیز اتفاق بیفتد، که در صورت بروز آن باید تزریق قطع شود. وقوع حساسیت از بدو تزریق تا 40 دقیق پس از تزریق در حداکثر است اگرچه در برخی موارد نادر تا 48 ساعت پس از تزریق ماده حاجب نیز دیده شده است.\n" +
            "* برای جلوگیری از واکنش های ناخواسته معمولاً از آنتی هیستامین و استروئیدها (هیدروکورتیزون)استفاده می شود.\n" +
            "*3 تا 6 ساعت قبل از آزمون ناشتا باشد.\n" +
            "* چک آزمایش عملکرد کلیه (اوره و کراتنین)قبل از انجام آزمون صورت گیرد و به همراه سونوگرافی به واحد تصویربرداری ارسال شود.(در60 \uF03E BUN و 5/1 \uF03E Cr قابل انجام نیست).\n" +
            "* در صورت انجام باریوم انما و گرافی معده با مواد حاجب تا 10 روز نمی توان CT با کنتراست خوراکی و تزریقی انجام داد.\n" +
            "* پس از اتمام CT با کنتراست خوراکی و تزریقی مثانه تخلیه شود و نوشیدن آب و مایعات فراوان جهت دفع سریعتر دارو توصیه می شود.\n" +
            "* در بیماران مبتلا به نارسائی قلبی پیشرفته بخصوص اگر دارو دیورتیک مصرف می کنند، چندین ساعت بعد از انجام آزمون از نظر عملکرد کلیه باید تحت نظر باشند.\n" +
            "* چک آزمایشات تیروئیدی در صورت تزریق مواد حاجب باید بعد از یک هفته صورت گیرد.\n" +
            "* آزمایشات بیلی روبین، آهن، روی، مس حداقل به فاصله زمانی 48 ساعت بعد از تزریق مواد حاجب ید دار انجام شود.\n" +
            "*قطع موقت شیردهی تا حداقل 24 ساعت پس از تجویز این ماده صورت گیرد.\n","* اگر عوارض جانبي در حين تزريق ايجاد شوند بايد تزريق متوقف شود.\n" +
            "* بيماران بايد قبل و به دنبال مصرف داخل وريدي ماده حاجب كاملاً هيدراته شوند.\n" +
            "* مانند ساير مواد حاجب، به علت احتمال ناسازگاري شيميايي بايد به تنهايي تزريق شود.\n" +
            "* در طي تمام مراحل تزريق بايد استريليته حفظ گردد و دماي دارو بايد هم دماي بدن و اتاق باشد.\n" +
            "* بر آزمايشهاي انعقاد، پلاكت، اريتروسيت، فعال سازي كمپلمان تأثير مي\u200Cگذارد.\n" +
            "* در مایلوگرافی با ویزیپک، رانندگی 24 ساعت پس از تزریق انجام شود.\n" +
            "* سایر موارد که در مورد نکات هنگام مصرف مگلومین ذکر شد در این مورد نیز رعایت شود.\n","* در صورت بروز احساس سوزش در پوست، پوسته پوسته شدن، خارش، تورم، سفت شدن و ضخیم شدن پوست، ضایعات قرمز یا تیره روی پوست، سفتی در مفاصل همراه با مشکل در حرکت، خم کردن یا صاف کردن دست ها، پاها، درد در استخوان ران یا دنده ها، یا ضعف عضلانی با پزشک خود تماس بگیرید.\n" +
            "* در موارد منع MRI ممنوعیت دارد (داشتن پیس میکر = ضربان ساز قلبی ، گیره های فلزی عروقی)\n" +
            "* دوتارم تنها به صورت تزریق وریدی قابل استفاده است.\n" +
            "* در صورت بروز علائم زیر بعد از تزریق دوتارم به پزشک و پرستار خود اطلاع دهید: سرماخوردگی، سرد شدن پوست، سردرگمی، سرگیجه، سردرد،ضربان قلب نامنظم و کوبنده، صدای پتک در گوش، عصبی شدن، ضربان قلب آهسته یا سریع .\n" +
            "* سایر موارد که در مورد نکات هنگام مصرف مگلومین و ویزیپک ذکر شد در این مورد نیز رعایت شود.\n",


            "","","","","","","","","","","","","",
            "","","","","","","","","","", "","","","","","","","","","","","",""};





    public static Drugs newInstance() {
        Drugs fragment = new Drugs();
        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_drugs_list_2, container, false);
        ListView lv = (ListView)v.findViewById(R.id.lvDrugs2);
        sortAlephabetically();
        ArrayAdapter<String> arrayAdapter = new ArrayAdapter<String>(getContext(), android.R.layout.simple_list_item_1,list);
        lv.setAdapter(arrayAdapter);
        lv.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {

                Intent intent = new Intent(getContext(),dialogPage_2.class);
                intent.putExtra("value", list[position]);

                intent.putExtra("Tf1", shekl[position]);
                intent.putExtra("Tf2", bakhsh[position]);
                intent.putExtra("Tf3", asar[position]);
                intent.putExtra("Tf4", zaman[position]);
                intent.putExtra("Tf5", nokat[position]);


                startActivity(intent);


            }
        });
        return v;
    }

    private void sortAlephabetically(){

    }
}
