package com.example.nazanin.hospitalapp;

import android.content.Context;
import android.content.Intent;
import android.net.Uri;
import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v7.widget.SearchView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;


public class DrugsList_2 extends Fragment {


    //"","","","","","","","","","","","",""
    String [] bakhsh = {"دیابت","دیابت","دیابت","دیابت","دیابت","دیابت","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون",
            "قلب و فشارخون","قلب و فشارخون", "قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون",
            "قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون","قلب و فشارخون", "قلب و فشارخون","قلب و فشارخون",

           "متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه",

            "دیالیزی","دیالیزی","دیالیزی","دیالیزی","دیالیزی","دیالیزی","دیالیزی","دیالیزی","دیالیزی",
            "تیروئید","تیروئید","تشنج و صرع ","تشنج و صرع ","تشنج و صرع ","تشنج و صرع ","تشنج و صرع ","تشنج و صرع ","تشنج و صرع ","تشنج و صرع ","تشنج و صرع ",
            "آرتریت و لوپوس","آرتریت و لوپوس","آرتریت و لوپوس", "آرتریت و لوپوس","آرتریت و لوپوس","آرتریت و لوپوس",
            "نقرس","نقرس","نقرس","نقرس"};

    String [] list = {"گلی بنگلامید", "متفورمین (گلوکوفاژ)" ,"آکاربوز ( گلوکو نورم یا گلوکو بای )","پیوگلیتازون ( پیتوز یا گلوتازون )"
            ,"رپاکلینید ( نئوبت )","زیرامد \n" +
            "(گلی کلازید یا   دیابزید )\n","دیگوکسین","فورزماید",
            "آسپرین","آملودیپین","دیلتیازم","آتورواستاتین و سیمواستاتین","پلاویکس و اسویکس","ایزوسورباید",
            "نیتروگلیسرین و پرل زیرزبانی","هیدرو کلرتیازید","متوپرولول (متورال)","اسپیرونولاکتون","هیدرالازین","کارودیلول و پروپرانولول (ایندرال) و آتنولل",
            "آمیودارون","لوزارتان (لوزار) (پوزارکس) ","وراپامیل","بایولوزاکس-اچ (لوزار + هیدروکلروتیازید)","ریواروکسابان یا (اکسابین، زالربان،کلاتوور، زارلتو)",
            "کاپتوپریل و انالاپریل","والسارتان (والزارتان یا دیووان)", "وارفارین",

            "امی تریپلین","باکلوفن","کلیندیوم C","مترونیدازول","بیزاکودیل","قرص پیراستام یا (نووتروپیل)","قرص سرتالین \n" +
            "(اسنترا یا زولوفت)\n","اناکساپرین","استامینوفن","آلپوازولام (زاناکس)","کپسول آزیتروماسین","سفتریاکسون","پنتوپرازول","فنازوپریدین","استرپتومایسین","اساکول \n" +
            "مسالازین","مگلومین کامپاند","ویزیپک\n" +
            "(ایودیکسانول)\n","دوتارم\n" +
            "(گادوترات مگلومین)\n",


            "اسید فولیک","کربنات کلسیم","رناژل","ونوفر","کلسی تریول (روکاترول)","اپرکس (اریترو پویتنین)","سیناکست\n" +
            "(سیناکلست، پاراکلست)\n",
            "آلومینیوم هیدروکساید ","نفروویت","متی مازول","لووتیروکسین",
            "فنوباربیتال", "کاربامازپین\n" +
            "(تگرتول)\n","والپرات سدیم\n" +
            "(دپاکین)\n","کلوبازام","لووتیراستام","لاموتریژین","فلبامات","اتوسوکسیماید","فنی توئین",
            "آسپرین","داروهای ضد التهاب غیر استروئیدی (ایپوپروفن  ایندومتاسین پیروکسیکام ملوکسیکام)","سلکسیب","داروهای ضد مالاریا   (هیدروکسی کلروکین)","کورتیکو استروئیدها\n" +
            "پرد نیزولون،\n" +
            "هیدرو  کورتیزون ،\n" +
            "متیل پرد نیزولون\n","داروهای سرکوب کننده سیستم\n" +
            "ایمنی\n" +
            "آزاپتوپرین ،\n" +
            "سیکلوفسفاماید ،  متو تروکسات\n",
            "پروبنسید\n" +
                    "Benemid\n","آلوپورینول",
            "کلشی سین","داروهای ضدالتهاب غیر استروئیدی (NISD) \n" +
            "(ایبوبروفن ، ایندوستاین ، ناپروکسن و ...)\n"};

    String [] shekl = {"قرص 5 میلی گرم","قرص 500 و 1000 میلی گرم","قرص 50 و 100 میلی گرم","قرص 15 ، 30، 45 میلی گرم\n" +
            "حداکثر دوز 45 میلی گرم\n","قرص 0.5، 1، 2 میلی گرم","قرص 80 میلی گرم","قرص 25/0 ميلي گرم","قرص 40 ميلي گرم",
            "قرص 500 و 325 و 100و 80 ميلي گرم",
            "قرص 5 میلی گرم","قرص 60 میلی گرم","قرص 40و20و10 ميلي گرم",
            "قرص 75","قرص 40و10 ميلي گرم", "قرص4/6 و 6/2 ميلي گرم","قرص 50 ميلي گرم","قرص 50-100 ميلي گرم","قرص 25 میلی گرمی","قرص 10 و 25 و 50 میلی گرمی",
            "قرص 6.25 و 12.5 میلی گرمی\n" +
                    "قرص 10،20،40\n" +
                    "قرص 50 و100\n","قرص 200 میلی گرم","قرص50 و25 میلی گرم",
            "قرص 40 میلی گرم","قرص 5/12 میلی گرم و50 میلی گرم","قرص 5، 10، 15 و 20 میلی گرمی","قرص 50و25 میلی گرم \n" +
            "قرص5 و20 میلی گرم\n","قرص 40 ، 80 و 320 میلی گرم", "قرص  5 ميلي گرم",

            "قرص 10 و 25 میلی گرم","قرص 10 و 25 میلی گرم","قرص 2.5 و 5 میلی گرم","قرص 250 \n" +
            "میلی گرم\n" +
            "ویال 500 میلی گرم و کرم واژینال\n","قرص 5 میلی گرم و\n" +
            "شیاف 10 \n" +
            "میلی گرم\n","قرص 400 و 800 میلی گرم\n" +
            "شربت\n","قرص 10 و 50 نوع محلول آن 25 و 50 میلی گرم","آمپول 20 ، 40 ، 60 ،  80 و 100 میلی گرم","قرص 325 و 500 میلی گرم و شیاف ","قرص 0.5 و 1 میلی گرم","قرص و کپسول 250 و 500 میلی گرمی\n" +
            "و شربت\n","ویال یک گرمی\n" +
            "500 میلی گرمی\n","آمپول 40 میلی گرم \n" +
            "قرص 40 و 20 میلی گرم\n","قرص100 میلی گرم","ویال 1 گرمی","قرص 250 و 400 میلی گرم\n" +
            "شیاف 500 و 1000 میلی گرم\n","آمپول %76 و %60 \n" +
            "20 سی سی\n" +
            "- محلول خوراکی %76 گاستروگرافین 100 سی سی\n" +
            "- ویال %76 (اوروگرافین) 100 سی سی\n","ویال 270 میلی گرمی/ 20 و50 سی سی\n" +
            "و\n" +
            "ویال 320 میلی گرمی/20، 50 و 100 سی سی\n","ویال 377 میلی گرمی/ 10، 15 و 20 سی سی",

            "قرص 1 و 5 میلی گرمی","قرص 500 میلی گرمی","قرص 800 میلی گرمی","آمپول 20 میلی گرم در 5 سی سی می باشد.(محلول قهوه ای تیره آهن)",
            "کپسول یا سافت ژل 25/0 میکروگرم\n" +
                    "و\n" +
                    "آمپول 1 میکروگرم / 1 سی سی\n","به شکل مایع بی رنگ بصورت آمپول های 2000 و 4000 و 10000 واحد است.","قرص 30 و 60 میلی گرمی","شربت","مکمل غذایی شامل ویتامین B6   ، B12 ، B1 ، B2 ، بیوتین و روی و ...است به دلیل محدودیت در رژیم غذایی و بی اشتهایی مصرف این دارو توصیه می شود",
            "قرص 5 میلی گرم","قرص 1 میلی گرم و\n" +
            "50 میکرو گرم\n",
            "قرص 60 و 100 میلی گرمی","قرص 200 و 400 میلی گرم","قرص200، 400 و 500  میلی گرمی\n" +
            "آمپول 100 میلی گرمی در 4 و 5 سی سی\n","قرص  10 میلی گرمی",
            "آمپول و\n" +
                    "قرص500 میلی گرم\n","قرص 25 – 50 – 100 میلی گرم و شربت خوراکی","قرص 400 میلی گرم","قرص و کپسول 250 میلی گرم و شربت 250 میلی گرم  ",
            "آمپول و\n" +
                    "کپسول 100 و\n" +
                    " 50 میلی گرمی\n","","","","","", "","","","",""};



    String [] asar = {"درمان دیابت نوع 2 با آزادسازی انسولین از لوزالمعده قند خون را کاهش می دهد.",
            "درمان دیابت نوع 2 – قند تولید شده از کبد را کاهش می دهد – باعث کاهش مقاومت سلول های بدن به انسولین شده و جذب قند خون توسط سلولهای بدن راحت تر می شود .",
            "درمان دیابت نوع 2\n" +
                    "جذب گلوکز (قند) را از روده به تأخیر انداخته و در نتیجه قند به آهستگی وارد خون می شود و مانع افزایش ناگهانی قند خون می شود .\n",
            "درمان دیابت نوع 2\n" +
                    "با افزایش حساسیت سلول های بدن نسبت به انسولین قند خون را کنترل می کند .\n","",
            "درمان دیابت نوع 2\n" +
                    "باعث افزایش تولید انسولین در لوزالمعده می شود .\n",
            "کنترل ضربان قلب و نارسایی قلبی",
            "کاهش فشار خون، افزایش دفع ادرار و مایع احتباس یافته",
            "ضد التهاب، ضد درد، کاهش فعالیت پلاکت","کاهش دهنده ی فشار خو\n" +
            " کاهش دهنده ی درد قلبی\n","کاهنده فشار خون\n" +
            "کاهنده درد قلبی\n","کاهش دهنده ی چربي خون","ضد تجمع پلاکت، رقیق کننده ی خون","ضد درد قلبی، گشادکننده ی عروق، کاهنده ی فشار خون",
            "ضد درد قلبی، گشادکننده ی عروق","کاهش فشار خون و افزایش دفع ادرار و مایع احتباس یافته","کاهنده ضربان قلب و فشار خون","کاهش دهنده ی فشار خون\n" +
            "ادرار  آور (نگهدارنده ی پتاسیم)\n","گشاد کننده ی عروق ، کاهش دهنده ی فشار خون","کاهش دهنده ی ضربان قلب و فشار خون","درمان آریتمی (بی نظمی) های قلبی",
            "کاهنده فشار خون",
            "کاهنده فشار خون\n" +
                    "کاهنده درد قلبی\n" +
                    "درمان آریتمی (بی نظمی) های قلبی\n","کاهنده فشار خون","ضد انعقاد (در برخی بیماران قلبی و ترومبوز ورید عمقی آمبولی ریه و بعد از جراحی های ارتوپدی برای جلوگیری از ایجاد لخته استفاده می شود. )",
            "کاهش دهنده ی فشار خون و تقویت عضله ی قلب","کاهنده فشار خون", "ضد انعقاد خون و رقیق کننده ی خون",

            "درمان افسردگی","ضد درد و ضد اسپاسم","درمان زخم های گوارشی","درمان عفونت","درمان یبوست","","* درمان افسردگی و اضطراب \n" +
            "* درمان اختلالات خلقی در دوران قاعدگی زنان\n","جلوگیری از انعقاد خون","ضد درد \n" +
            "ضد تب\n","ضد اضطراب \n" +
            "خواب آور و\n" +
            "آرام بخش\n","درمان عفونت ها","دارو را بصورت عضلانی و وریدی می باشد","درمان زخم ها و خونریزی های گوارشی ","درمان عفونت های مجاری ادراری","درمان برخی عفونت ها (بخصوص در درمان تب مالت کاربرد دارد)","ضد التهاب (غیر استروئیدی) درمان و پیشگیریبیماری التهابی روده (کرون و کولیت اولسراتیو)","داروی تشخیصی حاوی ید می باشد که برای تصویربرداری دستگاه گوارش، بیماری های عروقی، اختلالات مجرای صفراوی، اختلالات مغز،کلیه ، مجاری ادراری، دیسک و مفاصل استفاده \n" +
            "می شود\n","(این داروی تشخیصی در آنژیوگرافی و ونو گرافی تصویربرداری از عروق و شریان های بدن استفاده می شود.)","ماده حاجب تصویربرداری است که برای MRI به کار میرود.\n" +
            "برای تجسم ضایعات یا عروق غیر طبیعی در مغز یا آسیب های سد خونی مغزی، ضایعات داخل جمجمه، ستون فقرات و بافت های مرتبط استفاده می شود\n",


            "در بیماران کم خون جهت تأیید گلبول قرمز و خون سازی مصرف می شود.",
            "کربنات کلسیم در روده با فسفر موجوددر غذا ترکیب شده و از جذب آن در ورود به جریان خون جلوگیری می کند.",
            "برای درمان فسفر بالا ( فسفر را از طریق دستگاه گوارش دفع می کند ) سبب کاهش فسفر می شود.",
            "از ترکیبات آهن و ضدکم خونی است.","فرم فعال ویتامین D3  می باشد . برای درمان سطح  پایین کلسیم خون و  باعث کاهش سطح بالای هورمون پاراتیروئیدی PTH می شود .",
            "جهت درمان و اصلاح کم خونی ( با تأثیر  بر مغز استخوان )","درمان بیماران دیالیزی و کانسر پاراتیروئید استفاده می شود. (باعث مهار غده پاراتیروئید و با کاهش مقدار هورمون پاراتورمون باعث کاهش ذخایر اضافی کلسیم و فسفر در بدن می گردد)",
            "درمان اولیه فسفر بالا","",

            "درمان پرکاری تیروئید","درمان کم کاری تیروئید",
            "ضد تشنج و آرامبخش","ضد تشنج","ضد تشنج",
            "درمان کمکی در تشنج \n" +
                    "درمان اضطراب            \n","درمان صرع و تشنج","داروی تشنج",
            "ضد تشنج","داروی ضد تشنج (بخصوص صرع)","درمان تشنج",
            "ضد درد ضد التهاب (ورم)","ضد التهاب","ضد درد ضد التهاب","باعث کاهش التهاب", "ضد درد ، ضد التهاب","در موارد شدید بیماری یا مواردی که در  مان های  دیگر پاسخ نداده استفاده می شود",
            "","","","","","","","","","",""};

    String [] zaman = {"قبل از غذا","با غذا یا بلافاصله بعد از غذا","با غذا","قبل یا بعداز غذا","15 دقیقه قبل از غذا مصرف شود.","نیم ساعت قبل از غذا مصرف شود .",
            "بدون غذا","صبح میل شود","همراه غذا","قبل یا بعد از غذا","قبل از غذا و هنگام خواب","بدون غذا (معمولا عصرها میل شود.)","","بدون غذا","","",
            "همراه غذا", "همراه غذا","",
            "همراه غذا","همراه غذا","همراه غذا یا بدون آن","همراه غذا","قبل یا بعد از غذا","با یا بدون غذا مصرف شود.","",
            "همراه غذا یا بدون آن می توان مصرف کرد.\n" +
                    "سر ساعت مشخص استفاده نمائید.\n","",


            "با غذا یا بلافاصله بعد از غذا در صورت نیاز دارو را می توان خرد کرد","همراه غذا مصرف شود","30 الی 60 دقیقه قبل از غذا مصرف نماید","همراه غذا مصرف شود. دارو را می توان خرد کرد و جوید","قرص را هنگام عصر و یا قبل از صبحانه مصرف نمائید","بعد از سکته مغزی و بعد از جراحی مغز درمان آلزایمر وفراموشی\n" +
            "این دارو محافظ مغز در برابر کمبود اکسیژن \n" +
            "می باشد\n","با غذا یا بدون غذا می توان مصرف کرد.\n" +
            "شکل مایع دارو زولوفت قبل از مصرف باید رقیق شود. با نصف فنجان آب یا آب پرتقال ، لیموناد مخلوط کرده و میل نمائید\n","تزریق زیر جلدی","همراه غذا یا بدون آن می توان مصرف کرد","قبل یا بعد از غذا مصرف گردد","با معده خالی یک ساعت قبل یا 2 ساعت بعد از غذا مصرف کنید","هر 12 تا 24 ساعت","نیم ساعت (صبحانه)\n" +
            "قبل از غذا مصرف شود\n","همراه غذا مصرف شود","","قبل از غذا و قبل از خواب","","","", "",
            "اگر هدف از درمان اصلاح کلسیم است باید دارو را تا یک ساعت بعد از غذا و با لیوان پر از آب میل کنید . اگر هدف اصلاح فسفر است دارو باید وسط غذا میل شود.",
            "دارو را همراه غذا یا بلافاصله بعد از غذا مصرف کنید.", "",
            "معمولا طبق دستور برای تأثیر بهتر بعد از دیالیز مصرف می شود .","",
            "همراه با غذا و یا اندکی پس از صرف غذا مصرف شود","", "",

            "با غذا مصرف کنید","صبح نیم ساعت قبل از غذا با یک لیوان پر آب مصرف کنید.",
            "","با غذا","با غذا میل شود", "با غذا مصرف کنید",
            "قبل و یا بعد از غذا \n" +
                    "می توان مصرف کرد\n","با غذا می توان مصرف کرد","","","",

            "همراه غذا مصرف شود","همراه غذا مصرف شود","همراه غذا مصرف شود","همراه غذا یا بعد از غذا","همراه غذا مصرف شود","همراه غذا مصرف شود",
            "باعث افزایش دفع ادراری اسیداوریک \n" +
                    "می شود.\n","باعث کاهش اسیداوریک می شود. مانع تشکیل اسیداوریک در بدن می شود.","باعث کاهش رسوب اسیداوریک می شود.","کاهنده التهاب و درد"};



    String [] nokat = {"\uD83D\uDD39 در ابتدای شروع مصرف ممکن است حالت تهوع و استفراغ شدید داشته باشید که موقت بوده و برطرف می شود\n" +
            "\uD83D\uDD39 درصورتی که داروهای ضد انعقاد خوراکی \n" +
            "( وارفارین ، پلاویکس ) ، فنی توئین ، داروهای تیروئیدی و داروهای ضد فشار خون که ادرار آور هستند مصرف می کنید به پزشک معالج خود اطلاع دهید .\n" +
            "\uD83D\uDD39 دارو را طبق تجویز پزشک مصرف نمایید و خودسرانه قطع و کم  و زیاد ننمایید .\n" +
            "\uD83D\uDD39 برای جلوگیری از افت قند وعده های غذایی و میان وعده را حذف ننمایید.\n",

            "\uD83D\uDD39 پیش از شروع درمان با این قرص و سپس بصورت دوره ای آزمایشات عملکرد کلیه و کبد بررسی شود .\n" +
                    "\uD83D\uDD39 در صورت مصرف داروهای ضد انعقاد خوراکی \n" +
                    "( وارفارین ، پلاویکس ) پزشک معالج خود را مطلع نمایید .\n" +
                    "\uD83D\uDD39 48 ساعت قبل و 48 ساعت بعد از تزریق ماده حاجب وریدی ( برای برخی تصویر برداری ها انجام می شود ) باید دارو قطع شود.\n" +
                    "\uD83D\uDD39 در صورت بروز اسهال و استفراغ با مصرف این قرص به پزشک اطلاع دهید .\n" +
                    "\uD83D\uDD39 برای کاهش عارضه گوارشی بهتر است دارو همراه یا بعد از غذا مصرف شود.\n",

            "\uD83D\uDD39 در بیماران سیروز کبدی و کولیت التهابی و انسداد گوارشی استفاده نشود .\n" +
                    "\uD83D\uDD39 نفخ شدید و اسهال را به پزشک معالج اطلاع دهید.\n" +
                    "\uD83D\uDD39 در کراتی نین 2/2 و حاملگی استفاده نشود.\n",

            "\uD83D\uDD39 در صورت عفونت تنفسی ، سردرد ، درد عضلانی ، زخم گلو ، دندان درد ، افزایش وزن و ورم پاها و خستگی بیش از حد ، پزشک معالج را مطلع نمایید .\n" +
                    "\uD83D\uDD39 این دارو اثر داروهای  ضد بارداری خوراکی را کاهش می دهد.\n" +
                    "\uD83D\uDD39 آزمایشات CBC و آنزیم کبدی دوره ای بررسی شود.\n",

            "\uD83D\uDD39 سردرد ، دندان درد ، درد مفاصل و برونشیت را به پزشک معالج اطلاع دهید .\n" +
                    "\uD83D\uDD39  در بیماران کلیوی ، دوران شیردهی و بارداری ممنوع می باشد .\n",

            "\uD83D\uDD39  در اوائل مصرف این دارو از انجام فعالیتهایی که نیاز به هوشیاری کامل دارند پرهیز نمایید .\n" +
                    "\uD83D\uDD39  در صورت مصرف داروهایی مثل فنی توئین ، ریفامپین و کورتون لازم است به پزشک معالج اطلاع دهید .\n",

            "\uD83D\uDD39باید هر روز صبح و در ساعت معینی با معده خالی (1 ساعت قبل یا 2 ساعت بعد از غذا) مصرف شود.\n" +
                    "\uD83D\uDD39دوز فراموش شده را می توان تا 12 ساعت بعد استفاده کرد. \n" +
                    "\uD83D\uDD39 نحوه ی گرفتن نبض را یاد بگیرید. و با ضربان بین 60-100 دارو را مصرف کنید.\n" +
                    "\uD83D\uDD39 برخی مواقع ممکن است بنا به نظر پزشک دو روز در هفته این قرص را مصرف نکنید.. \n" +
                    "\uD83D\uDD39 در خصوص مصرف فراورده های گیاهی مانند(الوئه ورا ،جیسینگ، زالزالک)ومکمل های کلسیم و ویتامین د احتیاط شود. \n" +
                    "\uD83D\uDD39 فیبرهای غذایی مانند سبوس گندم می تواند موجب کاهش دارو در بدن شود.\n" +
                    "\uD83D\uDD39 این دارو سبب تخلیه پتاسیم می شود بنابراین مواد حاوی پتاسیم (موز ، گوجه فرنگی،طالبی ،زردالو ،سیب زمینی ،قارچ، انگور،خرما ) توصیه می شود." +
                    "\n\uD83D\uDD39 تهوع ، استفراغ، ضربانات نامنظم قلب، توهم بینایی و بی اشتهایی از علائم مسمومیت با دیگوکسین می باشد که باید به پزشک مراجعه کنید.",

            "\uD83D\uDD39 دارو را با غذا یا شیر میل کنید. \n" +
                    "\uD83D\uDD39 رژیم پر  پتاسیم مثل موز- گوجه فرنگی، خرما، کاهو، خشکبار و گردو داشته باشید.\n" +
                    "\uD83D\uDD39 از تغییر وضعیت ناگهانی ، ورزش در هوای گرم وایستادن به مدت طولانی پرهیزکنید. \n" +
                    "\uD83D\uDD39 در صورت بروز ضعف و گرفتگی عضلانی ،تهوع ، سرگیجه، بی حسی سوزن سوزن شدن اندام ها به پزشک مراجعه کنید.\n",

            "\uD83D\uDD39 در صورت بروز خونریزی لثه یا کبودی روی پوست یا دفع خون از مدفوع حتما به پزشک مراجعه شود. \n" +
                    "\uD83D\uDD39 به دلیل بروز عوارض گوارشی با یک لیوان شیر یا آب میوه بعد از غذا میل شود. \n" +
                    "\uD83D\uDD39 در بیماران مبتلا به آسم و زخم گوارشی فعال منع مصرف دارد.\n",

            "\uD83D\uDD39 از مصرف همزمان با گریپ فروت اجتناب نمائید.\n" +
                    "\uD83D\uDD39 از تغییر وضعیت ناگهانی پرهیز نمائید.\n" +
                    "\uD83D\uDD39 در صورت ورم شدید اندام ها، دست و پا، همچنین یبوست، کوتاهی نفس، طپش قلب و ضربان نامنظم قلب به پزشک مراجعه نمائید.\n",

            "\uD83D\uDD39 قبل از شروع مصرف دارو، بایستی عملکرد کبد و کلیه بررسی گردد.\n" +
                    "\uD83D\uDD39 مصرف همزمان با دیگوکسین، احتمال مسمومیت با دیگوکسین را افزایش می دهد.\n" +
                    "\uD83D\uDD39 مصرف نمک و کنسروها، گوجه فرنگی، لبنیات و کلم را محدود نمائید.\n" +
                    "\uD83D\uDD39 مصرف شیرین بیان، نوشیدنی های کافئین دار (چای و قهوه) و گریپ فروت را محدود نمائید.\n" +
                    "\uD83D\uDD39 نحوه گرفتن نبض را یاد بگیرید و نبض زیر 50 را اطلاع دهید.\n",
            "\uD83D\uDD39 می توان دارو را قبل یا بعد از غذا میل کرد.\n" +
                    "\uD83D\uDD39 6-12 هفته بعد آزمایشات کبدی چک شود. \n" +
                    "\uD83D\uDD39 برنامه غذایی کم چرب و برنامه ورزشی منظم داشته باشید. \n" +
                    "\uD83D\uDD39 در صورت استفاده همزمان با دیگوکسین با پزشک مشورت شود.\n",
            "\uD83D\uDD39 مصرف این دارو بیمار را مستعد خون ریزی می کند باید از ضربه یا بریدگی پیشگیری شود و در صورت خونریزی از لثه یا بینی و یا خون مردگی در بدن، دارو قطع و به پزشک مراجعه شود.\n" +
                    "\uD83D\uDD39 اومپرازول و اس آمپرازول باعث کاهش اثر بخشی داروئی می شود و بهتر است از پنتوپرازول در صورت نیاز استفاده شود.\n",
            "\uD83D\uDD39 این دارو در پیشگیری درد قلبی موثر است.\n" +
                    "\uD83D\uDD39 دارو را با معده خالی (1 ساعت قبل یا 2 ساعت بعدازغذا ) مصرف کنید. \uD83D\uDD39 درصورت ایجاد  سر درد با غذا مصرف کنید. \n" +
                    "\uD83D\uDD39 سردرد عارضه شایع این دارو است که با مسکن برطرف می شود، اگر سردرد شدید و پایدار بود به پزشک مراجعه شود. \n" +
                    "\uD83D\uDD39 برافروختگی صورت و احساس سوزش زیر زبان از عوارض دارو می باشد.\n",
            "\uD83D\uDD39 این دارو در پیشگیری دردهای قلبی موثر است.. \n" +
                    "\uD83D\uDD39 دارو دور از رطوبت ، نم ، گرما نگهداشته شود.\n" +
                    "\uD83D\uDD39 نگهداری  در ظروف مقوایی ،کاغذی ومخلوط نمودن با سایر قرصها وتماس ظرف قرص بابدن (جیب پیراهن) باز کردن مکرر درب قوطی  خودداری کنید.\n" +
                    "\uD83D\uDD39 سردرد با این دارو  کمتر دیده می شود . \n" +
                    "\uD83D\uDD39 در صورت تاری دید یا خشکی دهان مصرف را قطع و به پزشک مراجعه کنید.\n",
            "\uD83D\uDD39 صبحها در ساعت معینی مصرف شود تا شب ادراری شما را ناراحت  نکند. \n" +
                    "\uD83D\uDD39 در افراد دیابتی ،قند خون مرتب کنترل شود.\n" +
                    "\uD83D\uDD39 نوبت عصر را قبل از ساعت6 بعداز ظهر میل کنید\n",
            "\uD83D\uDD39 اثر درمانی بعد از یک هفته مشاهده میشود. \n" +
                    "\uD83D\uDD39 نحوه گرفتن نبض را یاد بگیرید و با ضربان بین 100-60 دارو مصرف کنید. \n" +
                    "\uD83D\uDD39 همراه غذا یا بلا فاصله بعد از غذا مصرف کنید .\n" +
                    "\uD83D\uDD39 2 ساعت قبل تا 6 ساعت بعد از مصرف ،آب پرتقال و مکمل کلسیم نخورید\n" +
                    "\uD83D\uDD39 از مصرف هم زمان شیرین بیان با این دارو خوداری کنید.\n" +
                    "\uD83D\uDD39 دارو نباید بطور ناگهانی قطع شود.\n" +
                    "\uD83D\uDD39 افراد دیابتی مرتب قند خون را چک کنند.\n",
            "\uD83D\uDD39 به منظور افزایش جذب دارو آن را همراه با غذا مصرف کنید. \n" +
                    "\uD83D\uDD39 حداکثر اثر دارو ممکن است تا 3 روز پس از شروع درمان ایجاد شود و نیز افزایش ادرار ممکن است به مدت 2 یا 3 روز پس از قطع دارو ادامه یابد. \n" +
                    "\uD83D\uDD39 از جایگزینی مایعات از دست رفته با مقدار زیادی آب اجتناب کنید. \n" +
                    "\uD83D\uDD39 از مصرف زیاد غذاهای سرشار از پتاسیم (در صورتی که همراه با قرص لازیکس تجویزنشده) و جانشین های نمک اجتناب کنید.\n",
            "\uD83D\uDD39 به علت احتمال کاهش فشار خون وضعیتی، آهسته تغییر وضعیت دهید. \n" +
                    "\uD83D\uDD39 از ایستادن بدون حرکت به مدت طولانی، حمام یا دوش داغ و ورزش شدید اجتناب کنید. \n" +
                    "\uD83D\uDD39 در صورت سرگیچه حتما دراز بکشید و پاها را بالاتر قرار دهید.\n" +
                    "\uD83D\uDD39 مصرف نمک ،کنسروها ولبنیات محدود شود.\n",
            "\uD83D\uDD39 همراه غذا یا بلا فاصله بعد از غذا مصرف کنید\n" +
                    "\uD83D\uDD39 2 ساعت قبل تا 6 ساعت بعد از مصرف ،آب پرتقال و مکمل کلسیم نخورید.\n" +
                    "\uD83D\uDD39 از مصرف هم زمان شیرین بیان با این دارو خودداری کنید.\n" +
                    "\uD83D\uDD39 دارو نباید بطور ناگهانی قطع شود، قطع ناگهانی دارو می تواند منجر به افزایش شدید فشارخون شود.\n" +
                    "\uD83D\uDD39 نبض خود را قبل از مصرف کنترل کنید، در صورتی که ضربان کمتر از 60 یا بیشتر از100 باشد، به پزشک خود اطلاع دهید.\n",
            "\uD83D\uDD39 دارو را باید در درجه حرارت 30-15 درجه و بدور از نور نگهداری کنید.\n" +
                    "\uD83D\uDD39 بدنبال مصرف خوراکی دارو بخصوص در دوزهای بالا و شروع درمان، علائم گوارشی دیده می شود. \n" +
                    "\uD83D\uDD39 علائم اغلب با تجویز دارو در دوزهای منقسم و همراه با غذا کاهش می یابد.\n" +
                    "\uD83D\uDD39 قبل از شروع درمان و بصورت دوره ای پس از  شروع درمان، بایستی عملکرد کبد، ریه ها، تیروئید، دستگاه گوارش و سیستم عصبی ارزیابی گردد.\n" +
                    "\uD83D\uDD39 فشار خون خود را بطور دوره ای کنترل نمائید.\n" +
                    "\uD83D\uDD39 نبض خود را روزانه کنترل نمائید و حالات غیر طبیعی را گزارش نمائید.\n" +
                    "\uD83D\uDD39 در طی مدت درمان و تا 4 ماه پس از قطع درمان، از قرار گرفتن در معرض نور مستقیم خورشید پرهیز نمائید.\n" +
                    "\uD83D\uDD39 انجام رادیوگرافی قفسه سینه و انحام تست های فعالیت ریه هر 3 تا 6 ماه و معاینات چشمی 6 ماه پس از درمان و سپس سالیانه را پیگیری نمائید.\n",
            "\uD83D\uDD39 در صورت مصرف درازمدت، به صورت دوره ای، آزمایشات: CBC ، عملکرد کبد و کلیه را انجام دهید.\n" +
                    "\uD83D\uDD39 در طول مدت مصرف دارو، از اقدام جهت حاملگی اجتناب نمائید.\n" +
                    "\uD83D\uDD39 مصرف نمک را کاهش دهید، از مکمل های پتاسیم، جایگزین های نمک، و الکل اجتناب نمائید.\n" +
                    "\uD83D\uDD39 در صورت وجود درد، حساس شدن یا ضعف ماهیچه ای (عضلانی) غیر طبیعی، بویژه اگر همراه تب و ادرار تیره رنگ باشد، سریعا\" به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 از تغییر وضعیت ناگهانی پرهیز نمائید.\n" +
                    "\uD83D\uDD39 نشانه های حساسیت به دارو شامل کهیر، دشواری در نفس کشیدن، ورم صورت، لب ها، زبان و گلو می باشد که بایستی سریعا\" به پزشک مراجعه نمائید.\n",
            "\uD83D\uDD39 مصرف همزمان با دیگوکسین، احتمال مسمومیت با دیگوکسین را افزایش می دهد.\n" +
                    "\uD83D\uDD39 نحوه گرفتن نبض را یاد بگیرید و نبض زیر 50 و نامنظم را اطلاع دهید.\n" +
                    "\uD83D\uDD39 در سردرد های شدید و مقاوم به درمان، به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 حداقل هفته ای یکبار فشارخون خود را کنترل نموده و در دفترچه یادداشت ثبت نمائید.\n" +
                    "\uD83D\uDD39 مصرف نمک و کنسروها، لبنیات و کلم را محدود نمائید.\n" +
                    "\uD83D\uDD39 مصرف شیرین بیان، نوشیدنی های کافئین دار (چای و قهوه) و گریپ فروت را محدود نمائید.\n",
            "\uD83D\uDD39 قبل از شروع مصرف دارو، در صورت داشتن بیماری کبیدی و کلیوی، حساسیت به رنگ ها و غذا، به پزشک خود اطلاع دهید.\n" +
                    "\uD83D\uDD39 در صورت تاری دید، درد چشم و یا هر تغییر دیگری در دید، بایستی سریعا\" به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 در صورت مشاهده جوش، خارش، گرفتگی صدا، اشکال در تنفس و بلع، هر گونه تورم در دست و پا، دهان و صورت به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 در صورتی که حین مصرف دارو، بیماری شدید، بخصوص، اسهال، استفراغ و تهوع داشتید به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 در صورت تعریق شدید بخصوس در روزهای گرم، مایعات بنوشید. \n" +
                    "\uD83D\uDD39 در صورت مصرف درازمدت، به صورت دوره ای، آزمایشات: CBC ، عملکرد کبد و کلیه را انجام دهید.\n" +
                    "\uD83D\uDD39 در طول مدت مصرف دارو، از اقدام جهت حاملگی اجتناب نمائید.\n" +
                    "\uD83D\uDD39 مصرف نمک را کاهش دهید، از مکمل های پتاسیم، جایگزین های نمک، و الکل اجتناب نمائید.\n" +
                    "\uD83D\uDD39 در صورت وجود درد، حساس شدن یا ضعف ماهیچه ای (عضلانی) غیر طبیعی، بویژه اگر همراه تب و ادرار تیره رنگ باشد، سریعا\" به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 از تغییر وضعیت ناگهانی پرهیز نمائید.\n",
            "\uD83D\uDD39 دارو را منظم مصرف نمایید، خودسرانه قطع نکنید، هر روز سر ساعت منظم مصرف نمایید.\n" +
            "\uD83D\uDD39 دارو را می توان خرد کرد.\n" +
            "\uD83D\uDD39 در صورت مشاهده علائم خونریزی شدید، از قبیل درد و ورم غیر طبیعی، احساس خارش، خونریزی از لثه، خونریزی از بینی، قاعدگی های دردناک و طولانی، مدفوع سیاه یا خون در ادرار، سردرد شدید، سرگیجه، احساس ضعف و خستگی شدید و مشکل در بلع غذا حتماً به پزشک معالج مراجعه نمایید.\n" +
            "\uD83D\uDD39 مصرف همزمان با دارو های ضد قارچ (کتوکنازول)، فنی تونین، کاربامازپین، ضد التهاب غیر استروئیدی و ریفامپین و فلوکستین می تواند عملکرد این دارو را تغییر دهد بنابراین هر دارو (شیمیایی و گیاهی)که مصرف می کنید به پزشک خود اطلاع دهید.\n" +
            "\uD83D\uDD39 آب گریپ فوروت اثر دارو را افزایش می دهد.\n" +
            "\uD83D\uDD39 مصرف الکل احتمال خونریزی را افزایش می دهد.\n" +
            "\uD83D\uDD39 از مصرف همزمان با چای سبز اجتناب شود.\n",
            "\uD83D\uDD39 بهتر است دارو یک ساعت قبل از غذا مصرف شود. \n" +
                    "\uD83D\uDD39 رژیم کم نمک باشد. \n" +
                    "\uD83D\uDD39 در صورت برزو سرفه و تورم پلکها، چشم ها، لب ها، زبان یا مشکلات تنفسی و پوستی دارو قطع و به پزشک مراجعه شود.\n" +
                    "\uD83D\uDD39 از تمرینات شدید و تغییر وضعیت ناگهانی از خوابیده به نشسته یا ایستاده خودداری شود. \n" +
                    "\uD83D\uDD39 ممکن است باعث اختلال چشایی شود که 8 الی 12 هفته خود به خود بر طرف می شود.\n",
            "\uD83D\uDD39 در صورتی که باردار هستید این دارو را مصرف نکنید. همچنین در صورتی که در طول مصرف دارو باردار شدید دارو را قطع و به پزشک مراجعه کنید. \n" +
                    "\uD83D\uDD39 در صورت بروز درد عضلانی و ضعف خصوصا اگر همراه با تب و خستگی غیر معمول و ادرار تیره رنگ باشد حتما به پزشک معالج خود مراجعه نمائید.\n" +
                    "\uD83D\uDD39 قبل از استفاده از داروی دیووان آن را به  خوبی تکان دهید.\n" +
                    "\uD83D\uDD39 اگر دچار استفراغ ، اسهال ، و تعریق بیش از حد و همچنین احساس سبکی در سر ادرار کم و یا نداشتن ادرار ضربان قلب نامنظم یا لرزش در قفسه سینه ، شدید حتما به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 از مکمل های پتاسیم و جایگزین های نمک با این دارو اجتناب کنید.\n" +
                    "\uD83D\uDD39 به آرامی تغییر پوزیشن دهید.\n" +
                    "\uD83D\uDD39 علائم حساسیت به داور شامل کهیر ، دشواری نفس کشیدن ، التهاب صورت ، لب ها و گلو می باشد. در صورت مشاهده آنها به پزشک و پرستار اطلاع دهید.\n" +
                    "\uD83D\uDD39 آزمایشات عملکرد کلیه را بصورت دوره ای انجام دهید.\n",
            "\uD83D\uDD39 معمولا این دارو همزمان با هپارین در بیمارستان شروع \n" +
                    "می شود و دوز مناسب با انجام ازمایش خون تعیین می شود و هرگز از مقدار توصیه شده بیشتر و یا کمتر مصرف نکنید. \n" +
                    "\uD83D\uDD39 میزان وارفارین مصرفی شما توسط پزشک معالج و بر اساس آزمایش خون مخصوصی به نام PT و INR مشخص می شود این آزمایش میزان رقیق شدن خون شما توسط وارفارین را نشان می دهد.\n" +
                    "\uD83D\uDD39 دارو را هر روز در ساعت معینی مصرف کنید. \n" +
                    "\uD83D\uDD39 در صورت خونریزی لثه، بینی یا خون مردگی در بدن ، خون در ادرار و مدفوع تیره دارو را قطع و به پزشک مراجعه کنید.\n" +
                    "\uD83D\uDD39 غذاهایی که باعث کاهش اثر وارفارین در بدن می شوند شامل مواد غذایی حاوی ویتامین K (سبزیجات حاوی برگ سبز تیره، اسفناج، نعناع، جعفری و کاهو، کلم بروکلی، گشنیز، شغلم، پوست خیار، کیوی، روغن دانه سویا، چای سبز، جگر، کشمش)\n" +
                    "\uD83D\uDD39 مواد غذایی که باعث افزایش اثر وارفارین می شوند شامل زردچوبه، پیاز، زنجبیل، سیر.\n" +
                    "\uD83D\uDD39 نکته بسیار مهم اینست که شما تقریباً روزانه این مواد غذایی را به همان مقدار روزهای دیگر مصرف نمائید تاثیری در مقدار داروی مصرفی شما نخواهد گذاشت بطور مثال چنانچه این موارد را یک هفته در مقادیر زیاد مصرف نمائید و هفته دیگر مصرف نداشته باشید نیاز شما به دارو ممکن است متغییر باشد پس سعی نمائید این مواد غذایی را بطور متعادل و منظم مصرف نمائید.\n" +
                    "\uD83D\uDD39 اگر شما قصد باردار شدن دارید یا در طی درمان با وارفارین باردار شدید باید با پزشک خود تماس بگیرید.\n" +
                    "\uD83D\uDD39 جهت جلوگیری از بارداری تا حدالامکان از IUD استفاده نکنید.\n" +
                    "از خلال دندان استفاده نکنید.\n" +
                    "\uD83D\uDD39 بجای استفاده از تیغ برای اصلاح از ریش تراش برقی استفاده کنید.\n" +
                    "\uD83D\uDD39 در هنگام کار کردن با وسایل تیز و برنده دقت بیشتری داشته باشید.\n" +
                    "\uD83D\uDD39 در صورتی که مجبور به اعمال جراحی یا دندانپزشکی باشید به جراح و دندانپزشک و پزشک معالج خود اطلاع دهید.\n" +
                    "\uD83D\uDD39از مسواک نرم استفاده نمایید.\n",


            "* در صورت احتباس ادرار ، خشکی دهان و یبوست مداوم را به پزشک اطلاع دهید.\n" +
            "* از پوست خود در برابر نور خورسید حفاظت نمایید (عینک دودی ، لباس مناسب)\n" +
            "* رنگ ادرار به رنگ آبی متمایل به سبز تغییر می کند.\n" +
            "* در مصرف دراز مدت به طور دوره ای عملکرد کبدو کلیه و معاینه چشم انجام شود.\n" +
            "* دارو را به هیچ عنوان به طور ناگهانی قطع نکنید.\n","* دارو به طور خود سرانه و ناگهانی قطع نکنید.\n" +
            "* ممکن است باعث سرگیجه و خواب آلودگی شود تا زمان مشخص نشدن اثر دارو ، رانندگی و کارهای که نیاز به هوشیاری کامل دارند. اجتناب نمائید.\n" +
            "* در خلال مصرف دارو فشار خون ، قند خون ، و آزمایشات عملکرد کبد کنترل شود.\n","* ممکن است باعث خواب آلودگی ، تاری دید ، و سرگیجه شود. بنابراین تا مشخص نشدن اثر درمانی از رانندگی و کارهای نیازمند هوشیاری کامل اجتناب نماید.\n" +
            "* دارو را همزمان با آنتی اسیدها و دیگوکسین استفاده نکنید.\n" +
            "* در صورت بروز خواب آلودگی و سرگیجه شدید ، تحریک پذیری و راش پوستی دارو را قطع و به پزشک مراجعه نماید.\n","* دارو را مطابق تجویز پزشک و سرساعت مصرف نماید.\n" +
            "* خارش و ترشح واژینال و ضایعات خزء مانند روی زبان ، و مدفوع شل و بدبو را به پزشک معالج اطلاع دهیم.\n","* از خرد کرن و جویدن قرص خودداری کنید و دارو را با یک لیوان آب بخورید.\n" +
            "* زمان مصرف آن با داروهای و شربت های آنتی اسید حداقل یک ساعت فاصله باشد.\n" +
            "* مراقب باشید که در زمان یبوستی که همراه با تهوع و استفراغ و درد شکم از این دارو استفاده نکنید. \n","قرص پیراستام یا (نووتروپیل)\tقرص 400 و 800 میلی گرم\n" +
            "شربت\t\tبعد از سکته مغزی و بعد از جراحی مغز درمان آلزایمر وفراموشی\n" +
            "این دارو محافظ مغز در برابر کمبود اکسیژن \n" +
            "می باشد\t* در نارسایی کبد و کلیه و حاملگی و شیردهی استفاده نشود.\n" +
            "* از قطع ناگهانی دارو اجتناب نمائید.\n","قرص سرتالین \n" +
            "(اسنترا یا زولوفت)\tقرص 10 و 50 نوع محلول آن 25 و 50 میلی گرم\t* درمان افسردگی و اضطراب \n" +
            "* درمان اختلالات خلقی در دوران قاعدگی زنان\tبا غذا یا بدون غذا می توان مصرف کرد.\n" +
            "شکل مایع دارو زولوفت قبل از مصرف باید رقیق شود. با نصف فنجان آب یا آب پرتقال ، لیموناد مخلوط کرده و میل نمائید.  \t* برای رسیدن به اثر ضد افسردگی دارو زمان لازم است.\n" +
            "* از قطع ناگهانی دارو خودداری نمائید.\n" +
            "* بدلیل ایجاد سرگیجه و اختلال درتمرکز تا روشن شدن اثر دارو از رانندگی و کارهای که نیاز به هوشیاری دارند پرهیز نمائید.\n" +
            "* حین مصرف دارو اگر باردار شدید یا قصد بارداری دارید به پزشک معالج خود اطلاع دهید.\n" +
            "* در مدت مصرف دارو از پوست خود در برابر نور آفتاب حفاظت نمائید.\n" +
            "* از مصرف همزمان با الکل اجتناب نمائید.\n" +
            "* در صورت ایجاد ، گر گرفتگی ، تعریق ، سفتی و گرفتگی عضلات و بی خوابی ، گزگز انگشتان و زنگ زدن گوش ، بی قراری و پریشانی فورا به پزشک مراجعه کنید.\n" +
            "* علائم حساسیت به دارو ، ضایعات قرمز و خارش دار پوستی ، تنگی نفس و ورم صورت و لبها می باشد که بایستی دارو را قطع و به پزشک مراجعه نمائید.\n" +
            "* الکل مصرف نکنید.\n","* از انجام فعالیت هایی که امکان جراحت یا کبودی دارد اجتناب کنید.\n" +
            "* اگر مدفوع تیره و یا خون در مدفوع و ادرار، کبودی، خلط خونی دیدید به پزشک و پرستار گزارش کنید.\n" +
            "* در صورت نیاز به خدمات پزشکی یا دندان پزشکی پزشک معالج را در جریان مصرف دارو قرار دهید.\n" +
            "* دارو طبق بروشور دور کمر و ناحیه شکم تجویز شود.\n","* میتوان خرد کرد و با آب مصرف کرد.\n" +
            "* در صورت عود یا طول کشیدن تب به بیش از 72 ساعت به پزشک مراجعه کنید.\n" +
            "* در صورت مصرف طولانی مدت آزمایش خون عملکرد کلیه و کبد بصورت دوره ای انجام شود.\n","* به هیچ عنوان همراه مصرف این قرص از الکل و مواد مخدر استفاده نکنید.\n" +
            "* مصرف در حاملگی و شیردهی، ممنوع است. در صورت شک به حاملگی یا قصد بارداری به پزشک معالج مراجعه نمائید.\n" +
            "* دارو را به طور ناگهانی قطع نکنید.\n" +
            "* در طی مصرف دارو از رانندگی اجتناب نمایید.\n" +
            "* در صورت زرد شدن چشم ها و پوست و تشنج و یا حساسیت به دارو (جوش های پوستی، خارش، ورم در گلو و لب ها و زبان) و مشکل تنفسی و سر گیجه به پزشک مراجعه نمائید.\n","* این دارو را همزمان با دارو ها تتوفیلین، داروهای ضد تشنج و شربت های معده و آنتی اسید و وارفارین استفاده نکنید.\n" +
            "* در صورت بروز درد شکم ، تب ، تهوع و استفراغ را به پزشک اطلاع دهید.\n" +
            "* در صورت بروز اسهال دارو را قطع و به پزشک مراجعه نمایید.\n" +
            "* مدت زمان درمان با این دارو 5 روز می باشد.لزوما 5 روز نیست، 5 روز شایع ترین دستور دریافت است.\n","سفتریاکسون\tویال یک گرمی\n" +
            "500 میلی گرمی\tدارو را بصورت عضلانی و وریدی می باشد.\tهر 12 تا 24 ساعت \t* هر علامتی که نشان دهنده خونریزی باشد مانند کبودی بدن، خونریزی از بینی ، لکه لکه شدن بدن را به پزشک اطلاع دهید (این دارو فلوئور طبیعی روده را در مصرف طولانی مدت تغییر داده و باکتری های مفید روده را که ویتامین K می سازند را کاهش می دهد)\n" +
            "* بروز زائده های خزء مانند و سیاه روی زبان و خارش و ترشح واژینال و مدفوع شل (اسهال) را بخصوص اگر همراه چرک و موکوس باشد و تب را اطلاع دهید.\n" +
            "* قبل از شروع درمان با آن باید از عدم حساسیت به پنی سیلین و سفالوسپورین ها مطمئن شوید.\n" +
            "* علائم حساسیت به دارو، تب و لرز، کهیر، راش و تنگی نفس می باشد که باید دارو سریعاً قطع و اقدام لازم انجام شود .\n" +
            "* در نارسائی کلیه و کبد با احتیاط داده شود.\n" +
            "* در سنگ های صفراوی داده نشود (باعث غلیظ شدن صفرا می شود).\n","پنتوپرازول\tآمپول 40 میلی گرم \n" +
            "قرص 40 و 20 میلی گرم\tدرمان زخم ها و خونریزی های گوارشی \tنیم ساعت (صبحانه)\n" +
            "قبل از غذا مصرف شود.\t* در صورت واکنشهای حساسیتی با این دارو مثل کهیر، خارش، ورم دهان و لب ها، گلو و زبان، تنگی نفس را اطلاع دهید.\n" +
            "* اسهال یا درد شدید معده ، خون در مدفوع ، ادرار کم ، مدفوع کم رنگ و زردی پوست و چشم و کبودی و خونریزی غیرمعمول را اطلاع دهید. \n","* باعث تغییر رنگ ادرار به رنگ قرمز می شود که مشکلی ندارد.\n" +
            "* در صورت بروز تغییر رنگ پوست و خشکی غیر طبیعی به پزشک مراجعه نمائید.\n" +
            "* در طول مصرف عملکرد کبد باید بررسی شود.\n","استرپتومایسین\tویال 1 گرمی\n" +
            "\tدرمان برخی عفونت ها (بخصوص در درمان تب مالت کاربرد دارد)\t\t* داروهای مانند وانکومایسین، آمفوتریسین، سیکلوسپورین نباید با این دارو همزمان استفاده شود.\n" +
            "* این دارو در بارداری منع مصرف دارد.\n" +
            "* هنگام تهیه محلول استرپتومایسین از دستکش استفاده کنید.\n" +
            "* این دارو را نباید به شکل تزریق وریدی استفاده کرد.\n" +
            "* در طی درمان با این دارو به علائم وزوز گوش، کاهش شنوایی، سرگیجه، حساسیت شدید(کهیر، خارش) وتب دقت کرد. در صورت به وجود آمدن این علائم سریع به پزشک اطلاع دهید.\n" +
            "* توصیه می شود در زمان استفاده از این دارو مایعات بیشتر (6 تا 8 لیوان)استفاده کنید.\n" +
            "* در طول درمان با این دارو باید حداقل 1500 سی سی ادرار داشته باشید.\n","* عوارض جانبی این دارو تهوع و استفراغ، اسهال، نفخ شکمی، ریزش مو و سرماخوردگی می باشد.\n" +
            "* مصرف آن در حاملگی و شیردهی طبق نظر پزشک با حداقل دوز مانعی ندارد.\n" +
            "* عملکرد کلیه قبل از مصرف دارو، 3 ماه پس از درمان و بصورت دوره ای سالیانه باید بررسی شود.\n" +
            "* از جویدن و خرد کردن قرص خودداری نمایید.\n" +
            "* اجابت مزاج قبل از مصرف شیاف انجام شود.\n" +
            "* انما با این دارو شب ها و حد اقل 8 ساعت بماند.\n" +
            "* پاسخ درمانی معمولا در خلال 3 – 21 روز ایجاد می شود.\n" +
            "* در صورت بروز خونریزی، تاول، درد، سوزش، خارش در ناحیه رکتوم به پزشک معالج مراجعه نمایید.\n" +
            "* در خلال مصرف این دارو از مصرف دیگر دارو ها بدون دستور پزشک خودداری نماید.\n" +
            "* از قطع ناگهانی قرص پرهیز نماید.\n","* برگه رضایت آگاهانه مبتنی بر انجام آزمایش و خطرات احتمالی ناشی از آن باید توسط بیمار و همراهان درجه 1 وی قبل از آزمون تکمیل، امضاء و ممهور به اثر انگشت شود.\n" +
            "*سابقه حساسیت به ید، مواد حاجب ید دار، پنی سیلین،  اموکسی  سیلین ،آلرژی و آسم، بیماری شدید قلب و عروق و نارسائی کلیه و دهیدراتاسیون منع مصرف دارد.\n" +
            "* سابقه بیماری های سرع و تشنج، تیروئید، میاستنی گراو،کم خونی سلول داسی شکل، مولتیپل میلوما، دیابت همچنین اسهال و استفراغ شدید و مکرر در چند روز اخیر و حاملگی و شیردهی سوال تا تصمیم مناسب اخذ شود.\n" +
            "* کلیه داروهای مصرفی و حتی داروهای غیر نسخه ای مصرفی را اطلاع دهید بخصوص داروهای فشارخون (بتابلوکرها و کلسیم بلوکرها) داروهای ضد سرطان (اینترلوکین 2) و داروهای خوراکی دیابت را اطلاع دهید.\n" +
            "* متفورمین 48 ساعت قبل و بعد از تزریق ماده حاجب باید قطع شود.\n" +
            "* از سلامت آنژیوکت بیمار مطمئن باشید و آنژیوکت سبز یا خاکستری برای وی گرفته شود.\n" +
            "* معمولاً بصورت تزریقی یا خوراکی استفاده می شود؛ در نوع خوراکی قبل از انجام تصویربرداری آمپول در  5/1 لیتر آب حل شده و از 5/1 ساعت قبل از اسکن هر 15 دقیقه یک لیوان خورده ودر انتها به اندازه دو لیوان در بطری نگه داشته شود؛ هنگام مراجعه به واحد تصویربرداری همراه خود داشته باشد.\n" +
            "* قبل از شروع داروی خوراکی، مثانه باید تخلیه شود و حین مصرف دارو به هیچ وجه تا پایان CT، نباید مثانه تخلیه شود؛ در صورتی که بیمار سونداژ باشد، باید کلمپ شود؛ باید مثانه در حین CT با کنتراست خوراکی و وریدی پر باشد.\n" +
            "* ممکن است بیمار به دنبال تزریق ماده حاجب احساس گرمی و برافروختگی پوست و سراسر بدن و طعم فلزی در دهان شود که طبیعی بوده و در عرض چند دقیقه پایان می یابد. سایر علائم حسایت خفیف تهوع، استفراغ، کهیر، تب، سردرد، خارش و سرگیجه می باشد؛ در موارد شدیدتر ممکن است خس خس یا اشکال در تنفس و کاهش فشار خون نیز اتفاق بیفتد، که در صورت بروز آن باید تزریق قطع شود. وقوع حساسیت از بدو تزریق تا 40 دقیق پس از تزریق در حداکثر است اگرچه در برخی موارد نادر تا 48 ساعت پس از تزریق ماده حاجب نیز دیده شده است.\n" +
            "* برای جلوگیری از واکنش های ناخواسته معمولاً از آنتی هیستامین و استروئیدها (هیدروکورتیزون)استفاده می شود.\n" +
            "*3 تا 6 ساعت قبل از آزمون ناشتا باشد.\n" +
            "* چک آزمایش عملکرد کلیه (اوره و کراتنین)قبل از انجام آزمون صورت گیرد و به همراه سونوگرافی به واحد تصویربرداری ارسال شود.(در60 \uF03E BUN و 5/1 \uF03E Cr قابل انجام نیست).\n" +
            "* در صورت انجام باریوم انما و گرافی معده با مواد حاجب تا 10 روز نمی توان CT با کنتراست خوراکی و تزریقی انجام داد.\n" +
            "* پس از اتمام CT با کنتراست خوراکی و تزریقی مثانه تخلیه شود و نوشیدن آب و مایعات فراوان جهت دفع سریعتر دارو توصیه می شود.\n" +
            "* در بیماران مبتلا به نارسائی قلبی پیشرفته بخصوص اگر دارو دیورتیک مصرف می کنند، چندین ساعت بعد از انجام آزمون از نظر عملکرد کلیه باید تحت نظر باشند.\n" +
            "* چک آزمایشات تیروئیدی در صورت تزریق مواد حاجب باید بعد از یک هفته صورت گیرد.\n" +
            "* آزمایشات بیلی روبین، آهن، روی، مس حداقل به فاصله زمانی 48 ساعت بعد از تزریق مواد حاجب ید دار انجام شود.\n" +
            "*قطع موقت شیردهی تا حداقل 24 ساعت پس از تجویز این ماده صورت گیرد.\n","* اگر عوارض جانبي در حين تزريق ايجاد شوند بايد تزريق متوقف شود.\n" +
            "* بيماران بايد قبل و به دنبال مصرف داخل وريدي ماده حاجب كاملاً هيدراته شوند.\n" +
            "* مانند ساير مواد حاجب، به علت احتمال ناسازگاري شيميايي بايد به تنهايي تزريق شود.\n" +
            "* در طي تمام مراحل تزريق بايد استريليته حفظ گردد و دماي دارو بايد هم دماي بدن و اتاق باشد.\n" +
            "* بر آزمايشهاي انعقاد، پلاكت، اريتروسيت، فعال سازي كمپلمان تأثير مي\u200Cگذارد.\n" +
            "* در مایلوگرافی با ویزیپک، رانندگی 24 ساعت پس از تزریق انجام شود.\n" +
            "* سایر موارد که در مورد نکات هنگام مصرف مگلومین ذکر شد در این مورد نیز رعایت شود.\n","* در صورت بروز احساس سوزش در پوست، پوسته پوسته شدن، خارش، تورم، سفت شدن و ضخیم شدن پوست، ضایعات قرمز یا تیره روی پوست، سفتی در مفاصل همراه با مشکل در حرکت، خم کردن یا صاف کردن دست ها، پاها، درد در استخوان ران یا دنده ها، یا ضعف عضلانی با پزشک خود تماس بگیرید.\n" +
            "* در موارد منع MRI ممنوعیت دارد (داشتن پیس میکر = ضربان ساز قلبی ، گیره های فلزی عروقی)\n" +
            "* دوتارم تنها به صورت تزریق وریدی قابل استفاده است.\n" +
            "* در صورت بروز علائم زیر بعد از تزریق دوتارم به پزشک و پرستار خود اطلاع دهید: سرماخوردگی، سرد شدن پوست، سردرگمی، سرگیجه، سردرد،ضربان قلب نامنظم و کوبنده، صدای پتک در گوش، عصبی شدن، ضربان قلب آهسته یا سریع .\n" +
            "* سایر موارد که در مورد نکات هنگام مصرف مگلومین و ویزیپک ذکر شد در این مورد نیز رعایت شود.\n",


            "\uD83D\uDD39 راش ، قرمزی ، خارش ، ضعف عضلانی عوارض این دارو می باشد.\n" +
                    "\uD83D\uDD39 اسید فولیک رنگ ادرار را شدیداً زرد می کند.\n",
            "\uD83D\uDD39 در صورت بروز علایمی نظیر بی اشتهایی ، تکرر ادرار ، خشکی دهان ، گیجی و هذیان که نشان دهنده افزایش بیش از حد کلسیم در بدن می باشد باید سریعا به پزشک خود مراجعه کنید. \n" +
                    "\uD83D\uDD39 آنتی بیوتیک ها و آهن ، جذب خوراکی کلسیم را مختل می کنند به همین دلیل با فاصله زمانی از هم مصرف میشوند.\n" +
                    "\uD83D\uDD39 مصرف بیش از نیاز مکمل های کلسیم با افزایش شدید کلسیم خون ٬ رسوب این مواد در کلیه ها ٬ بروز فشار خون و عوارض آن خواهد شد . لذا بهتر است مصرف مکمل کلسیم تا حداکثر ۱۵۰۰ میلی کرم در روز محدود شود .\n" +
                    "\uD83D\uDD39 مصرف زیاد مواد غذایی حاوی سبوس یا غلات کامل همچنین مصرف مقادیر بالای کافئین و الکل جذب کلسیم در روده ها را کاهش می دهد .\n" +
                    "\uD83D\uDD39 بهتر است بین مصرف مکمل کلسیم و سایر دارو ها ( یا مکمل ها نظیر مکمل آهن ) حداقل دو ساعت فاصله داده شود . تا تداخلی بین این داروها ایجاد نشود .\n" +
                    "\uD83D\uDD39 جهت جذب بهتر کلسیم در بدن بهتر است منابع غذایی کلسیم ( یا مکمل های کلسیم ) طی چند نوبت در طول روز مورد استفاده قرار گیرند .\n",
            "\uD83D\uDD39 عوارض ان  سردرد  ، تهوع ، استفراغ ، کاهش فشار خون\n" +
                    "\uD83D\uDD39  فاصله مصرف رناژل با داروهای ضد تشنج ،  وارفارین و سیپروفلوکساسین باید حداقل یک تا دو ساعت باشد.\n",
            "\uD83D\uDD39  افت فشار خون ، تغییر موقت حس چشایی ، تهوع و احساس طعم فلز در دهان از عوارض این دارو می باشد .\n" +
                    "\uD83D\uDD39 بصورت تزریق انفوزیون وریدی استفاده می شود.(در سرم نرمال سالین رقیق شده)\n" +
                    "\uD83D\uDD39 100 میلی گرم این دارو در 100 سی سی سرم حداقل ظرف 15 دقیقه انفوزیون شود.\n" +
                    "\uD83D\uDD39 از مخلوط کردن آن با سایر دارو ها و محلول های تغذیه وریدی اجتناب شود.\n" +
                    "\uD83D\uDD39 در صورت بروز سردرد، تهوع، گیجی، درد عضلانی، پاراستزی (گزگز و بی حسی اندام ها)، درد شکم و پشت به پزشک مراجعه شود. این موارد ممکن است 1 تا 2 روز بعد از تزریق وریدی یا 3 تا 7 روز بعد از تزریق عضلانی ایجاد شود.\n" +
                    "\uD83D\uDD39 نیم ساعت بعد از تزریق در بستر بمانید.\n",
            "\uD83D\uDD39 عوارض این دارو خواب آلودگی ، سردرد ، ضعف ، تاری دید ، بی اشتهایی، تهوع، تشنگی، سرگیجه و یبوست می باشد.\n" +
                    " \uD83D\uDD39  در بيماران مبتلا به عيب كار كليه يا درصورت مصرف مقادير زياد ويتامين، تعيين غلظت كلسيم پلاسما ضروري است. \n" +
                    "\uD83D\uDD39 اندازه گيري غلظت كلسيم سرم در اوايل درمان هرهفته يكبار به منظور تنظيم دوز دارو و سپس فواصل منظم در طول درمان، ضروري است.\n" +
                    "\uD83D\uDD39ا از مصرف همزمان داروهاي ضداسيد حاوي منيزيم با اين دارو بايد خودداري شود. \n" +
                    "\uD83D\uDD39 اين دارو نبايد بيش از مقدار مجاز توصيه شده در روز مصرف شود.\n",
            "\uD83D\uDD39  تزریق بصورت زیر جلدی با استفاده از سرنگ انسولین ( حداکثر حجم تزریقی باید 1 سی سی با شد ) محل تزریق بازوها و دیواره قدامی شکم ، دور ناف ) که باید به طور مداوم تغییر کند.\n" +
                    "\uD83D\uDD39  در درجه حرارت 2 تا 8 در جه سانتی گراد نگهداری و از یخ زدگی آن جلوگیری شود . رنگ محلول باید شفاف باشد.\n" +
                    "\uD83D\uDD39 قبل از تزریق ، فشار خون کنترل شود در صورت فشار بالای 160 میلی گرم جیوه در منزل دارو تزریق نشود . \n" +
                    "\uD83D\uDD39 با مصرف بیش از اندازه اپرکس غلظت خون افزایش می یابد که می تواند باعث از کار افتادن فیستول شود و همچنین باعث افزایش فشار خون می شود . \n",
            "\uD83D\uDD39 این دارو باعث کاهش کلسیم می شود بنابراین در سطح کلسیمی پایین تجویز نمی شود. \n" +
                    "\uD83D\uDD39 مقدار مصرف این دارو حتما باید تحت نظر پزشک و بر اساس آزمایشات خونی و شدت بیماری تعیین می گردد.\n" +
                    "\uD83D\uDD39 از خرد کردن و جویدن دارو خودداری شود، قرص کاملا بلعیده شود.\n",
            "\uD83D\uDD39  به علت عوارض خونی ، عصبی ، استخوانی ، از مصرف طولانی مدت این دارو باید اجتناب شود  . \n" +
                    "\uD83D\uDD39یبوست نیز از عوارض مهم به شمار می رود . \n",
            "\uD83D\uDD39 این دارو باعث سلامت و نگهداری بافت ها تقویت و بهبود عملکرد سیستم ایمنی و عصبی بدن می شود.\n" +
                    "\uD83D\uDD39 مصرف این مکمل در بارداری و شیردهی باید تحت نظر پزشک متخصص باشد.\n" +
                    "\uD83D\uDD39 بین مصرف این مکمل و تتراسایکلین\u200Cها باید حداقل ۳ ساعت فاصله وجود داشته باشد.\n" +
                    "\uD83D\uDD39 مصرف این مکمل برای بیماران کلیوی که دچار گلودرد، التهاب دهان و لثه و ورم زبان شده\u200Cاند، توصیه می\u200Cشود.\n" +
                    "\uD83D\uDD39 مکمل غذایی نفروویت فاقد قند است.\n" +
                    "\uD83D\uDD39 نفروویت را هم\u200Cزمان با وعده\u200Cهای غذایی حاوی لبنیات مصرف نکنید.\n" +
                    "\uD83D\uDD39 مصرف همزمان قرص\u200Cهای آهن و مکمل نفروویت پیشنهاد نمی\u200Cگردد.\n" +
                    "\uD83D\uDD39 این مکمل غذایی برای افراد عادی هم می\u200Cتواند مورد استفاده قرار بگیرد، اما بهتر است با تجویز پزشک باشد.\n" +
                    "\uD83D\uDD39 از آنجاییکه مصرف این مکمل همزمان با درمان دیالیز سبب دفع آن از بدن می\u200Cگردد، بهتر است بعد از دیالیز و قبل از درمان بعدی مصرف شود.\n",
            "\uD83D\uDD39 چند هفته طول می کشد تا دارو اثر خود را نشان دهد تاثیر دارو با تغییر در وضعیت بهبود فشار خون ، وزن ، نبض و هورمون های تیروئید درخون مشخص می شود.\n" +
                    "\uD83D\uDD39 بایستی بطور دوره ای آزمایشات تیروئید انجام دهید و براساس آن پزشک مقدار مصرف قرص را تعیین می کند (یعنی مقدار مصرف دارو در طول سال براساس آزمایشات شما تغییر می کند.)\n" +
                    "\uD83D\uDD39 در صورت بروز عفونت و تب بالا ، التهاب حلق و زخم های دهان و لکه های پوستی ، درد مفاصل و زردی پوست باستی دارو را قطع و به پزشک مراجعه نماید.\n" +
                    "\uD83D\uDD39 در هنگام مصرف این دارو ، از داروهای ضد احتقان(گرفتگی) بینی استفاده نکنید.\n" +
                    "\uD83D\uDD39 در صورت بارداری یا قصد بارداری حتما به پزشک مراجعه کنید.\n" +
                    "\uD83D\uDD39 دارو را خودسرانه کم و زیاد و ناگهانی قطع نکنید.\n",
            "\uD83D\uDD39 برای اطمینان از تأثیر دارو باید مرتب به پزشک مراجعه شود و بصورت دوره ای آزمایش خون بدهید، تا مقدار مناسب قرص برای شما تجویز شود.\n" +
                    "\uD83D\uDD39 دارو را خود سرانه قطع و کم و زیاد نکنید.\n" +
                    "\uD83D\uDD39 هنگام مراجعه به دندانپزشک و سایر پزشکان حتماً بگویید که کم کاری تیروئید دارید و قرص لووتیروکسین مصرف می کنید.\n" +
                    "\uD83D\uDD39داروهای زیر چون باعث کاهش اثر قرص لووتیروکسین می شوند باید 4 ساعت قبل یا 4 ساعت بعد از این قرص مصرف شوند.\n" +
                    "این داروها: کربنات کلسیم، داروهای زخم معده، شربت های معده (حاوی آلومینیوم)، وارفارین، داروهای پایین آورنده چربی، انسولین و داروهای خوراکی دیابت می باشند.\n" +
                    "\uD83D\uDD39 در صورت بروز اسهال، تعریق، افتادگی پلک، افزایش ضربان قلب، لرزش دست ها و افزایش اشتها، عصبانیت، عدم تحمل گرما و کاهش وزن بایستی به پزشک معالجتان مراجعه کنید.\n",
            "\uD83D\uDD39در مصرف طولانی مدت دارو آزمایشات عملکرد کبد و سطح ویتامین D ، اسیدفولیک و آزمایش CBC (گلبولهای قرمز و سفید خون) انجام شود.\n" +
                    "\uD83D\uDD39 در صورت بارداری و قصد بارداری به پزشک معالج خود اطلاع دهد.\n" +
                    "\uD83D\uDD39 در بیماری های شدید ریه منع مصرف دارد.\n" +
                    "\uD83D\uDD39 در صورتی که قادر به بلعیدن نیستید دارو را خرد کرده با غذا و مایعات بخورید.\n",
            "\uD83D\uDD39  در صورت بروز تب ، گلو درد ، خونریزی ، درد شکم ، لرز، بی رنگ شدن مدفوع یا  زردی پوست ،خونریزی غیر معمول ،پتشی (دانه های قرمز روی پوست)به پزشک \n" +
                    "\uD83D\uDD39در خلال مصرف آن از روش های دیگر تغذیه جایگزین شیر مادر استفاده شود. \n" +
                    "\uD83D\uDD39قبل از شروع درمان با آن ازمایشات CBC   BUN –U/A-، آهن ، عملکرد کبد باید بررسی شوند.\n" +
                    "\uD83D\uDD39 در زمان مصرف کاربامازپین از داروهای هورمونی استفاده نکنید\n" +
                    " \uD83D\uDD39از مصرف همزمان یا به فاصله 14روز با مهار کننده مونو آمین اکسیداز {داروهای ضدافسردگی شامل :\n" +
                    "ایزوکاربوکساز ,(Marplan)فنلزین . (Nardil) سلژیلین      . (Emsam) ترانیل سیپرومین{ (Parnate)اجتناب شود باعث افزایش فشار خون ،تب ،تشنج ومرگ شود.\n",
            "\uD83D\uDD39 مصرف همزمان با داروهای رقیق کننده خون (آسپرین وارفارین) و داروهای دیکلوفناک ، ایندومتاسین ، ژلوفن ، خطر خونریزی افزایش \n" +
                    "می یابد.\n" +
                    "\uD83D\uDD39 درهنگام مصرف دارو به صورت دوره ای آزمایش کبد و پلاکت خون انجام شود.\n" +
                    "\uD83D\uDD39 از جویدن قرص اجتناب کرده قرص را با یک لیوان آب بلع نماید.\n" +
                    "\uD83D\uDD39 تهوع و استفراغ شدید ، تب ، گلودرد ، خونریزی و خون مردگی غیر معمول ، حاملگی ، زردی رنگ پوست و چشم به پزشک معالج اطلاع دهد.\n",
            "\uD83D\uDD39 دارو را مطابق تجویز پزشک مصرف نمائید فراموش و کم و زیاد ننماید.\n" +
                    "\uD83D\uDD39 به دلیل بروز خواب آلودگی ، سرگیجه و منگی ، از رانندگی و کار با  ماشین آلات که نیاز به هوشیاری دارند باید خودداری شود.\n" +
                    "\uD83D\uDD39 عدم تمرکز ، فراموش کاری ، حرکات غیرطبیعی چشم ها را به پزشک اطلاع دهید.\n" +
                    "\uD83D\uDD39 در حاملگی ، شیردهی ، نارسائی کبدو کلیه استاده نشود.\n" +
                    "\uD83D\uDD39 در صورت بروز تاول و تب ، چشم های قرمز  و زخم  در دهان ،بینی با گلو را سریعا به پزشک مراجعه نمایید.\n",
            "\uD83D\uDD39 در صورت بروز علائم آنفلونزا ، گلودرد ، آبریزش و گرفتگی بینی ، تغییرات شدید خلق و خو احساس لرزش و خستگی شدید خشکی و التهاب چشم و لکه های قرمز پوستی حتما به پزشک معالج مراجعه نمائید.\n" +
                    "\uD83D\uDD39 در صورت بارداری و یا قصد بارداری به پزشک معالج خود اطلاع دهید.\n" +
                    "\uD83D\uDD39از غذای پرچرب و پر ادویه پرهیز نمائید.\n" +
                    "\uD83D\uDD39 از رانندگی یا کارهایی که نیاز به هوشیاری کامل دارند پرهیز نمائید.\n" +
                    "\uD83D\uDD39 در نارسایی کبد و کلیه با احتیاط مصرف شود.\n",
            "\uD83D\uDD39 در صورت عدم کنترل تشنج یا تشدید آن ، عدم تعادل ، تاری دید و دوبینی ، تب و علائم شبه آنفلونزا و لکه های پوستی سریعا به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 زیاد در معرض نور خورشید قرار نگیرد و یا از مواد حفاظت کننده استفاده نماید.\n" +
                    "\uD83D\uDD39 از مصرف همزمان اسید فولیک ، استامینوفن و سایر داروهای ضد تشنج با آن اجتناب نمایید.\n" +
                    "\uD83D\uDD39 در اوایل درمان با لاموتریژین از انجام فعالیت هایی که به هوشیاری کامل نیاز دارند اجتناب کنید.\n" +
                    "\uD83D\uDD39 در صورت بارداری و یا قصد بارداری به پزشک معالج مراجعه نمائید. از روش های مطمئن به غیر از قرص های ضد بارداری برای پیشگیری استفاده نمایید\n",
            "\uD83D\uDD39 در درمان صرع شدید  که به داروهای دیگر جواب نداده ، استفاده می شود.\n" +
                    "\uD83D\uDD39 آزمایشات دوره ای خون که توسط پزشک تجویز می شود باید بصورت مرتب انجام شود.\n" +
                    "\uD83D\uDD39 در صورت بروز علائمی مانند خستگی ، ادرار تیره ، مدفوع روشن ، زردی پوست یا چشم و همچنین در صورت مشاهده مدفوع سیاه، عدم کنترل ادرار ، تب ، زخم دهان و گلو ، کبودی بی جهت و سرفه دائمی و افسردگی ، ادرار دردناک در حین مصرف این دارو یا حتی چند ماه پس از قطع مصرف ، سریعا به پزشک مراجعه نمائید.\n",
            "\uD83D\uDD39 در بیماران مبتلا به لوپوس ، مشکلات کبدی و کلیوی و افسردگی با احتیاط مصرف شود.\n" +
                    "\uD83D\uDD39 در طول درمان با این دارو از انجام فعالیت هایی که نیاز به هوشیاری کامل دارد اجتناب نمایید.\n" +
                    "\uD83D\uDD39 این دارو ممکن است رنگ ادرار را صورتی یا قهوه ای کند که موردی ندارد.\n" +
                    "\uD83D\uDD39 در صورت بروز تغییرات خلقی، رفتاری، اضطراب و بی قراری به پزشک مراجعه نمایید.\n" +
                    "\uD83D\uDD39 دارو را به طور ناگهانی و خودسرانه قطع نکنید.\n" +
                    "\uD83D\uDD39 در صورت بارداری و یا قصد بارداری به پزشک مراجعه نمایید.\n" +
                    "\uD83D\uDD39 آزمایشات دوره ای خون که توسط پزشک تجویز می شود باید بصورت مرتب انجام شود.\n",
            "\uD83D\uDD39 تهوع و استفراغ شدید ، خواب آلودگی ، لرزش هنگام قدم زدن ، تورم غدد لنفاوی ، خونریزی از لثه ، زردی چشم و پوست ، درد مفاصل ، تب و گلو درد ، خونمردگی غیر معمول و سردرد مقاوم به درمان را اطلاع دهید.\n" +
                    "\uD83D\uDD39 رعایت بهداشت دهان و دندان.\n" +
                    "\uD83D\uDD39 بین مصرف این دارو با شربت های آنتی اسید دو تا سه ساعت فاصله باشد. \n" +
                    "\uD83D\uDD39 مصرف دارو باعث قرمز شدن رنگ ادرار می شود که موردی ندارد.\n" +
                    " \uD83D\uDD39 این دارو اثر دیگوکسین و داروهای ضد بارداری خوراکی را کاهش می دهد.\n" +
                    "\uD83D\uDD39 مصرف همزمان با وارفارین اثر فنی توئین را کاهش می دهد. \n" +
                    "\uD83D\uDD39 این دارو می تواند باعث سرگیجه و خواب آلودگی شود بنابراین تا مشخص شدن اثر دارو از رانندگی و کارهای که نیاز به هوشیاری کامل دارند خودداری نمائید. \n" +
                    "\uD83D\uDD39در صورت عدم قدرت بلع دارو را می توان خرد کرده و با یک لیوان آب میل کنید قبل از آن نیز یک لیوان آب بخورید.\n",

            "\uD83D\uDD39 در صورت بروز وزوزگوش سردرد ،سر گیجه و حالت تهوع و استفراغ ، بروز خون ریزی از لثه و یا کبودی روی پوست و یا وجود خون در مدفوع به پزشک معالج اطلاع دهید.",
            "\uD83D\uDD39 در صورت تاری دید و وزوزگوش ،صدای غرش و زنگ در گوش ،گیجی و خواب آلودگی و افزایش وزن و ورم اندام ها تهوع و استفراغ درد معده و خونریزی گوارش را به پزشک معالج خود اطلاع دهید.",
            "\uD83D\uDD39 در صورت تغییرات بینایی و شنوایی ،کبودی خونریزی ،سردرد ،اشکال در تمرکز ،گیجی ،حساست به نور سفید شدن مو ،به پزشک معالج خود اطلاع دهید.",
            "\uD83D\uDD39 در صورت بروز تب ، زخم های دهانی ، خونریزی غیرطبیعی و کبدی ، تاری دید ، اختلالات بینایی ، و ضعف عضلانی به پزشک مراجعه نمائید.\n" +
                    "\uD83D\uDD39 هر 6ماه جهت معاینات چشمی پزشک مراجعه کنید. \n" +
                    "\uD83D\uDD39 این دارو باعث تغییر رنگ ادرار به رنگ زرد تیره یا قهوه ای می شود که موردی ندارد.\n",
            "\uD83D\uDD39 در صورت تهوع، خستگی، گیجی ، تب،گلو درد و سرفه و افزایش وزن هفتگی بیش از 5/2 کیلوگرم و صورت گرد و ماه شکل ، درد معده به پزشک معالج  خود اطلاع دهید.\n" +
                    "\uD83D\uDD39 از آنجا که این داروها باعث افزایش قند خون می شود . \uD83D\uDD39 رژیم غذایی حاوی مواد قندی کم و پتاسیم مناسب  استفاده کنید.\n",
            "\uD83D\uDD39 در صورت بروز کبودی در پوست خونریزی از لثه، ادرار تیره ،مدفوع روشن ،درد شکم،نقاط سفید و زخم دهان، سردرد، خستگی، تنگی نفس به پزشک معالج خود خبر دهید. \n" +
                    "\uD83D\uDD39 مایعات فراوان استفاده کنید 3-2 لیتر در طول روز، از تماس افراد دچار بیماری های عفونی پرهیز کنید.\n" +
                    "\uD83D\uDD39 با مصرف این داروها  ممکن است دچار طاسی شوید، که بعد از اتمام دوره درمان مشکل برطرف می شود .\n" +
                    "\uD83D\uDD39 6 ماه بعد از مصرف دارو از روشهای مطمئن برای جلوگیری از بارداری استفاده کنید .\n" +
                    "\uD83D\uDD39 از قرار گرفتن در مکانهای شلوغ اجتناب شود تا خطر بروز عفونت کاهش یابد\n" +
                    "\uD83D\uDD39 انجام آزمایشات دوره ای خون طی درمان با دارو را طبق نظر پزشک را جدی بگیرید.\n",
            "\uD83D\uDD39 در صورت بروز درد معده، تهوع و استفراغ، از دست دادن اشتها، به پزشک معالج اطلاع دهید.\n" +
                    "\uD83D\uDD39 روزانه 10 تا 12 لیوان مایعات (آب) بنوشید.\n" +
                    "\uD83D\uDD39 دارو در دوران بارداری و کسانی که قصد بارداری دارند ممنوع است.\n",
            "\uD83D\uDD39 قبل شروع دارو و هر یکماه بعد از شروع دارو آزمایش خون (CBC و آزمایشات کبد و کلیه) انجام شود.\n" +
                    "\uD83D\uDD39 هر 1 تا 2 هفته آزمایش اندازه گیری اسیداوریک خون انجام شود.\n" +
                    "\uD83D\uDD39 در صورت بروز تب، درد، بی حالی و بثورات پوستی بخصوص (2 تا 4 هفته بعد از شروع دارو) سریعا\" به پزشک معالج اطلاع دهید.\n" +
                    "\uD83D\uDD39 خارش، لرز، تهوع و استفراغ و راش، علائم حساسیت به دارو بوده که بایستی به پزشک معالج اطلاع دهید.\n" +
                    "\uD83D\uDD39 مایعات فراوان بنوشید.\n" +
                    "\uD83D\uDD39 در طی درمان، غذاهای قلیایی استفاده کنید. غذاهای اسیدی احتمال سنگهای کلیوی را افزایش می دهد.\n",
            "\uD83D\uDD39 در زمان حمله حاد نقرس استفاده می شود و بعد از فروکش کردن حمله و درد بیمار از سایر داروها استفاده می شود.\n" +
                    "\uD83D\uDD39 هنگام مصرف دارو بروز علائم کاهش حجم ادرار، مشکلات تنفسی، اسهال و استفراغ شدید، خونریزی و خون مردگی غیر عادی، گلو درد، را به پزشک معالج اطلاع دهید.\n" +
                    "\uD83D\uDD39 مایعات فراوان 12 – 10 لیوان (ترجیحا\" آب) بنوشید.\n",
            "\uD83D\uDD39در صورت تاری دید، وزوز گوش، صدای غرش و زنگ در گوش، گیجی و خواب آلودگی و افزایش وزن و ورم اندام ها، تهوع ، استفراغ، درد معده و خونریزی گوارشی را به پزشک معالج اطلاع دهید."};




    private SearchView searchView;
    public static Drugs newInstance() {
        Drugs fragment = new Drugs();
        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {
        // Inflate the layout for this fragment
        View v = inflater.inflate(R.layout.fragment_drugs_list_2, container, false);
        ListView lv = (ListView)v.findViewById(R.id.lvDrugs2);
        searchView=v.findViewById(R.id.searchBar);
        final ArrayAdapter<String> arrayAdapter = new ArrayAdapter<String>(getContext(),R.layout.list_textview,list);
        lv.setAdapter(arrayAdapter);
        searchView.setOnQueryTextListener(new SearchView.OnQueryTextListener() {
            @Override
            public boolean onQueryTextSubmit(String query) {
                return false;
            }

            @Override
            public boolean onQueryTextChange(String newText) {
                arrayAdapter.getFilter().filter(newText);
                return true;
            }
        });
        lv.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            @Override
            public void onItemClick(AdapterView<?> parent, View view, int position, long id) {

                Intent intent = new Intent(getContext(),dialogPage_2.class);
                intent.putExtra("value", list[position]);

                intent.putExtra("Tf1", shekl[position]);
                intent.putExtra("Tf2", bakhsh[position]);
                intent.putExtra("Tf3", asar[position]);
                intent.putExtra("Tf4", zaman[position]);
                intent.putExtra("Tf5", nokat[position]);


                startActivity(intent);


            }
        });
        showBackButton();
        return v;
    }

    public void showBackButton() {
        if (getActivity() instanceof MainActivity) {
            ((MainActivity) getActivity()).getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        }
    }
}
