package com.example.nazanin.hospitalapp;


import android.app.FragmentManager;
import android.content.Context;
import android.os.Bundle;
import android.os.Handler;
import android.support.annotation.NonNull;
import android.support.design.widget.BottomNavigationView;
import android.support.v4.app.Fragment;
import android.support.v4.app.FragmentTransaction;
import android.support.v7.app.AppCompatActivity;
import android.support.v7.widget.Toolbar;
import android.view.MenuItem;
import android.view.View;
import android.widget.ImageButton;
import android.widget.Toast;

import com.example.nazanin.hospitalapp.Illness.Illnesses;

import uk.co.chrisjenx.calligraphy.CalligraphyContextWrapper;

public class MainActivity extends AppCompatActivity{

    private Toolbar toolbar;
    private ImageButton backButton;
    private android.support.v4.app.FragmentManager fm;

    protected void attachBaseContext(Context newBase) {
        super.attachBaseContext(CalligraphyContextWrapper.wrap(newBase));
    }

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main);
        final BottomNavigationView bottomNavigationView = findViewById(R.id.navigation);
        toolbar=findViewById(R.id.home_toolbar);
     //   backButton=findViewById(R.id.backButton);
//        backButton.setVisibility(View.INVISIBLE);
        fm = getSupportFragmentManager();

        //disable app name
        setSupportActionBar(toolbar);
        getSupportActionBar().setDisplayShowTitleEnabled(false);
        if (fm.getBackStackEntryCount()>0) {
            getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        }

        toolbar.setTitle("داروها");

        bottomNavigationView.setOnNavigationItemSelectedListener
                (new BottomNavigationView.OnNavigationItemSelectedListener() {
                    @Override
                    public boolean onNavigationItemSelected(@NonNull MenuItem item) {
                        clearStack();
                        getSupportActionBar().setDisplayHomeAsUpEnabled(false);
                        Fragment selectedFragment = null;
                        switch (item.getItemId()) {

                            case R.id.navigation_drugs:
                                toolbar.setTitle("داروها");
                                selectedFragment = Drugs.newInstance();
                                break;

                            case R.id.navigation_illness:
                                toolbar.setTitle("بیماری ها");
                                selectedFragment = Illnesses.newInstance();
                                break;
                            case R.id.navigation_rig:
                                toolbar.setTitle("تجهیزات");
                                selectedFragment = Rigs.newInstance();
                                break;

                            case R.id.navigation_paraclinic:
                                toolbar.setTitle("پاراکلینیکی");
                                selectedFragment= Paraclinic.newInstance();
                                break;
                            case R.id.navigation_info:
                                toolbar.setTitle("درباره ما");
                                selectedFragment = AboutUs.newInstance();
                                break;
                        }
                        FragmentTransaction transaction = getSupportFragmentManager().beginTransaction();
                        transaction.replace(R.id.frame_layout, selectedFragment);
                      //  transaction.addToBackStack(null);
                        transaction.commit();
                        return true;
                    }
                });


        FragmentTransaction transaction = getSupportFragmentManager().beginTransaction();
        transaction.replace(R.id.frame_layout, Drugs.newInstance());
        transaction.commit();


    }

    private void clearStack(){
        getSupportFragmentManager().popBackStack(null, FragmentManager.POP_BACK_STACK_INCLUSIVE);
    }

    boolean doubleBackToExitPressedOnce = false;

    @Override
    public void onBackPressed() {
        if (doubleBackToExitPressedOnce) {
            super.onBackPressed();
            return;
        }
        clearStack();
        this.doubleBackToExitPressedOnce = true;
        Toast.makeText(this, "برای خروج دوباره کلیک کنید", Toast.LENGTH_SHORT).show();

        new Handler().postDelayed(new Runnable() {

            @Override
            public void run() {
                doubleBackToExitPressedOnce=false;
            }
        }, 2000);
    }


    @Override
    public boolean onOptionsItemSelected(MenuItem item) {
        switch (item.getItemId()) {
            case android.R.id.home:

                int backStackCount = fm.getBackStackEntryCount();

                if (backStackCount==1 ) {
                    fm.popBackStack();
                    getSupportActionBar().setDisplayHomeAsUpEnabled(false);
                }
                else if (backStackCount >0) {
                    fm.popBackStack();
                //    String name = getSupportFragmentManager().getBackStackEntryAt(0).getName();
                //    Toast.makeText(this,name,Toast.LENGTH_SHORT).show();
                 //   fm.beginTransaction();

                }
                return true;
            default:
                return super.onOptionsItemSelected(item);
        }
    }

//    String[] list={"امی تریپلین","باکلوفن","کلیندیوم C","مترونیدازول","بیزاکودیل","قرص پیراستام یا (نووتروپیل)","قرص سرتالین \n" +
//            "(اسنترا یا زولوفت)\n","اناکساپرین","استامینوفن","آلپوازولام (زاناکس)","کپسول آزیتروماسین","سفتریاکسون","پنتوپرازول","فنازوپریدین","استرپتومایسین","اساکول \n" +
//            "مسالازین","مگلومین کامپاند","ویزیپک\n" +
//            "(ایودیکسانول)\n","دوتارم\n" +
//            "(گادوترات مگلومین)\n"};
//    String[] shekl={"قرص 10 و 25 میلی گرم","قرص 10 و 25 میلی گرم","قرص 2.5 و 5 میلی گرم","قرص 250 \n" +
//            "میلی گرم\n" +
//            "ویال 500 میلی گرم و کرم واژینال\n","قرص 5 میلی گرم و\n" +
//            "شیاف 10 \n" +
//            "میلی گرم\n","قرص 400 و 800 میلی گرم\n" +
//            "شربت\n","قرص 10 و 50 نوع محلول آن 25 و 50 میلی گرم","آمپول 20 ، 40 ، 60 ،  80 و 100 میلی گرم","قرص 325 و 500 میلی گرم و شیاف ","قرص 0.5 و 1 میلی گرم","قرص و کپسول 250 و 500 میلی گرمی\n" +
//            "و شربت\n","ویال یک گرمی\n" +
//            "500 میلی گرمی\n","آمپول 40 میلی گرم \n" +
//            "قرص 40 و 20 میلی گرم\n","قرص100 میلی گرم","ویال 1 گرمی","قرص 250 و 400 میلی گرم\n" +
//            "شیاف 500 و 1000 میلی گرم\n","آمپول %76 و %60 \n" +
//            "20 سی سی\n" +
//            "- محلول خوراکی %76 گاستروگرافین 100 سی سی\n" +
//            "- ویال %76 (اوروگرافین) 100 سی سی\n","ویال 270 میلی گرمی/ 20 و50 سی سی\n" +
//            "و\n" +
//            "ویال 320 میلی گرمی/20، 50 و 100 سی سی\n","ویال 377 میلی گرمی/ 10، 15 و 20 سی سی"};
//
//    String[] bakhsh={"متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه","متفرقه"};
//
//    String[] asar={"درمان افسردگی","ضد درد و ضد اسپاسم","درمان زخم های گوارشی","درمان عفونت","درمان یبوست","","* درمان افسردگی و اضطراب \n" +
//            "* درمان اختلالات خلقی در دوران قاعدگی زنان\n","جلوگیری از انعقاد خون","ضد درد \n" +
//            "ضد تب\n","ضد اضطراب \n" +
//            "خواب آور و\n" +
//            "آرام بخش\n","درمان عفونت ها","دارو را بصورت عضلانی و وریدی می باشد","درمان زخم ها و خونریزی های گوارشی ","درمان عفونت های مجاری ادراری","درمان برخی عفونت ها (بخصوص در درمان تب مالت کاربرد دارد)","ضد التهاب (غیر استروئیدی) درمان و پیشگیریبیماری التهابی روده (کرون و کولیت اولسراتیو)","داروی تشخیصی حاوی ید می باشد که برای تصویربرداری دستگاه گوارش، بیماری های عروقی، اختلالات مجرای صفراوی، اختلالات مغز،کلیه ، مجاری ادراری، دیسک و مفاصل استفاده \n" +
//            "می شود\n","(این داروی تشخیصی در آنژیوگرافی و ونو گرافی تصویربرداری از عروق و شریان های بدن استفاده می شود.)","ماده حاجب تصویربرداری است که برای MRI به کار میرود.\n" +
//            "برای تجسم ضایعات یا عروق غیر طبیعی در مغز یا آسیب های سد خونی مغزی، ضایعات داخل جمجمه، ستون فقرات و بافت های مرتبط استفاده می شود\n"};
//
//    String[] zaman={"با غذا یا بلافاصله بعد از غذا در صورت نیاز دارو را می توان خرد کرد","همراه غذا مصرف شود","30 الی 60 دقیقه قبل از غذا مصرف نماید","همراه غذا مصرف شود. دارو را می توان خرد کرد و جوید","قرص را هنگام عصر و یا قبل از صبحانه مصرف نمائید","بعد از سکته مغزی و بعد از جراحی مغز درمان آلزایمر وفراموشی\n" +
//            "این دارو محافظ مغز در برابر کمبود اکسیژن \n" +
//            "می باشد\n","با غذا یا بدون غذا می توان مصرف کرد.\n" +
//            "شکل مایع دارو زولوفت قبل از مصرف باید رقیق شود. با نصف فنجان آب یا آب پرتقال ، لیموناد مخلوط کرده و میل نمائید\n","تزریق زیر جلدی","همراه غذا یا بدون آن می توان مصرف کرد","قبل یا بعد از غذا مصرف گردد","با معده خالی یک ساعت قبل یا 2 ساعت بعد از غذا مصرف کنید","هر 12 تا 24 ساعت","نیم ساعت (صبحانه)\n" +
//            "قبل از غذا مصرف شود\n","همراه غذا مصرف شود","","قبل از غذا و قبل از خواب","","","","","","","","","","","","","","","","",""};
//
//    String[] nokat={"* در صورت احتباس ادرار ، خشکی دهان و یبوست مداوم را به پزشک اطلاع دهید.\n" +
//            "* از پوست خود در برابر نور خورسید حفاظت نمایید (عینک دودی ، لباس مناسب)\n" +
//            "* رنگ ادرار به رنگ آبی متمایل به سبز تغییر می کند.\n" +
//            "* در مصرف دراز مدت به طور دوره ای عملکرد کبدو کلیه و معاینه چشم انجام شود.\n" +
//            "* دارو را به هیچ عنوان به طور ناگهانی قطع نکنید.\n","* دارو به طور خود سرانه و ناگهانی قطع نکنید.\n" +
//            "* ممکن است باعث سرگیجه و خواب آلودگی شود تا زمان مشخص نشدن اثر دارو ، رانندگی و کارهای که نیاز به هوشیاری کامل دارند. اجتناب نمائید.\n" +
//            "* در خلال مصرف دارو فشار خون ، قند خون ، و آزمایشات عملکرد کبد کنترل شود.\n","* ممکن است باعث خواب آلودگی ، تاری دید ، و سرگیجه شود. بنابراین تا مشخص نشدن اثر درمانی از رانندگی و کارهای نیازمند هوشیاری کامل اجتناب نماید.\n" +
//            "* دارو را همزمان با آنتی اسیدها و دیگوکسین استفاده نکنید.\n" +
//            "* در صورت بروز خواب آلودگی و سرگیجه شدید ، تحریک پذیری و راش پوستی دارو را قطع و به پزشک مراجعه نماید.\n","* دارو را مطابق تجویز پزشک و سرساعت مصرف نماید.\n" +
//            "* خارش و ترشح واژینال و ضایعات خزء مانند روی زبان ، و مدفوع شل و بدبو را به پزشک معالج اطلاع دهیم.\n","* از خرد کرن و جویدن قرص خودداری کنید و دارو را با یک لیوان آب بخورید.\n" +
//            "* زمان مصرف آن با داروهای و شربت های آنتی اسید حداقل یک ساعت فاصله باشد.\n" +
//            "* مراقب باشید که در زمان یبوستی که همراه با تهوع و استفراغ و درد شکم از این دارو استفاده نکنید. \n","قرص پیراستام یا (نووتروپیل)\tقرص 400 و 800 میلی گرم\n" +
//            "شربت\t\tبعد از سکته مغزی و بعد از جراحی مغز درمان آلزایمر وفراموشی\n" +
//            "این دارو محافظ مغز در برابر کمبود اکسیژن \n" +
//            "می باشد\t* در نارسایی کبد و کلیه و حاملگی و شیردهی استفاده نشود.\n" +
//            "* از قطع ناگهانی دارو اجتناب نمائید.\n","قرص سرتالین \n" +
//            "(اسنترا یا زولوفت)\tقرص 10 و 50 نوع محلول آن 25 و 50 میلی گرم\t* درمان افسردگی و اضطراب \n" +
//            "* درمان اختلالات خلقی در دوران قاعدگی زنان\tبا غذا یا بدون غذا می توان مصرف کرد.\n" +
//            "شکل مایع دارو زولوفت قبل از مصرف باید رقیق شود. با نصف فنجان آب یا آب پرتقال ، لیموناد مخلوط کرده و میل نمائید.  \t* برای رسیدن به اثر ضد افسردگی دارو زمان لازم است.\n" +
//            "* از قطع ناگهانی دارو خودداری نمائید.\n" +
//            "* بدلیل ایجاد سرگیجه و اختلال درتمرکز تا روشن شدن اثر دارو از رانندگی و کارهای که نیاز به هوشیاری دارند پرهیز نمائید.\n" +
//            "* حین مصرف دارو اگر باردار شدید یا قصد بارداری دارید به پزشک معالج خود اطلاع دهید.\n" +
//            "* در مدت مصرف دارو از پوست خود در برابر نور آفتاب حفاظت نمائید.\n" +
//            "* از مصرف همزمان با الکل اجتناب نمائید.\n" +
//            "* در صورت ایجاد ، گر گرفتگی ، تعریق ، سفتی و گرفتگی عضلات و بی خوابی ، گزگز انگشتان و زنگ زدن گوش ، بی قراری و پریشانی فورا به پزشک مراجعه کنید.\n" +
//            "* علائم حساسیت به دارو ، ضایعات قرمز و خارش دار پوستی ، تنگی نفس و ورم صورت و لبها می باشد که بایستی دارو را قطع و به پزشک مراجعه نمائید.\n" +
//            "* الکل مصرف نکنید.\n","* از انجام فعالیت هایی که امکان جراحت یا کبودی دارد اجتناب کنید.\n" +
//            "* اگر مدفوع تیره و یا خون در مدفوع و ادرار، کبودی، خلط خونی دیدید به پزشک و پرستار گزارش کنید.\n" +
//            "* در صورت نیاز به خدمات پزشکی یا دندان پزشکی پزشک معالج را در جریان مصرف دارو قرار دهید.\n" +
//            "* دارو طبق بروشور دور کمر و ناحیه شکم تجویز شود.\n","* میتوان خرد کرد و با آب مصرف کرد.\n" +
//            "* در صورت عود یا طول کشیدن تب به بیش از 72 ساعت به پزشک مراجعه کنید.\n" +
//            "* در صورت مصرف طولانی مدت آزمایش خون عملکرد کلیه و کبد بصورت دوره ای انجام شود.\n","* به هیچ عنوان همراه مصرف این قرص از الکل و مواد مخدر استفاده نکنید.\n" +
//            "* مصرف در حاملگی و شیردهی، ممنوع است. در صورت شک به حاملگی یا قصد بارداری به پزشک معالج مراجعه نمائید.\n" +
//            "* دارو را به طور ناگهانی قطع نکنید.\n" +
//            "* در طی مصرف دارو از رانندگی اجتناب نمایید.\n" +
//            "* در صورت زرد شدن چشم ها و پوست و تشنج و یا حساسیت به دارو (جوش های پوستی، خارش، ورم در گلو و لب ها و زبان) و مشکل تنفسی و سر گیجه به پزشک مراجعه نمائید.\n","* این دارو را همزمان با دارو ها تتوفیلین، داروهای ضد تشنج و شربت های معده و آنتی اسید و وارفارین استفاده نکنید.\n" +
//            "* در صورت بروز درد شکم ، تب ، تهوع و استفراغ را به پزشک اطلاع دهید.\n" +
//            "* در صورت بروز اسهال دارو را قطع و به پزشک مراجعه نمایید.\n" +
//            "* مدت زمان درمان با این دارو 5 روز می باشد.لزوما 5 روز نیست، 5 روز شایع ترین دستور دریافت است.\n","سفتریاکسون\tویال یک گرمی\n" +
//            "500 میلی گرمی\tدارو را بصورت عضلانی و وریدی می باشد.\tهر 12 تا 24 ساعت \t* هر علامتی که نشان دهنده خونریزی باشد مانند کبودی بدن، خونریزی از بینی ، لکه لکه شدن بدن را به پزشک اطلاع دهید (این دارو فلوئور طبیعی روده را در مصرف طولانی مدت تغییر داده و باکتری های مفید روده را که ویتامین K می سازند را کاهش می دهد)\n" +
//            "* بروز زائده های خزء مانند و سیاه روی زبان و خارش و ترشح واژینال و مدفوع شل (اسهال) را بخصوص اگر همراه چرک و موکوس باشد و تب را اطلاع دهید.\n" +
//            "* قبل از شروع درمان با آن باید از عدم حساسیت به پنی سیلین و سفالوسپورین ها مطمئن شوید.\n" +
//            "* علائم حساسیت به دارو، تب و لرز، کهیر، راش و تنگی نفس می باشد که باید دارو سریعاً قطع و اقدام لازم انجام شود .\n" +
//            "* در نارسائی کلیه و کبد با احتیاط داده شود.\n" +
//            "* در سنگ های صفراوی داده نشود (باعث غلیظ شدن صفرا می شود).\n","پنتوپرازول\tآمپول 40 میلی گرم \n" +
//            "قرص 40 و 20 میلی گرم\tدرمان زخم ها و خونریزی های گوارشی \tنیم ساعت (صبحانه)\n" +
//            "قبل از غذا مصرف شود.\t* در صورت واکنشهای حساسیتی با این دارو مثل کهیر، خارش، ورم دهان و لب ها، گلو و زبان، تنگی نفس را اطلاع دهید.\n" +
//            "* اسهال یا درد شدید معده ، خون در مدفوع ، ادرار کم ، مدفوع کم رنگ و زردی پوست و چشم و کبودی و خونریزی غیرمعمول را اطلاع دهید. \n","* باعث تغییر رنگ ادرار به رنگ قرمز می شود که مشکلی ندارد.\n" +
//            "* در صورت بروز تغییر رنگ پوست و خشکی غیر طبیعی به پزشک مراجعه نمائید.\n" +
//            "* در طول مصرف عملکرد کبد باید بررسی شود.\n","استرپتومایسین\tویال 1 گرمی\n" +
//            "\tدرمان برخی عفونت ها (بخصوص در درمان تب مالت کاربرد دارد)\t\t* داروهای مانند وانکومایسین، آمفوتریسین، سیکلوسپورین نباید با این دارو همزمان استفاده شود.\n" +
//            "* این دارو در بارداری منع مصرف دارد.\n" +
//            "* هنگام تهیه محلول استرپتومایسین از دستکش استفاده کنید.\n" +
//            "* این دارو را نباید به شکل تزریق وریدی استفاده کرد.\n" +
//            "* در طی درمان با این دارو به علائم وزوز گوش، کاهش شنوایی، سرگیجه، حساسیت شدید(کهیر، خارش) وتب دقت کرد. در صورت به وجود آمدن این علائم سریع به پزشک اطلاع دهید.\n" +
//            "* توصیه می شود در زمان استفاده از این دارو مایعات بیشتر (6 تا 8 لیوان)استفاده کنید.\n" +
//            "* در طول درمان با این دارو باید حداقل 1500 سی سی ادرار داشته باشید.\n","* عوارض جانبی این دارو تهوع و استفراغ، اسهال، نفخ شکمی، ریزش مو و سرماخوردگی می باشد.\n" +
//            "* مصرف آن در حاملگی و شیردهی طبق نظر پزشک با حداقل دوز مانعی ندارد.\n" +
//            "* عملکرد کلیه قبل از مصرف دارو، 3 ماه پس از درمان و بصورت دوره ای سالیانه باید بررسی شود.\n" +
//            "* از جویدن و خرد کردن قرص خودداری نمایید.\n" +
//            "* اجابت مزاج قبل از مصرف شیاف انجام شود.\n" +
//            "* انما با این دارو شب ها و حد اقل 8 ساعت بماند.\n" +
//            "* پاسخ درمانی معمولا در خلال 3 – 21 روز ایجاد می شود.\n" +
//            "* در صورت بروز خونریزی، تاول، درد، سوزش، خارش در ناحیه رکتوم به پزشک معالج مراجعه نمایید.\n" +
//            "* در خلال مصرف این دارو از مصرف دیگر دارو ها بدون دستور پزشک خودداری نماید.\n" +
//            "* از قطع ناگهانی قرص پرهیز نماید.\n","* برگه رضایت آگاهانه مبتنی بر انجام آزمایش و خطرات احتمالی ناشی از آن باید توسط بیمار و همراهان درجه 1 وی قبل از آزمون تکمیل، امضاء و ممهور به اثر انگشت شود.\n" +
//            "*سابقه حساسیت به ید، مواد حاجب ید دار، پنی سیلین،  اموکسی  سیلین ،آلرژی و آسم، بیماری شدید قلب و عروق و نارسائی کلیه و دهیدراتاسیون منع مصرف دارد.\n" +
//            "* سابقه بیماری های سرع و تشنج، تیروئید، میاستنی گراو،کم خونی سلول داسی شکل، مولتیپل میلوما، دیابت همچنین اسهال و استفراغ شدید و مکرر در چند روز اخیر و حاملگی و شیردهی سوال تا تصمیم مناسب اخذ شود.\n" +
//            "* کلیه داروهای مصرفی و حتی داروهای غیر نسخه ای مصرفی را اطلاع دهید بخصوص داروهای فشارخون (بتابلوکرها و کلسیم بلوکرها) داروهای ضد سرطان (اینترلوکین 2) و داروهای خوراکی دیابت را اطلاع دهید.\n" +
//            "* متفورمین 48 ساعت قبل و بعد از تزریق ماده حاجب باید قطع شود.\n" +
//            "* از سلامت آنژیوکت بیمار مطمئن باشید و آنژیوکت سبز یا خاکستری برای وی گرفته شود.\n" +
//            "* معمولاً بصورت تزریقی یا خوراکی استفاده می شود؛ در نوع خوراکی قبل از انجام تصویربرداری آمپول در  5/1 لیتر آب حل شده و از 5/1 ساعت قبل از اسکن هر 15 دقیقه یک لیوان خورده ودر انتها به اندازه دو لیوان در بطری نگه داشته شود؛ هنگام مراجعه به واحد تصویربرداری همراه خود داشته باشد.\n" +
//            "* قبل از شروع داروی خوراکی، مثانه باید تخلیه شود و حین مصرف دارو به هیچ وجه تا پایان CT، نباید مثانه تخلیه شود؛ در صورتی که بیمار سونداژ باشد، باید کلمپ شود؛ باید مثانه در حین CT با کنتراست خوراکی و وریدی پر باشد.\n" +
//            "* ممکن است بیمار به دنبال تزریق ماده حاجب احساس گرمی و برافروختگی پوست و سراسر بدن و طعم فلزی در دهان شود که طبیعی بوده و در عرض چند دقیقه پایان می یابد. سایر علائم حسایت خفیف تهوع، استفراغ، کهیر، تب، سردرد، خارش و سرگیجه می باشد؛ در موارد شدیدتر ممکن است خس خس یا اشکال در تنفس و کاهش فشار خون نیز اتفاق بیفتد، که در صورت بروز آن باید تزریق قطع شود. وقوع حساسیت از بدو تزریق تا 40 دقیق پس از تزریق در حداکثر است اگرچه در برخی موارد نادر تا 48 ساعت پس از تزریق ماده حاجب نیز دیده شده است.\n" +
//            "* برای جلوگیری از واکنش های ناخواسته معمولاً از آنتی هیستامین و استروئیدها (هیدروکورتیزون)استفاده می شود.\n" +
//            "*3 تا 6 ساعت قبل از آزمون ناشتا باشد.\n" +
//            "* چک آزمایش عملکرد کلیه (اوره و کراتنین)قبل از انجام آزمون صورت گیرد و به همراه سونوگرافی به واحد تصویربرداری ارسال شود.(در60 \uF03E BUN و 5/1 \uF03E Cr قابل انجام نیست).\n" +
//            "* در صورت انجام باریوم انما و گرافی معده با مواد حاجب تا 10 روز نمی توان CT با کنتراست خوراکی و تزریقی انجام داد.\n" +
//            "* پس از اتمام CT با کنتراست خوراکی و تزریقی مثانه تخلیه شود و نوشیدن آب و مایعات فراوان جهت دفع سریعتر دارو توصیه می شود.\n" +
//            "* در بیماران مبتلا به نارسائی قلبی پیشرفته بخصوص اگر دارو دیورتیک مصرف می کنند، چندین ساعت بعد از انجام آزمون از نظر عملکرد کلیه باید تحت نظر باشند.\n" +
//            "* چک آزمایشات تیروئیدی در صورت تزریق مواد حاجب باید بعد از یک هفته صورت گیرد.\n" +
//            "* آزمایشات بیلی روبین، آهن، روی، مس حداقل به فاصله زمانی 48 ساعت بعد از تزریق مواد حاجب ید دار انجام شود.\n" +
//            "*قطع موقت شیردهی تا حداقل 24 ساعت پس از تجویز این ماده صورت گیرد.\n","* اگر عوارض جانبي در حين تزريق ايجاد شوند بايد تزريق متوقف شود.\n" +
//            "* بيماران بايد قبل و به دنبال مصرف داخل وريدي ماده حاجب كاملاً هيدراته شوند.\n" +
//            "* مانند ساير مواد حاجب، به علت احتمال ناسازگاري شيميايي بايد به تنهايي تزريق شود.\n" +
//            "* در طي تمام مراحل تزريق بايد استريليته حفظ گردد و دماي دارو بايد هم دماي بدن و اتاق باشد.\n" +
//            "* بر آزمايشهاي انعقاد، پلاكت، اريتروسيت، فعال سازي كمپلمان تأثير مي\u200Cگذارد.\n" +
//            "* در مایلوگرافی با ویزیپک، رانندگی 24 ساعت پس از تزریق انجام شود.\n" +
//            "* سایر موارد که در مورد نکات هنگام مصرف مگلومین ذکر شد در این مورد نیز رعایت شود.\n","* در صورت بروز احساس سوزش در پوست، پوسته پوسته شدن، خارش، تورم، سفت شدن و ضخیم شدن پوست، ضایعات قرمز یا تیره روی پوست، سفتی در مفاصل همراه با مشکل در حرکت، خم کردن یا صاف کردن دست ها، پاها، درد در استخوان ران یا دنده ها، یا ضعف عضلانی با پزشک خود تماس بگیرید.\n" +
//            "* در موارد منع MRI ممنوعیت دارد (داشتن پیس میکر = ضربان ساز قلبی ، گیره های فلزی عروقی)\n" +
//            "* دوتارم تنها به صورت تزریق وریدی قابل استفاده است.\n" +
//            "* در صورت بروز علائم زیر بعد از تزریق دوتارم به پزشک و پرستار خود اطلاع دهید: سرماخوردگی، سرد شدن پوست، سردرگمی، سرگیجه، سردرد،ضربان قلب نامنظم و کوبنده، صدای پتک در گوش، عصبی شدن، ضربان قلب آهسته یا سریع .\n" +
//            "* سایر موارد که در مورد نکات هنگام مصرف مگلومین و ویزیپک ذکر شد در این مورد نیز رعایت شود.\n"};
}

