package com.example.nazanin.hospitalapp;

import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.TextView;


public class Questions extends Fragment {

    String text;

    public void SetTitle(String para)
    {
        this.text = para;
    }
    public TextView tvQuestions;


    public static Questions newInstance() {
        Questions fragment = new Questions();

        return fragment;
    }

    @Override
    public void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);

    }

    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container,
                             Bundle savedInstanceState) {


        // Inflate the layout for this fragment
        View v= inflater.inflate(R.layout.fragment_questions, container, false);
        tvQuestions = v.findViewById(R.id.textQuestions);
        tvQuestions.setText("سؤال های مرتبط با اعتباربخشی کلیه واحدهای بیمارستان\n" +
                "\uF076\tواحد آموزش به بیمار :\n" +
                "1-\tحداقل های آموزش به بیمار توسط پرستار را نام ببرید؟\n" +
                "\n" +
                "حداقل موارد آموزش به بیمار\n" +
                "الف) آموزش به بیمار در بدو ورود\n" +
                "•\tمعرفی بخش\n" +
                "•\tامکانات رفاهی و خدمات بیمارستان\n" +
                "•\tمنشور حقوق بیمار\n" +
                "•\tمسئول بخش\n" +
                "•\tپرستار مسئول بیمار\n" +
                "•\tپزشک معالج بیمار\n" +
                "•\tتوضیح قوانین بخش مربوطه\n" +
                "•\tهزینه های قابل پیش بینی درمان\n" +
                "•\tمعرفی تیم درمان و نحوه دسترسی به آنها\n" +
                "•\tرعایت نکات بهداشتی\n" +
                "•\tتوصیه های ایمنی ( پیشگیری از سقوط و...)\n" +
                "•\tرضایت آگاهانه برای اقدامات تهاجمی\n" +
                "•\tآمادگی قبل از جراحی\n" +
                "•\tاستفاده ایمن از تجهیزات بخش\n" +
                "\n" +
                "ب) آموزش به بیمار حین بتسری در بخش\n" +
                "•\tبیماری زمینه ای، نوع درمان و روشهای جایگزین آن\n" +
                "•\tروشهای تشخیصی\n" +
                "•\tتغذیه\n" +
                "•\tچگونگی مصرف دارو (استفاده ایمن از دارو ها)\n" +
                "•\tمیزان فعالیت\n" +
                "•\tبرنامه های خود مراقبتی (در مورد بیماری های مزمن) و معرفی آنها به واحد آموزش به بیمار\n" +
                "•\tعوارض احتمالی، سیربیماری و روش برخورد با عوارض\n" +
                "•\tپوزیشن مناسب، نحوه مراقبت از خود\n" +
                "•\tمدیریت درد\n" +
                "•\tمسائل روحی روانی\n" +
                "\n" +
                "\n" +
                "ج) آموزش به بیمار در زمان ترخیص:\n" +
                "•\tرژیم غذایی( مواد غذایی مجاز و غیر مجاز برای مصرف)\n" +
                "•\tدارو های مصرفی در منزل ( نحوه، مقدار و زمان مصرف دارو ها و راهنمای استفاده از دارو های قبل از بستری)\n" +
                "•\tعلایم و نشانه های خطر برای مراجعه\n" +
                "•\tراهنمای مراقبت در منزل ( وضعیت حرکتی بیماران در منزل)\n" +
                "•\tپیگیری های پس از ترخیص ( زمان و مکان مراجعه بعدی بیمار به پزشک)\n" +
                "•\tمعرفی بیمارانی که به برنامه های خود مراقبتی در منزل نیاز دارند و به واحد آموزش به بیمار\n" +
                "\n" +
                "\n" +
                "2-\tدستورالعمل های  خودمراقبتی بیمار در بیمارستان امام حسن (ع) را شرح دهید؟\n" +
                "\n" +
                "پوشه فایل های عمومی –بهبود کیفیت –اعتباربخشی 96-دستورالعمل های و روش اجرایی نهایی-دستورالعمل آموزش خودمراقبتی بیمار – کد دستورالعمل: NK-IH-IN-13-01 \n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\uF076\tواحدآزمایشگاه : \n" +
                "1-\tذکر نام آزمایش که نیاز به ناشتا بودن دارند؟ Iron – Lipase- ALK-FBS- Folic Acid   \n" +
                "2-\tذکر نام 3 آزمایش که ترجیحا باید بیمار ناشتا باشد؟  GGT - PSA  -    -  انسولین \n" +
                "3-\tبر روی لیبل آزمایش ذکر چه مواردی الزامی می باشد ؟\n" +
                "1)  تاریخ ، ساعت نمونه گیری 2)نام بیمار  3) نام بخش 4) درج آزمایش درخواستی \n" +
                "4-\tنام فرد نمونه گیر برای چه نمونه   ای الزامی است؟ \n" +
                "نمونه ارسالی به بانک خون \n" +
                "5-\tتعیین هویت بیمار با حداقل 2 کد شناسایی بر روی نمونه بیمار را نام ببرید؟ \n" +
                "الف: کد پذیرش آزمایشگاه بر روی لیبل     ب: نام و نام خانوادگی \n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\uF076\tواحد بانک خون: \n" +
                "\n" +
                "1-\tمعیار های پذیرش یا عدم پذیرش فراورده های خونی به منظور تزریق به بیماران کدام شرایط قابل قبول است ؟ لیپمیک : در فراورده های گلبول قرمز ، پلاکت ، پلاسما ، کرایو  قابل قبول است .\n" +
                "ایکتریک : در همه موارد بالا قابل قبول است .\n" +
                "2-\tعوارض تأخیری ( واکنشهایی با فاصله زمانی بیش از 24 ساعت از شروع تزریق خون ) کدام است ؟ \n" +
                "خستگی ، زردی ، گرگرفتگی و لرز \n" +
                "3-\tاقداماتی که پس از مشاهده عوارض تأخیری تزریق خون باید انجام داد چه مواردی است؟ \n" +
                "-\tتحت نظر گرفتن علائم نارسایی کلیوی ، توجه و نظارت بر خروجی ادرار\n" +
                "-\tگرفتن نمونه خون جهت چک مجدد گروه خونی و وضعیت آنتی بادی \n" +
                "-\tتکمیل فرم عوارض \n" +
                "-\tارتباط با آزمایشگاه بانک خون برای یافتن فراورده سازگار \n" +
                "-\tنظارت بر میزان بیلی روبین و هموگلو بین\n" +
                "4-\tکدام فراورده در صورت تأیید پزشک می تواند بصورت غیر هم گروه با خون بیمار تزریق شود ؟ \n" +
                "پلاکت و FFP و کرایو : در ارتباط با FFP و کرایو در مواقع اورژانسی و یا کمبود فراورده اگر از نظر RH یکی نباشد ولی حتما باید از نظر ABO یکی باشد و    AB+ ، FFPدهنده همگانی می باشد. \n" +
                "5-\tدر کدام فراورده پلاکتی فراورده باید حتما همگروه از نظر ABO و RH باشد؟ پلاکت فرزیس\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\uF076\tواحد داروخانه : \n" +
                "1-\tفارماکوپه دارویی در بخش موجود می باشد؟  بله                         مشاهده و مصاحبه\n" +
                "2-\tآیا فهرست داروهای ضروری طبق فارماکوپه بیمارستان در بخش موجود می باشد؟  بله                  مشاهده و مصاحبه\n" +
                "3-\tآیا فهرست داروهای حیاتی و لیست مشابه ( ظاهری ، لفظی ) در بخش موجود می باشد ؟ بله                مشاهده و مصاحبه\n" +
                "4-\tآیا فهرست داروهای پرخطر موجود می باشد ؟  بله                      مشاهده و مصاحبه\n" +
                "5-\tدستورالعمل برچسب گذاری داروهای پرخطر در بخش ها موجود می باشد؟ بله                 مشاهده و مصاحبه\n" +
                "6-\tداروهای یخچالی با چه رنگی در یخچال نگهداری می شود ؟ آبی رنگ \n" +
                "7-\tداروهای پرخطر با چه بر چسب رنگی می باشدو چه تعداد است؟  12 عدد – با برچسب قرمز رنگ بدون اسم دارو \n" +
                "8-\tداروهای مشابه ظاهری با چه برچسب رنگی نگهداری می شود؟  برچسب زرد رنگ \n" +
                "9-\tمحل نگهداری داروهای مخدر کجاست ؟ گاوصندوق و کلید دست مسئول شیفت می باشد .\n" +
                "10-\tدمای یخچالی در چه محدودهای می باشد؟ 2-8 درجه سانتی گراد\n" +
                "11-\tآیا فهرست داروهای خودبخود متوقف شونده در بخش موجود می باشد؟ بله \n" +
                "12-\tقفسه داروهای پرخطر را با چه رنگی علامت گذاری می شود ؟ برچسب قرمز با نام دارو و دوز دارو \n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\uF076\tواحد آشپزخانه : \n" +
                "1-\tآیا پرستار گاواژ کننده آموزش های لازم را دیده و گواهی مربوطه موجود است؟ \n" +
                "    بله ،  سرپرستار بخش آموزش لازم را داده و گواهی مربوطه را تأیید کرده است.\n" +
                "2-\tآیا پرستار گاواژ کننده هنگام تحویل گرفتن ظروف گاواژ به برچسب ساعت تهیه گاواژ توجه می کند ؟ \n" +
                "بله  ، از تحویل گاواژهای فاقد برچسب امتناع کرده و گاواژهای تهیه شده بیش از نیم ساعت قبل را تحویل گرفته و به کارشناس تغذیه اطلاع می دهد .\n" +
                "3-\tآیا پرستار گاواژ کننده هنگام گاواژ کردن حداکثر مدت یکساعت از تهیه گاواژ را رعایت می کند؟ \n" +
                " بله ، از گاواژهایی که  بیش از یکساعت تهیه شده امتناع کرده و درخواست گاواژ تازه می کند .\n" +
                "4-\tآیا پرستار در صورت عدم سرو غذا توسط بیمار علت را جویا می شود ؟ بله در صورت عدم رضایتمندی بیمار علت را جویا شده و موارد را به کارشناس تغذیه اطلاع می دهد. \n" +
                "5-\tپرستاردر صورت عدم انطباق رژیم غذایی بیمار با غذای ارائه شده چه اقدامی انجام می دهد ؟ \n" +
                "از سرو غذا جلوگیری کرده تقاضای اصلاح رژیم توسط پرسنل آشپزخانه را می کند و موضوع را به کارشناس تغذیه اطلاع می دهد. \n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\uF076\tواحد مدارک پزشکی  : \n" +
                "1-\tتکمیل فرم شرح حال بطور صحیح به چه صورت است؟ \n" +
                "1-\tثبت مشخصات بیمار \n" +
                "2-\t ثبت شکایت اصلی بیمار ، تاریخچه بیماری فعلی و بیماریهای قبلی \n" +
                "3-\tثبت داروهای در حال مصرف و سایر اعتیادات ، حساسیت ، سوابق فامیلی\n" +
                "4-\tثبت معاینات وبررسی های بالینی ، نتایج معاینات بالینی \n" +
                "5-\tثبت تشخیص اولیه و افتراقی و طرح درمان در فرم شرح حال \n" +
                "2-\tنحوه تکمیل صحیح فرم اعزام توسط پزشک معالج به چه صورت است؟ \n" +
                "پزشک معالج در زمان اعزام به سایرمراکز، گزارش اقدامات انجام شده را در فرم اعزام به صورت خوانا و کامل ثبت نموده و نسخه اصلی به  بیمارستان مقصد ارسال و تصویر آن ممهور به مهر و امضای اصلی پزشک معالج در پرونده بیمار بایگانی می شود.\n" +
                "1.\tثبت گزارش اقدامات انجام شده در فرم اعزام بیمار به سایر مراکز توسط پزشک معالج \n" +
                "2.\tارسال اصل فرم اعزام به بیمارستان مقصد \n" +
                "3.\tبایگانی کپی فرم اعزام داخل پرونده بیمار بعد از امضاء و مهر اصلی\n" +
                "3-\tآیا گزارش موارد نقص به افرادی که مجاز به ثبت اطلاعات در پرونده بیماران هستند توسط منشی بخش ها انجام می شود ؟ \n" +
                "بله – پرونده های پزشکی قبل از ارسال به واحد مدیریت اطلاعات سلامت توسط منشی بخش و بر اساس چک لیست ممیزی اوراق پرونده پزشکی مورد بازبینی قرار می گیرد و نتایج حاصل از بازبینی پرونده های پزشکی به افرادی که مجاز به ثبت اطلاعات در پرونده بیماران هستند بازخورد داده می شود .\n" +
                "توضیحات : چک مجدد پس از رفع نقص انجام می شود و بازخورد بازبینی فرم ها به کارکنان مستند ساز اعم از پزشک و پرستار ارائه می شود . \n" +
                "4-\tتکمیل  مشخصات بیمار در سربرگ فرم های پرونده به چه صورت انجام  می شود  ؟\n" +
                "اطلاعات هویتی و دموگرافیک بیمار در فرم پذیرش و خلاصه ترخیص و مشخصات بیمار در سربرگ سایر فرم های پرونده پزشکی به طور کامل تکمیل شده است .\n" +
                "تکمیل تمامی اطلاعات دموگرافیک ( شامل نام و نام خانوادگی ،  نام پدر ، تاریخ تولد ، کد ملی ، وضعیت تأهل ، آدرس ، شماره تلفن ) بیماران در فرم پذیرش و خلاصه ترخیص\n" +
                "5-\tآیا ثبت تشخیص نهایی با مهر و امضای پزشک معالج در هر دو فرم پذیرش و خلاصه پرونده توسط پزشک معالج انجام می شود ؟ بله –مهر و امضاء هر دو فرم توسط پزشک معالج و ثبت تشخیص نهایی الزامی است .\n" +
                "6-\tآیا سرپرستاران مسئولین بخش ها از فرآیند طراحی و جاگذاری فرم های جدید آگاهی دارند ؟ \n" +
                "بله – فایل پیوست در پوشه مدارک پزشکی – فایل اعتباربخشی-\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\uF076\tواحد بهداشت حرفه ای : \n" +
                "1.\tآیا عوامل زیان آور فیزیکی محیط کار خود را می شناسید؟ آیا اندازه گیری تا به حال انجام شده است؟\n" +
                "عوامل زیان آورمثل مواجهه با صدای زیاد-مواجهه با نور زیاد-مواجهه با پرتو های یونیزان و غیر یونیزان-دما و شرایط رطوبتی زیاد محیطی\n" +
                "اندازه گیری توسط واحد بهداشت حرفه ای و خانم قلیزاده انجام شده است.\n" +
                "2.\tآیا عوامل زیان آور شیمیایی محیط کار خود را می شناسید؟ آیا تا به حال اندازه گیری انجام شده است؟\n" +
                "عوامل زیان آور مثلگرد و غبار-دود و دمه-گاز ها و بخارات\n" +
                "اندازه گیری توسط واحد بهداشت حرفه ای و خانم قلیزاده انجام شده است.\n" +
                "3.\tآیا عوامل زیان آور بیولوژیک محیط کار خود را می شناسید؟ آیا تا به حال اندازه گیری انجام شده است؟\n" +
                "عوامل زیان آور مثل ویروس ها-باکتری ها- قارچ ها و انگل ها\n" +
                "اندازه گیری توسط واحد بهداشت حرفه ای و خانم قلیزاده انجام شده است.\n" +
                "4.\tآیا اصول ارگونومی حمل بار و ارگونومی اداری را می دانید؟\n" +
                "هنگام برداشتن اجسام سنگین به طور کامل می نشینیم و سپس با کمک ماهیچه های ران پا بلند شده و بار را تا حد امکان نزدیک به بدن حمل می کنیم.\n" +
                "هنگام جابه جایی ترایلی ها و بین ها به جای کشیدن از عمل هل دادن استفاده می کنیم.\n" +
                "در هنگام کار با رایانه از حداکثر فضای صندلی استفاده کرده و تا حد امکان به میز نزدیک می شویم.\n" +
                "5.\tآیا ترتیب پوشیدن و در آوردن وسایل حفاظت فردی را می دانید؟\n" +
                "ترتیب پوشیدن: قدم اول پوشیدن روپوش         قدم دوم : پوشیدن ماسک           قدم سوم: پوشییدن محافظ چشم (عینک و شیلد)          قدم چهارم: پوشیدن کلاه (در صورت نیاز)           قدم پنجم  : پوشیدن دستکش(روی مچ ها را کاملا بپوشاند)\n" +
                "ترتیب در آوردن: 1-ابتدا جزئی را که آلودگی بیشتری دارد در آورده و سپس دستکش ها و گان ها به سمت داخل پیچانده و دفع می کنیم. \n" +
                "2-اجرای عملیات شستن دست       3- در اوردن کلاه       4- در آوردن محافظ چشم          5-خارج کردن ماسک از پشت سر         6-اجرای عملیات بهداشت دست\n" +
                "6.\tآیا نحوه صحیح شستن دست را می دانید؟ چه مدت زمانی طول می کشد؟\n" +
                "\uF0D7\tابتدا دست ها را با آب مرطوب کنید سپس کلیه سطوح دست را با صابون بپوشانید.\n" +
                "\uF0D7\tبا استافده از حرکات چرخشی کف دستان را به هم بمالید.\n" +
                "\uF0D7\tکف دست راست را بر روی کف دست چپ گذاشته( و بالعکس) و با فرو کردن انگشتان به داخل هم آنها را بمالید.\n" +
                "\uF0D7\tکف دست ها را مقابل هم گذاشته و با فرو کردن انگشتان آنها را بمالید.\n" +
                "\uF0D7\tانگشتان را به هم قلاب کرده و آنها را بمالید.\n" +
                "\uF0D7\tشست چپ و (بالعکس)را در میان دست دیگر گرفته و خوب بشویید.\n" +
                "\uF0D7\tدست ها را خوب آبکشی کرده و با دستمال کاغذی خشک کنید و با همان دستمال شیر آب را ببندید.\n" +
                "\n" +
                "7.\tآیا تا کنون معاینات شغلی سالیانه را انجام داده اید؟\n" +
                "بله معاینات بینایی سنجی –آزمایشات- و نوار قلب را انجام و به دکتر نصیری مرجعه کردیم و پرونده کامل شده را به واحد بهداشت حرفه ای خانم قلیزاده تحویل دادیم.\n" +
                "\n" +
                "8.\tهنگام نیدل استیک شدن یا درگیری در بخش و یا حوادث دیگر چه اقداماتی انجام می دهید؟\n" +
                "فرم ثبت حوادث شغلی پر کرده و به خانم قلیزاده واحد بهداشت حرفه ای تحویل می دهیم.\n" +
                "9.\tهنگام نیدل استیک شدن چه اقداماتی انجام می دهید؟\n" +
                "به خونروی کمک کرده و با آب و صابون محل را شست و شو می دهیم.آزمایش تیتر آنتی بادی را انجام داده و نتیجه را به واحد بهداشت حرفه ای تحویل می دهیم.\n" +
                "\n" +
                "10.\tآیا میدانید کتابچه ی مواد شیماییی چیست؟ و شامل چه اطلاعاتی می باشد؟\n" +
                "کتابچه توسط واحد بهداشت حرفه ای تدوین و شامل اطلاعات مختلف مواد شیمیایی مثل راهنمای استفاده از مواد شیمایی و  وسایل حفاظت فردی مورد نیاز محلول های شیماییی و اقدامات مورد نیازهنگام حادثه با مواد شیمیایی می باشد.\n" +
                "11.\tMsds و برچسب مواد شیمیایی چیست؟\n" +
                "برگه های اطلاعات ایمنی مواد شیمیایی هستند که نحوه استفاده از مواد شیمیایی نحوه خاموش کردن حریق مواد شیمیایی و وسایل حفاظت فردی مورد نیاز در هنگام کار کردن با ماده های شیمیایی را دارا می باشد.\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\uF076\tواحد بهداشت محیط: \n" +
                "1 -اهم فعالیتهاي بهداشت محیط عبارتند از :\n" +
                "الف-کنترل کیفی آب و فاضلاب              ب-مدیریت پسماند           ج-کنترل مواد غذائی               د- همه موارد\n" +
                "2- انواع پسماندهاي پزشکی و کدبندی مخصوص به هر پسماند را مشخص کنید.\n" +
                "پسماندهاي عادي : سطل آبی و پلاستیک آبی\n" +
                "پسماندهاي داروئی و شیمیائی : سطل سفید و پلاستیک سفید\n" +
                "پسماند عفونی: سطل زرد و پلاستیک زرد\n" +
                "نوك تیز و برنده: سطل زرد با درب قرمز یا Safety Box\n" +
                "3- زمان لازم جهت ضدعفونی دستها با محلول هاي الکلی و مواد شوینده چقدر است؟\n" +
                "20 -30ثانیه  برای محلولهای الکلی و 40 تا 60 ثانیه برای شستشو با مواد شوینده       \n" +
                "4-نوع هرکدام از پسماند های زیر را مشخص کنید.\n" +
                "سرنگ ها و وسایل تزریقات:تیزو برنده                                       ست سرم:عفونی\n" +
                "ملافه های یکبار مصرف:عفونی                                               مواد ضد عفونی تاریخ گذشته:شیمیایی\n" +
                "معرف هاي آزمایشگاه:شیمیایی                                                 کاغذ:عادی\n" +
                "پانسمان :عفونی                                                                  شیشه های آلوده:تیز و برنده       \n" +
                "داروهای تاریخ مصرف گذشته:دارویی                                       دستکش:عفونی\n" +
                "5-درستی یا نادرستی عبارت های زیر را مشخص کنید.\n" +
                "جداسازی ست سرم از سرم ممنوع می باشد و جز پسماند عفونی محسوب می شود.صحیح\n" +
                "در صورتی که مواد سایتوتوکسیک به سرم اضافه شود جز پسماند ویژه (شیمیایی و دارویی) محسوب می شود.صحیح\n" +
                "6-چه مواردی باید بر روی برچسب پسماند ذکر شود؟\n" +
                "1ـ نام، نشاني و شماره تماس توليدكننده. \n" +
                "2ـ نوع پسماند. \n" +
                "3ـ تاريخ توليد و جمع\u200Cآوري. \n" +
                "4ـ تاريخ تحويل. \n" +
                "5 ـ نوع ماده شيميايي. \n" +
                "7- فرایند شستشو و ضدعفونی ابزارهاي پزشکی به ترتیب کدام است؟\n" +
                "نظافت و پاکسازي-  آبکشی اولیه-  ضدعفونی-  آبکشی نهایی-  تحویل به واحد استریلیزاسیون مرکزي  \n" +
                "8-نحوه ی ضدعفونی موارد زیر را بنویسید با ذکر نحوه رقیق سازی و درصد رقت و مدت زمان لازم.\n" +
                "بدپن(لگن) / يورين بگ (لوله ادراري): ابتدا با ماده شوینده شستشو مدهیم سپس در محلول وایتکس 10% قرار می دهیم\n" +
                "هيپوکلريت سديم (آب ژاول) يا وايتکس 10 %= cc 100  محلول +  cc 900  آب و مدت زمان 10دقيقه\n" +
                "ترشحات خوني:با حوله آغشته به وایتکس 10% جمع آوری شود.مجددا محل مورد نظر را با وایتکس 10% تماس میدهیم و مدت زمان 10دقیقه نگهداری مینیم سپس با دستمال تمیز سطح مورد نظر را پاک میکنیم\n" +
                "هيپوکلريت سديم (آب ژاول) يا وايتکس 10 %= cc 100  محلول +  cc 900  آب و مدت زمان 10دقيقه\n" +
                "روشوئيها وسرويس بهداشتي:با استفاده از محلول پایین ضدعفونی انجام میگیرد\n" +
                "هيپوکلريت سديم (آب ژاول) يا وايتکس 1 %= cc 10  محلول + cc 990  آب مدت زمان 10 دقیقه\n" +
                "دستگاه دياليز: با استفاده از محلول پایین ضدعفونی انجام میگیرد\n" +
                "پرسيدين بدون رقیق سازی و مدت زمان 30 دقیقه\n" +
                "ابزار وتجهيزات پزشکي: با استفاده از محلول پایین ضدعفونی انجام میگیرد\n" +
                "سارفوسپت ابزار 2%= cc 20 محلول+ cc 980  آب مدت زمان 15دقيقه\n" +
                "سايا سپت اچ آي 2%=  cc 20 محلول+  cc 980  آب مدت زمان 15دقيقه\n" +
                "ضدعفوني سطوح پزشکي-دندانپزشکي و بهداشتي: با استفاده از محلول پایین ضدعفونی انجام میگیرد\n" +
                "سارفوسپت سطوح 1 % = cc 10  محلول + cc 990  آب مدت زمان 10-5 دقیقه\n" +
                "سايا سپت اچ پي  2% = cc  20 محلول+ cc 980  آب مدت زمان  5دقيقه\n" +
                "9-طبقه بندی رخت ها به چند دسته صورت میگیرد؟نحوه تفکیک و انتقال آنها به رختشویخانه را ذکر کنید.\n" +
                "رخت آلوده:البسه ای که به خون و ترشحات بدن بیمار آلوده باشد\n" +
                "ابتدا با استفاده از وسایل حفاظت فردی شامل:دستکش وماسک وچکمه وکسب اطمینان از نبود اجسام نوک تیز وبرنده، ملحفه آلوده را جمع آوری و باید در کیسه هاي غیر قابل نفوذ و غیرقابل نشت قرار داده شده  وبه بین  نارنجی  مخصوص حمل البسه آلوده منتقل وبا حداقل تلاطم وبه هم خوردگی جابه جا شود.\n" +
                "رخت کثیف و چرک:سایر البسه کثیف یا چرک نامیده میشود\n" +
                "ابتدا با استفاده از وسایل حفاظت فردی شامل:دستکش وماسک وچکمه وکسب اطمینان از نبود اجسام نوک تیز وبرنده، ملحفه  کثیف را به بین  نارنجی  مخصوص حمل البسه آلوده منتقل وبا حداقل تلاطم وبه هم خوردگی جابه جا شود.\n" +
                "\n" +
                "\n" +
                "\n" +
                "\uF076\tواحد ایمنی بیمار :\n" +
                "\n" +
                "1)\tمسئول ایمنی در بیمارستان شما چه کسی است و شرح وظایف را توضیح دهید  ؟  اقای دکتر سلطانی  ( قائم مقام مسئول فنی /مسئول ایمنی ) دکتر حقیقی مسئول فنی بیمارستان هستند . شرح وظایف مسئول ایمنی  شامل حوزه کارکنان ، ساختمان و بیماران می باشد .\n" +
                "2)\tکارشناس هماهنگ کننده ایمنی در بیمارستان شما کیست و شرح وظایف را توضیح دهید ؟  خانم فاطمه مویدی ( کارشناس هماهنگ کننده ایمنی بیمار )  حوزه شرح وظایف فقط ایمنی بیمار می باشد .\n" +
                "3)\t ایا از تقویم  بازدید های مدیریتی ایمنی بیمار در بیمارستان خود اطلاع دارید ؟ برنامه در تابلو اعلانات بخش نصب است و به تایید مسئول فنی رسیده است – هدف از بازدید های مدیریتی تعهد مدیران ارشد بیمارستان به مسئله مهم ایمنی بیمار در بیمارستان می باشد.\n" +
                "4)\tآیا اعضای بازدید های مدیریتی را می شناسید نام ببرید ؟ در برنامه ثبت شده اند و با حضور دکتر حقیقی و دکتر اوغازیان\n" +
                "5)\tایا شرایط تهدید کننده ایمنی بیمار اطلاع دارید و در گزارش پرستاری قید می نمایید ؟ بله .موارد ابلاغ شده به سرپرستار به صورت اتوماسیونی و  در فایل های عمومی – پوشه مویدی – شرایط تهدید کننده  به همراه اقدامات پیشگیرانه \n" +
                "6)\tبازخورد های فردی موارد گزارش شده در بازدید ها به سرپرستاران ابلاغ شده اطلاع دارید شرح دهید  ؟ بله به صورت اتوماسیونی به سرپرستاران ابلاغ شده \n" +
                "7)\tآیا  از شناسایی عوامل تهدید کننده  تدوین شده و الویت بندی شده و  اقدامات اصلاحی به سرپرستاران ابلاغ شده اطلاع دارید  شرح دهید ؟ بله به صورت اتوماسیونی ابلاغ شده و در فایل های عمومی – پوشه مویدی –\n" +
                "8)\tآیا از کنفرانس با موضوع خطا های پزشکی برگزار  شده اطلاع دارید ؟ بله توسط  خانم دکتر شاکری  ( معاون آموزشی بیمارستان ) برای تمام پرسنل پزشکان و دانشجویان پزشکی و پرسنل پرستاری و دانشجویان هر سه ماه  در تالار بیمارستان انجام میشود\n" +
                "9)\tمراحل فرآیند تحلیل علل ریشه ای خطا را نام ببرید ؟ موضوع :  -  اعضای تیم :  - گام اول : تعریف رویداد :- -  گام دوم : جمع آوری و نگاشت اطلاعات گام سوم : شناسایی مسئله ها :  - گام چهارم : تحلیل اطلاعات :  مسأله :   -  گام پنجم : تحلیل موانع :  موانع انسانی :  موانع اجرایی :  موانع فیزیکی :   موانع طبیعی :  گام ششم : ارائه راه حل و پیشنهادات :  - برنامه عملیاتی  :\n" +
                "10)\tابرازهای مورد استفاده برای تحلیل علل ریشه ای چیست ؟ ( 2 مورد نام ببرید )  بارش افکار – 5Why  - fish bone  و...\n" +
                "11)\tRCA مخفف چه کلمه ای می باشد توضیح دهید ؟ ( تعریف ) \n" +
                "12)\tFMEA مخفف چه کلمه ای می باشد توضیح دهید ؟ ( تعریف ) \n" +
                "13)\tهدف از RCAو FMEA  چیست ؟ \n" +
                "14)\tآیا از اطلاع رسانی نتایج تحلیل ریشه ای مرگ و میر ها اطلاع دارید ؟ شرح دهید ؟بله توسط خانم مویدی بعد از هر جلسه به صورت فرم مخصوص همراه کد RCA و نتیجه آن به بخش ارسال می شود و در تابلو اعلانات می باشد .\n" +
                "15)\tآیا از نحوه گزارش دهی همگانی خطا ها اطلاع دارید شرح دهید ؟ بله روش اجرایی  گزارش دهی همگانی خطا ها به صورت الکترونیک ابلاغ شده و مطالعه شده طبق آن عمل می شود و در فایل های عمومی در پوشه مویدی می باشد .\n" +
                "16)\tایا از فرم الکترونیک گزارش خطا اطلاع دارید شرح دهید ؟  بله  فرم الکترونیک گزارش خطا در فایل های عمومی پوشه مویدی وجود دارد و همه اطلاع داریم و در صورت بروز خطا حتما فرم تکمیل میشود \n" +
                "17)\tاشتراک گذاری علل خطا ها در بیمارستان شما به  چه صورت  انجام می شود ؟ سمینار یا کنفرانس دکتر شاکری -  جلسات درون بخشی – جزوه درس بگیریم – گزارش های صبح گاهی morning report  - و در اینده در ژونال کلاپ ها \n" +
                "18)\t از شاخص های ایمنی اطلاع دارید شرح دهید ؟ بله شاخص های ایمنی شامل سقوط از تخت – زخم بستر – عوارض انتقال خون – عوارض بیهوشی – نرخ کنترل عفونت – خونریزی یا هماتوم بعد عمل جراحی – مرگ و میر بعد MI  و جراحی بای پس -  \n" +
                "19)\tآیا بازدید تیم ایمنی و اعضای تیم را میشناسید ؟\n" +
                "20)\tایا موارد تهدید کننده ایمنی بیمار توسط مدیریت اجرایی ابلاغ شده ؟ شرح دهید ؟ \n" +
                "21)\tآیا از گزارش فوری وقایع ناخواسته تهدید کننده حیات در درمان و Never Events    آگاه هستید ؟ بله دستور العمل ابلاغ شده از معاونت درمان وزارت بهداشت به صورت الکترونیک و فیزیکی به سرپرستار ابلاغ شده و همه همکاران اطلاع دارند و 28  مورد میباشد . که هرگز نباید اتفاق بیفتد که توسط دکتر قاسم جان بابایی(معاون درمان وزارت بهداشت ) ابلاغ شده است . همراه فرم گزارش فوری وقایع ناخواسته تهدید کننده حیات در درمان بیماران می باشد .\n" +
                "\n" +
                "\uF076\tواحد مهندسی پزشکی : \n" +
                "\n" +
                "1-\tتهیه و تدوین شناسنامه تجهیزات پزشکی برای هر بخش چگونه است؟ پاسخ دستورالعمل نگهداری و به روز رسانی شناسنامه تجهیزات پزشکی  \n" +
                "2-\tآموزش فنی کاربران برای استفاده صحیح و ایمن دستگاه ها به صورت برنامه ریزی شده انجام می شود؟ بله آموزش در روزهای مختلف و با توجه به نیاز هر بخش صورت می گیرید که صورتجلسه ای برحسب برگزاری آزمون تهیه و در فایلی در واحد مهندسی پزشکی نگهداری می شود. و گواهینامه ای توسط واحد آموزش بیمارستان جهت پرسنل برای هر بخش صادر می گردد.\n" +
                "3-\tبخش تجهیزات پزشکی براساس راهنمای اصلی تجهیزات ، دفترچه راهنمای نگهداری و کاربری خلاصه شده تهیه نموده دور دسترس کاربران قرار می دهد؟پاسخ. راهنمای نگهداری و کاربری  همراه تجهیزات موردنیاز وهمچنین کتابچه های آموزش در بخش ها موجود میباشد\n" +
                "4-\tدر بخش ها / واحدهای بیمارستان راهنماهای تصویری کاربری سریع تجهیزات برای روشن و خاموش کردن و کاربردهای متداول و شایع تهیه شده و در کنار دستگاه (با پوشش فایل شستشو برای ضدعفونی در مواقع ضروری) یا در پوشه ای در محل کاربری دستگاهها موجود است.\n" +
                "5-\tخرید تجهیزات پزشکی غیر مصرفی بیمارستان مطابق ضوابط ابلاغی اداره کل تجهیزات پزشکی صورت می گیرد.\n" +
                "پاسخ روش اجرایی اقتصادسنجی و نظارت بر بروز بودن و افزایش مهرورزی تجهیزات پزشکی\n" +
                "6-\tروش اجرایی در کنترل کیفی تجهیزات پزشکی ، آزمون کالیبراسیون  تدوین شده و کارکنان از آن آگاهی دارند و براساس آن عمل می نمائید؟ پاسخ روش اجرایی کنترل کیفی تجهیزات پزشکی یا آزمون کالیبراسیون که در بیمارستان ما بیشترکنترل کیفی صورت میگیرد فایل انجام کنترل کیفی هر بخش  در واحد مهندسی پزشکی قرار دارد وبرچسپ آن بر روی دستگاه قرار دارد\n" +
                "7-\tروش اجرایی تامین تجهیزات پشتیبان و یا تعمیر آن ها در کوتاه ترین زمان ممکن و در طول شبانه روز و ایام تعطیلات با رعایت حداقل های مورد نظر تدوین شده و کارکنان مربوطه از آن آگاهی داشته و براساس آن عمل می نمایند؟ پاسخ روش اجرایی تامین تجهیزات پشتیبان و یا تعمیر آن ها در کوتاه ترین زمان ممکن\n" +
                "8-\tروش اجرایی سرویس ، مدیریت سرویس ها وبازدیدهای دوره ای (pm) تجهیزات پزشکی تدوین و کارکنان از آن آگاهی دارند و براساس آن عمل می کند؟ پاسخ روش اجرایی  سرویس ، مدیریت سرویس و بازدیدهای دوره ای  \n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "آموزش هاي مرتبط با واحد کنترل عفونت\n" +
                "عفونت هاي بيمارستاني : \n" +
                "ورود و تکثير يک عامل عفوني بيماريزا به بدن انسان يا جانوران را عفونت مي گويند ، واژه عفونت بيانگر استقرار و تکثير باکتري ها و ساير ميکرو ارگانيسم ها در بافت ها و سطوح بدن و تعامل آنها با بافت هاست . \n" +
                "اگر عکس العمل ميزبان ناچير باشد يا وجود نداشته باشد به آن کلوني يا استقرار مي گويند \n" +
                "عفونت هاي بيمارستاني ( Hospital Acquire InfedionياNosocomial Infecdion ) \n" +
                "به عفونت هايي گفته مي شود که در بيماران بعد از 48 تا 72 ساعت بستري شدن در بيمارستان به وجود مي آيد . اين عفونت ها قبلا در فرد وجود نداشته و در زمان پذيرش بيمار در دوره کمون نبوده است و بقاياي عفونت مربوط به پذيرش قبلي بيمار در بيمارستان نيست .\n" +
                "4 مورد عفونت بيمارستاني که در بيمارستان هاي کشور در حال بررسي و گزارش دهي هستند عبارتند از پنوموني _ (PENU-PENU) ، UTI (SUTI) ، Sepsis  (BSI) عفونت محل عمل جراحي (SSI) مي باشند . \n" +
                " \tعفونت مربوط به عمل جراحي (SSI ) به عفونتي گفته مي شود که طي 30 روز بروز کرده باشد در صورتي که هيچ چيزي (Implant) در محل قرار داده نشده باشد و يا طي يک سال بروز کرده در صورتيکه چيزي درون محل قرار گرفته باشد .\n" +
                "بيماراني که مبتلا به عفونت بيمارستان مي شوند مجبور به اقامت طولاني در بيمارستان خواهند شد که منجر به ازدياد هزينه هاي بيمارستاني براي آنها مي شود و بيمارستان نيز به علت از دست دادن اثر بخشي از لحاظ بهره وري کيفي از تخت هاي بيمارستاني زيان خواهد ديد . \n" +
                "چنين عفونت هايي به دلايل زير رخ مي دهد :\n" +
                "1- وضعيت جسمي ضعيف بيمار \n" +
                "2- واقع بودن بيمار در دو طرف طيف سني ( يا خيلي جوان يا خيلي پير )\n" +
                "3- کم شدن سيستم ايمني بيمار توسط بيماري ها يا به علت درمان ايمنوساپرسيو\n" +
                "4- روشهاي تشخيصي درماني ( استفاده از رسپيراتور – انتوباسيون – ساکشن کردن و غيره\n" +
                "5- بيماريهاي زمينه اي مانند ديابت \n" +
                "6- استفاده زياد از آنتي بيوتيک و مقاومت باکتري ها نسبت به نوع خاصي از آنتي بيوتيک \n" +
                "رعايت اصول بهداشتي توسط خود بيمار ، کارکنان بيمارستان و جلوگيري از کاهش مقاومت طبيعي بدن بيمار نقش زيادي در کنترل عفونت ها با منشاء داخلي دارد . \n" +
                "عفونت هاي با منشاء خارجي که از ساير بيماران يا کارکنان ناقل به وجود مي آيند بسيار خطر ناک هستند زيرا اغلب از باکتريها يا ارگانيسم هاي بيماريزايي هستند که به يک يا چند آنتي بيوتيک مقاوم شده اند \n" +
                "اين گونه عفونت ها به دلايل زير روي مي دهند :\n" +
                "1- عدم نظافت کامل محيط ، تجهيزات و ملزومات \n" +
                "2- استريلزاسيون و ضد عفوني ضعيف\n" +
                "3- مصرف غذاي آلوده \n" +
                "4- ايجاد اپيدمي ها در جامعه و گسترش آن به بيمارستان \n" +
                "5- انتقال عفونت از طريق کارکنان بيمارستان \n" +
                "جهت کنترل عفونت هاي بيمارستاني رعايت موارد زير الزامي است : \n" +
                "1- مهمترين عامل گسترش عفونت هاي بيمارستاني عدم رعايت اصول بهداشتي از جانب کارکنان بيمارستان هنگام شستشو و ضد عفوني کردن آنها مي باشد . احساس مسئوليت و تعهد از جانب کارکنان هنگام تماس با بيماران موجب پيشگيري از انتقال عفونت مي شود \n" +
                "2- ضد عفوني کامل محيط اطراف بيمار و استريل وسايل و تجهيزات شخصي و درماني بيمار در پيشگيري از انتقال عفونت بيمارستان بسيار موثر است .\n" +
                " 3- استفاده  درست و اثر بخش آنتي بيوتيک ها يعني اينکه آنتي بيوتيک ها بايد توسط افراد مجاز تجويز و زمان و نحوه استفاده از آن درست باشد و واقعاًً مورد نياز براي بيمار باشد . \n" +
                "4- احتياطات ايمني در مورد کارکنان بيمارستان بايد رعايت شود مانند واکسيناسيون هپاتيت B \n" +
                "5- شناسايي و گزارش دهي بموقع عفونت هاي بيمارستاني و بررسي از اين نظر که چرا و چگونه به وجود مي آيند .\n" +
                "7-\tعفونت ها ممکن است از طريق ملاقات کنندگان به بيمارستان و بر عکس منتقل شود بنابراين احتياطات لازم در اين زمينه بايد به کارگرفته شود . \n" +
                "\n" +
                "\n" +
                "\n" +
                "\n" +
                "پيشگيري از عفونت هاي بيمارستاني \n" +
                "1- ايرولاسيون يا جداساي بيماران در بيمارستان \n" +
                "هدف از اين جداسازي بيماران در بيمارستان ، جلوگيري از انتقال ميکروارگانيسم ها از بيماران( چه مبتلا به عفونت و چه کلونيزه با عفونت ها به ساير بيماران ، عيادت کنندگان و پرسنل پزشکي است با رعايت اصول جداسازي مشتمل بر دو قسمت «احتياطات استاندارد » و « احتياطات براساس راه انتقال بيماري » مي توان از بروز مشکلات فوق جلوگيري نمود . \n" +
                "1-1- احتياطات استاندارد (Standard precautions)\n" +
                "احتياطات استاندارد ، جايگزين ، احتياط هاي همه جانبه يا عمومي شده است و رعايت آنها براي تمام بيماران ضروري است ، در صورت تماس با خون ، تمام مايعات بدن ، ترشحات و مواد دفعي بدن بجز عرق ، پوست آسيب ديده و مخاط ها ، موارد زير ضروري است . \n" +
                "-\tپوشيدن دستکش\n" +
                "-\tشستن دست ها بلافاصله پس از خروج دستکش از دست ها دست ها ، بايد در فواصل تماس بين بيماران نيز شسته شوند . رفع آلودگي دست ها بايد قبل و بعد از تماس با بيماران و بلافاصله پس از خروج دستکش ها صورت گيرد . \n" +
                "-\tاستفاده از گان ، محافظ چشم همراه با ماسک يا محافظ صورت در صورت انجام اعمالي که احتمال پاشيده يا پخش شدن مايعات بدن وجود دارد . \n" +
                "-\tعدم دستکاري سوزن ها و وسايل تيز ، در پوش سوزن ها نبايد مجدداً روي سوزن ها قرار گيرد . سر سوزن ها نبايد خم يا شکسته شوند . \n" +
                "-\tسر سوزن ها و وسايل نوک نيز بايد در ظروف مقاوم به سوراخ شدگي دفع شوند.\n" +
                "توجه : 1- بدليل انتقال اکثر موارد عفونت بيمارستاني از طريق تماس ، بويژه با دست پرسنل ، شستن دست ها مهمترين راه پيشگيري از عفونت هاي بيمارستاني است . براي حفظ بهداشت دست هاي پرسنل ، از مواد حاوي الکل (Alcohol-based handrub ) استفاده مي شود \n" +
                "2- در صورت آلودکي قابل روئيت دست ها ، بايد آنها را با آب و صابون شست.\n" +
                "3- پوشيدن دستکش به هيچ وجه نبايد جايگزين شستن دست ها شود . \n" +
                "4- استفاده از ناخن مصنوعي توصيه نمي شود . \n" +
                "5- قبل از مراقبت بيمار بايد انگشتر از دست هاي پرسنل خارج شود .\n" +
                "2-1- احتياط هايي که بايد براساس راه انتقال عفونت ها رعايت گردد (Transmissian – Based precautim )\n" +
                "سه نوع احتياط براساس راه انتقال عفونت ها وجود دارد که عبارتند از هوا (Airborne) ، قطرات (Droplet) و تماس (Contact)\n" +
                "براي تعداد کمي از بيماري ها ( مانند آبله مرغان) رعايت بيش از يک نوع احتياط ضرورت مي يابد.\n" +
                "احتياط هاي هوايي (Airborne precautions ) \n" +
                "احتياط هاي هوايي براي جلوگيري از انتقال بيماري هايي که از طريق هسته با اندازه کوچکتر از 5 ميکرون يا ذرات گرد و غبار حاوي عامل عفوني (droplet nuclei) بکار مي رود . بيماري هايي که رعايت احتياط هوايي براي انها ضرورت دارد عبارتند از : \n" +
                "- سل ريه يا حنجره\n" +
                "- سرخک \n" +
                "- آبله مرغان ، يا روناي منتشر\n" +
                "اصول احتياطات هاي هوايي عبارتند از :\n" +
                " 1- بستري بيمار در اتاق خصوصي با فشار هواي منفي کنترل شده و حداقل 6 بار تعويض هوا در ساعت بايد صورت گيرد . \n" +
                "2- بستن درب اتاق بيمار \n" +
                "3- خروج هوا از اتاق بيمار بايد بطور مستقيم به فضاي خارج و بيرون باشد . چنانچه اين کار مقدور نباشد هوا بايد قبل از برگشت به سيستم تهويه عمومي ، با يک فيلتر قوي و کارا (HEPA) خارج گردد . \n" +
                "4 - تمامي افراديکه وارد اتاق بيمار مي شوند بايد از ماسک N95 استفاده کنند \n" +
                "5- جابجايي بيمار بايد محدود گردد و قبل از ترک اتاق ، بيمار بايد ماسک جراحي استاندارد بپوشد . پرسنلي که قرار است بيمار را تحويل بگيرند ، بايد قبل از جابجايي بيمار مطلع شوند تا احتياط هاي لازم را بکار گيرند .\n" +
                "احتياط قطرات (Dropletp)\n" +
                "براي جلوگيري از انتقال آئروسل هاي درشت ( قطره) از اين نوع احتياط استفاده مي شود . اين ذرات حين صحبت ،عطسه يا سرفه کردن يا در زمان انجام اعمالي مانند ساکشن يا برونکوسکپي ايجاد مي شود . براي عفونت هايي مانند باکتري هموفيلوس آنفلوانزاي نوع B مهاجم ، مننگوکوک ، بيماري پنوموکوک مقاوم به چند دارو ، مايکوپلاسماپنومونيد ، سياه سرفه ، ويروس آنفلوانزا ، اوريون ، سرخچه و پاروويروس  B19 رعايت احتياط قطرات ضروري است . \n" +
                "\n" +
                "اصول رعايت احتياط قطرات عبارتنداز : \n" +
                "1- بستري کردن بيمار در اتاق خصوصي ولي اقدام خاصي براي کنترل هواي اتاق ضرورت ندارد . ( در صورت وجود چند بيمار با يک بيماري خاص مي توان آنها را در يک اتاق بستري نمود \n" +
                "2- درب اتاق مي تواند باز بماند ( بدليل جابجايي کم ذرات در حدود يک متر)\n" +
                "3- در صورت کارکردن پرسنل در فاصله يک متري بيمار ، بايد از ماسک استاندارد جراحي استفاده گردد \n" +
                "4- استفاده از گان و دستکش تابع اصول احتياط هاي استاندارد است \n" +
                "5- در صورت انتقال و جابجايي بيمار در خارج از اتاق ، بيمار بايد ماسک استاندارد جراحي بپوشد. \n" +
                "احتياط تماسي (Contactp) \n" +
                "براي جلوگيري از انتقال ارگانيسم هاي مهم از لحاظ همه گير شناسي که مربوط به بيماران کلونيزه يا دچار عفونت بوده و از طريق تماس مستقيم ( لمس کردن بيمار) يا تماس غير مستقيم ( تماس با اشياء وسايل يا سطوح آلوده محيط بيمار) انتقال مي يابند رعايت احتياط تماسي توصيه مي شود . \n" +
                "در موارد و زير رعايت احتياط تماس ضرورت دارد : \n" +
                "-\tبيماران دچار عفونت يا کلونيزه با باکتري هاي مقاوم به چند دارو .\n" +
                "-\tعفونت هاي منتقل از راه مدفوعي – دهاني ( شيگلا ، روتاويروس و هپاتيت A ) در بيماراني که بي اختياري داشته يا از پوشک استفاده مي کنند . \n" +
                "-\tبيماري هاي اسهال حاد که احتمالاً داراي منشاء عفوني هستند \n" +
                "اصول احتياط هاي تماسي عبارتنداز : \n" +
                "1- بستري بيمار در اتاق خصوصي ( با بستري چند بيمار با عفونت يکسان در يک اتاق ، در صورت نبودن اتاق خصوصي به تعداد کافي )\n" +
                "2- استفاده از وسايل محافظت شخصي براي محافظت پوست مراجعه شده و لباس شامل : \n" +
                "-\tپوشيدن دستکش در زمان ورود به اتاق\n" +
                "-\tدر آوردن دستکش قبل از ترک اتاق \n" +
                "-\tرفع آلودکي دست ها با يک ماده طبي شوينده دست يا ماده حاوي الکل (Hand rub) بلافاصله پس از در آوردن دستکش \n" +
                "-\tجلوگيري از آلودگي مجدد دست ها قبل از ترک اتاق \n" +
                "-\tاستفاده از گان در صورت افزايش خطر تماس با مواد بالقوه عفوني بيمار\n" +
                "-\tقبل از ترک اتاق ايزوله ، گان بايد درآورده شود و بايد مراقب بود که لباس پرسنل آلوده نگردد .\n" +
                "-\tوسايل غير بحراني مراقبت از بيمار (گوشي ، دستگاه ، فشار سنج ) بايد در اتاق ايزوله مانند و براي ساير بيماران مورد استفاده قرار نگيرند . در صورت لزوم استفاده مشترک از انبار وسايل ، بايد آنها را ابتدا پاک و گندزدايي نموده و سپس مورد استفاده قرار داد . \n" +
                "-\tانتقال و جابجايي بيمار به خارج از اتاق ايزوله بايد حداقل ممکن برسد . \n");
        return v;
    }

}
